<?php module_head("F.A.Q. KDevelop $k_series_version (Foire Aux Questions)");?>
<b>Questions g&eacute;n&eacute;rales</b><br>
<ul>
<li><a href="#36"> O&ugrave; puis-je me procurer KDevelop? Comment l'installer&nbsp;?
</a></li>
<li><a href="#37"> Suis-je autoris&eacute; &agrave; d&eacute;velopper des applications commerciales avec KDevelop&nbsp;?
</a></li>
<li><a href="#137"> Suis-je autoris&eacute; &agrave; d&eacute;velopper des plugins commerciaux pour KDevelop&nbsp;?
</a></li>
<li><a href="#45"> J'ai compil&eacute; et install&eacute; KDevelop 3.0 mais tout ce que je vois, ce sont les menus Fichier et Aide
</a></li>
<li><a href="#100">Comment cr&eacute;er un simple projet avec seulement un Makefile (aussi connu sous le nom <em>Projet Personnalis&eacute;</em>)&nbsp;?</a></li>
</ul>
<b>Questions sur l'EDI KDevelop</b><br>
<ul>
<li><a href="#102">Comment cr&eacute;er des nouveaux fichiers dans un projet&nbsp;?</a></li>
<li><a href="#103">Comment ajouter des fichiers existants &agrave; un projet&nbsp;?</a></li>
<li><a href="#104">Comment supprimer un fichier d'un projet&nbsp;?</a></li>
<li><a href="#38">Comment passer d'un fichier ouvert &agrave; un autre avec le clavier&nbsp;?
</a></li>
<li><a href="#39">Comment entrer du texte pendant un d&eacute;bogage d'une application console&nbsp;?
</a></li>
<li><a href="#40">Comment activer l'ach&egrave;vement du code pour les biblioth&egrave;ques externes&nbsp;?
</a></li>
</ul>
<b>Probl&egrave;mes de compilation et de construction</b>
<ul>
<li>le script configure
<br>
<ul>
<li><a href="#3"> Le script configure ne trouve pas ma biblioth&egrave;que Qt.
</a></li>
</ul>
</li>
<li>configure.in.in
<br>
<ul>
<li><a href="#12"> Mon configure.in.in n'a aucun appel AC_CHECK_COMPILERS(). O&ugrave; placer le 
     CXXFLAGS="$CXXFLAGS $USE_EXCEPTIONS"
   mentionn&eacute; plus haut&nbsp;?
</a></li>
<li><a href="#25"> Dans les questions pr&eacute;c&eacute;dentes, je vois toujours « configure.in(.in)». J'ai les deux fichiers dans mon 
   projet. Quel fichier doit &ecirc;tre patch&eacute;&nbsp;?
</a></li>
<li><a href="#21"> Pourquoi patcher configure.in(.in) avec CXXFLAGS="$USE_EXCEPTIONS $CXXFLAGS" ne fonctionne pas&nbsp;?
</a></li>
<li><a href="#22"> J'utilise CXXFLAGS="$USE_EXCEPTIONS" dans configure.in(.in) et &ccedil;a marche bien,
   pourquoi utiliserais-je votre solution&nbsp;?
</a></li>
</ul>
</li>
<li>Makefile.am
<br>
<ul>
<li><a href="#17"> Quelle est la diff&eacute;rence entre CPPFLAGS et CXXFLAGS&nbsp;?
</a></li>
<li><a href="#18"> J'ai vu plusieurs solutions comme patcher Makefile.am avec
     DEFS+=-DMYDEFINE
   ou
     CXXFLAGS+=-fsigned-char
   ou
     LD_FLAGS+=-L/usr/local/lib
   Pourquoi ne pas les consid&eacute;rer&nbsp;?
</a></li>
<li><a href="#20"> AM_CXXFLAGS (dans un Makefile.am) peut-il &ecirc;tre utilis&eacute; comme drapeau comme -frtti ou
   -fexceptions&nbsp;?
</a></li>
</ul>
</li>
<li>htdig
<br>
<ul>
<li><a href="#29"> J'ai install&eacute; htdig mais htsearch est maintenant disponible &nbsp;?
</a></li>
<li><a href="#30"> J'ai htdig, htmerge et htsearch disponibles mais j'ai un message d'erreur qui signale que le fichier config
   de htdig ne peut &ecirc;tre trouv&eacute; ou est invalide &nbsp;?
</a></li>
</ul>
</li>
<li>automake, autoconf
<br>
<ul>
<li><a href="#19"> Comment &ecirc;tre certain qu'un utilisateur de mon projet le construira avec automake
   version 1.4&nbsp;?
</a></li>
</ul>
<ul>
<li><a href="#105">Que faire si un projet ne veut plus se construire apr&egrave;s avoir chang&eacute; de/vers la cible par d&eacute;faut&nbsp;?</a></li>
<li><a href="#106">Erreur « Mauvaise version autoconf » etc.</a></li>
<li><a href="#59"> J'ai ajout&eacute; un sous-projet existant &agrave; mon projet et &ccedil;a ne veut plus se construire.
</a></li>
</ul>
</li>
<li>rtti, run-time type information
<br>
<ul>
<li><a href="#13"> Je d&eacute;veloppe une application qui a besoin d'&ecirc;tre compil&eacute;e avec des infos &agrave; l'ex&eacute;cutionrun-time-type-info dedans.
   Comment faire&nbsp;?
</a></li>
</ul>
</li>
<li>TrollTech's Designer et KDevelop
<br>
<ul>
<li><a href="#28"> Y a-t-il des HOWTO disponibles sur la fa&ccedil;on de travailler avec des bo&icirc;tes de dialogues faites avec QT designer&nbsp;?
</a></li>
</ul>
</li>
<li>autres
<br>
<ul>
<li><a href="#101">Pourquoi ne vois-je pas les messages d'erreurs de compilation&nbsp;?</a></li>
<li><a href="#8"> Patcher configure/Makefile/Makefile.in/config.h n'aide pas, apr&egrave;s avoir d&eacute;marr&eacute;
   autoconf/automake/autoheader mes changements sont perdus.
   O&ugrave; patcher ces choses&nbsp;?
</a></li>
<li><a href="#9"> Je d&eacute;veloppe une application pour laquelle je dois activer les options -D au pr&eacute;processeur.
   Si je l'ajoute dans mes options de projet dans KDevelop, tout va bien, mais quand je distribue 
   mon paquetage, les options -d activ&eacute;e dans KDevelop ne sont pas utilis&eacute;es. Comment faire 
   pour que &ccedil;a marche&nbsp;?
</a></li>
<li><a href="#10"> Y a-t-il une autre possibilit&eacute; pour publier mes propres defines&nbsp;?
</a></li>
<li><a href="#11"> Je d&eacute;veloppe une application qui a besoin de g&eacute;rer les exceptions.
   Comme faire&nbsp;?
</a></li>
<li><a href="#16"> Les solutions ci-dessus sont bien belles, mais je veux cela pour un certain sous-r&eacute;pertoire
   (p.ex. une biblioth&egrave;que statique de mon projet)
   Comment faire&nbsp;?
</a></li>
<li><a href="#23"> J'utilise des ent&ecirc;tes et des biblioth&egrave;ques suppl&eacute;mentaires pour mon projet KDE/QT. Mettre
   -I/usr/include/foo dans les options du compilateur et -L/usr/lib/foo dans les options du lieur
   ne transmet pas les param&egrave;tres dans le tarball.
   Comment faire&nbsp;?
</a></li>
</ul>
</li>
</ul>
<br>

<a name="36"><b> O&ugrave; puis-je me procurer KDevelop&nbsp;? Comment l'installer&nbsp;?</b></a><br>
L'&eacute;quipe de KDevelop ne distribue aucune version binaire de KDevelop (RPMs).
Les RPMs se trouvent toutefois sur le serveur de votre distributeur ou dans les sous-r&eacute;pertoires correspondant
de <a href="ftp://ftp.kde.org/pub">ftp.kde.org</a> ou sur un de ses <a href="http://www.kde.org/ftpmirrors.html">mirroirs</a><br>
Visitez <a href="index.html?filename=<?php echo $k_base_version; ?>/download.html">notre site de t&eacute;l&eacute;chargement </a> pour des informations concernant la fa&ccedil;on de t&eacute;l&eacute;charger et de compiler le code source.<br>
<br>
<br>
<a name="37"><b> Suis-je autoris&eacute; &agrave; d&eacute;velopper des applications commerciales avec KDevelop&nbsp;?</b></a><br>
Tout le monde et toutes les entit&eacute;s sont libres d'utiliser KDevelop. Le code g&eacute;n&eacute;r&eacute; 
peut &ecirc;tre sous toutes les licences que vous voulez. Toutefois, le g&eacute;n&eacute;rateur de projet poss&egrave;de 
les champs n&eacute;cessaires pour ajouter vos propres notes de copyright aux
fichiers g&eacute;n&eacute;r&eacute;s, mais pour simplifier les choses et pour donner un exemple, par d&eacute;faut, c'est la notice de 
la license GPL. Donc, vous pouvez ajouter votre licence l&agrave;.<br>

Quand c'est pour &eacute;diter votre programme, utiliser KDevelop, c'est 
simplement comme utiliser n'importe quel autre &eacute;diteur, c'est un programme sous GPL 
et &ccedil;a n'a pas d'implications sur le but dans lequel vous l'utilisez. 
Donc vous pouvez &eacute;crire des logiciels commerciaux/ferm&eacute;s malgr&eacute; que 
KDevelop soit lui-m&ecirc;me sous GPL.<br>

En ce qui concerne l'utilisation des fonctions KDE ou tout autre chose que du logiciel libre, vous 
devez seulement regarder les notes de licence sur les biblioth&egrave;ques que vous allez utiliser. 
Donc pour le d&eacute;veloppement commercial d'applications KDE/Qt, vous avez uniquement
besoin d'une licence professionnelle de Trolltech. Les biblioth&egrave;ques KDE elles-m&ecirc;mes sont 
sous LGPL, ce qui veut dire que vous pouvez utiliser les appels de fonctions et lier votre programme aux 
biblioth&egrave;ques KDE. Ca vaut pour les biblioth&egrave;ques kdelibs, les biblioth&egrave;ques kdebase
(konqueror et kcontrol etc.) et les biblioth&egrave;ques koffice (pour cr&eacute;er des applications koffice).<br>
Pour plus d'informations, visitez <a href="1.3/doc/programming/index-16.html">
les licences KDevelop</a><br>
<br>
<br>
<a name="137"><b> Suis-je autoris&eacute; &agrave; d&eacute;velopper des plugins commerciaux pour KDevelop&nbsp;?</b></a><br>
KDevelop inclut une biblioth&egrave;que libkdeveloplgpl.so pour permettre le d&eacute;veloppement de plugins commerciaux
Cette biblioth&egrave;que inclut des interfaces et des fonctions utilitaires de KDevelop sous LGPL. 
Si vous avez une licence professionnelle de Trolltech 
vous pouvez lier votre code avec libkdeveloplgpl et le distribuer sous n'importe quelle licence.
<br>
<br>
<br>
<a name="45"><b> J'ai compil&eacute; et install&eacute; KDevelop 3.0 mais tout ce que je vois, ce sont les menus Fichier et Aide</b></a><br>
Juste comme n'importe quelle autre application KDE, vous devez vous assurer que les plugins KDevelop sont reconnus
par KDE. Installez-les dans votre r&eacute;pertoire KDE (configure --prefix=/opt/kde3 par exemple) ou
ajouter le chemin de KDevelop dans la variable d'environnement KDEDIRS et relancez "kbuildsycoca".
Exemple de ligne de commande pour bash (en supposant que KDevelop est install&eacute; dans /home/harry/kdevelop) :<br>
<tt>export KDEDIRS=/home/harry/kdevelop:$KDEDIRS &amp;&amp; kbuildsycoca</tt><br>
<br>
<br>
<a name="38"><b> Comment passer d'un fichier ouvert &agrave; un autre avec le clavier&nbsp;?</b></a><br>
Vous pouvez utiliser ALT-Left et ALT-Right pour aller au fichier ouvert pr&eacute;c&eacute;dent/suivant. Ces touches peuvent &ecirc;tre configur&eacute;es dans la configuration de KDevelop. Il y a aussi une fonction Ouverture Rapide (CTRL-SHIFT-O) pour s&eacute;lectionner et ouvrir un fichier dans un projet et une fonction Aller A (CTRL-/) qui permet de taper les premi&egrave;res lettres du nom d'un fichier ouvert pour s'y rendre.<br>
<br>
<br>
<a name="39"><b>Comment entrer du texte pendant un d&eacute;bogage d'une application console&nbsp;?</b></a><br>
La fen&ecirc;tre GDB vous permet de taper vos propres commandes.<br>
<br>
<br>
<a name="40"><b>Comment activer l'ach&egrave;vement du code pour les biblioth&egrave;ques externes&nbsp;?</b></a><br>
quand vous avez un projet C/C++ ouvert, allez dans le menu <i>Projet->Param&egrave;tres du projet</i>, dans la bo&icirc;te de dialogue <i>Options du projet</i> choisissez <i>l'onglet C++ Specific</i>, ensuite l'onglet <i>Code Completion</i>. Presser le bouton <i>Add Persistant Class Store</i> et compl&eacute;tez l'assistant <i>New Persistant Class Store</i>. Apr&egrave;s avoir compl&eacute;t&eacute; l'assistant, assurez-vous que l'enregistement de la classe cr&eacute;&eacute;e et coch&eacute; dans la liste des classes persistantes enregistr&eacute;es sur l'onglet <i>Code Completion</i>.
<br>
<br>
<a name="3"><b> Le script configure ne trouve pas ma biblioth&egrave;que Qt.</b></a><br>
   Utilisez les options<br>
     --with-qt-includes=chemin_des_includes_qt<br>
   et<br>
     --with-qt-libraries=chemin_de_vos_bibliotheques_qt<br>
   ou initialisez la variable d'environnement QTDIR au chemin o&ugrave; Qt a &eacute;t&eacute; install&eacute;<br>
   ( "export QTDIR=/chemin/de/qt" ).<br>
<br>
<br>
<a name="8"><b> Patcher configure/Makefile/Makefile.in/config.h n'aide pas, apr&egrave;s avoir d&eacute;marr&eacute;
   autoconf/automake/autoheader mes changements sont perdus.
   O&ugrave; patcher ces choses&nbsp;?</b></a><br>
   Il y a une liste de fichiers, o&ugrave; vous pouvez patcher des choses pour les outils automatiques.<br>
   Makefile.am, configure.in.in, configure.in (seulement s'il n'y a pas de configure.in.in)<br>
   [rarement utilis&eacute; : acconfig.h, configure.in.mid, configure.in.bot]<br>
<br>
<br>
<a name="9"><b> Je d&eacute;veloppe une application pour laquelle je dois activer les options -D au pr&eacute;processeur.
   Si je l'ajoute dans mes options de projet dans KDevelop, tout va bien, mais quand je distribue 
   mon paquetage, les options -d activ&eacute;e dans KDevelop ne sont pas utilis&eacute;es. Comment faire 
   pour que &ccedil;a marche&nbsp;?</b></a><br>
   &Eacute;ditez le fichier configure.in(.in) dans votre r&eacute;pertoire racine de votre code source. L&agrave;, vous<br>
   devez entrer apr&egrave;s la macro AC_CHECK_COMPILERS :<br>
     CPPFLAGS="$CPPFLAGS -DMYDEFINE"<br>
   et apr&egrave;s &ccedil;a vous devez recr&eacute;er votre nouveau "configure" en invoquant<br>
   "make -f Makefile.dist" et ensuite relancer le script configure.<br>
<br>
<br>
<a name="10"><b> Y a-t-il une autre possibilit&eacute; pour publier mes propres defines&nbsp;?</b></a><br>
   Une autre fa&ccedil;on d'inclure des DEFINE dans votre projet est de les publier<br>
   avec config.h.<br>
   Pour ce faire vous devez patcher les fichiers suivants :<br>
   Ajouter la ligne suivante au fichier acconfig.h du r&eacute;pertoire racine de votre projet :<br>
     #undef MYDEFINE<br>
<br>
   et ins&eacute;rez dans le fichier configure.in(.in), apr&eacute; l'appel de macro<br>
   AC_CONFIG_HEADER(config.h) :<br>
     AC_DEFINE_UNQUOTED(MYDEFINE)<br>
<br>
   (Ainsi, il sera d&eacute;fini dans config.h apr&egrave;s la mise &agrave; jour de votre cadre de travail avec<br>
     « make -f Makefile.dist; configure [vos options ».<br>
<br>
   Les conditions n&eacute;cessaires pour cette solution sont :<br>
     AC_CONFIG_HEADER(config.h)<br>
   dans configure.in(.in) et dans le code source un<br>
     #ifdef HAVE_CONFIG_H<br>
     #include &#060;config.h&#062;<br>
     #endif<br>
   avant que les autres includes ne se fassent<br>
   (normalement c'est d&eacute;j&agrave; fait dans vous mod&egrave;les de projet).<br>
<br>
   NOTE : Un avantage de cette solution est de rendre MYDEFINE d&eacute;pendant de<br>
         certaines situations (comme cr&eacute;er un option pour configure).<br>
         Ca n&eacute;cessite bien s&ucirc;r l'&eacute;criture d'une fonction macro propre.<br>
<br>
<br>
<a name="11"><b> Je d&eacute;veloppe une application qui a besoin de g&eacute;rer les exceptions.
   Comme faire&nbsp;?</b></a><br>
   &Eacute;ditez le fichier configure.in(.in) dans le r&eacute;pertoire racine de votre projet. L&agrave;, vous<br>
   devez entrer apr&egrave;s la macro AC_CHECK_COMPILERS() :<br>
     CXXFLAGS="$CXXFLAGS $USE_EXCEPTIONS"<br>
       et apr&egrave;s &ccedil;a, vous devez recr&eacute;er votre nouveau « configure » en invoquant<br>
	 « make -f Makefile.dist » dans le r&eacute;pertoire racine du code source et et ensuite red&eacute;marrer<br>
   le script configure.<br>
<br>
<br>
<a name="12"><b> Mon configure.in.in n'a aucun appel AC_CHECK_COMPILERS(). O&ugrave; placer le 
     CXXFLAGS="$CXXFLAGS $USE_EXCEPTIONS"
   mentionn&eacute; plus haut&nbsp;?</b></a><br>
   Les nouvelles versions de configure.in.in ont &eacute;t&eacute; simplifi&eacute;es, vous pouvez maintenant ajouter la ligne<br>
   apr&egrave;s leAM_INIT_AUTOMAKE(&#060;package-name&#062;,&#060;version&#062;).<br>
<br>
<br>
<a name="13"><b> Je d&eacute;veloppe une application qui a besoin d'&ecirc;tre compil&eacute;e avec des infos &agrave; l'ex&eacute;cutionrun-time-type-info dedans.
   Comment faire&nbsp;?</b></a><br>
   &Eacute;ditez le fichier configure.in(.in) dans le r&eacute;pertoire racine de source. L&agrave;, vous<br>
   devez entrer apr&egrave;s la macro AC_CHECK_COMPILERS :<br>
     CXXFLAGS="$CXXFLAGS $USE_RTTI"<br>
       et apr&egrave;s &ccedil;a vous devez recr&eacute;er votre nouveau « configure » en invoquant<br>
	 « make -f Makefile.dist » dans le r&eacute;pertoire racine de code source et red&eacute;marrer le script <br>
   configure.<br>
<br>
<br>
<a name="16"><b> Les solutions ci-dessus sont bien belles, mais je veux cela pour un certain sous-r&eacute;pertoire
   (p.ex. une biblioth&egrave;que statique de mon projet)
   Comment faire&nbsp;?</b></a><br>
   &Eacute;ditez le fichier Makefile.am dans le r&eacute;pertoire source d&eacute;sir&eacute;. L&agrave;, vous<br>
   devez entrer quelque part en-dehors de la partie sp&eacute;cifique &agrave; KDevelop :<br>
     KDE_CXXFLAGS=$(USE_EXCEPTIONS)<br>
   Faites attention, &ccedil;a ne marche que si votre projet utilise am_edit.<br>
   (Ca ne marche que pour les nouveaux acinclude.m4 &amp; am_edit, AFAWK ils doivent &ecirc;tre <br>
    plus r&eacute;cents que 09-12-1999, autrefois, c'&eacute;tait APPEND_CXXFLAGS -<br>
    dans cette version de KDevelop vous trouverez le bon.)<br>
<br>
   Vous devez mettre &agrave; jour votre environnement Makefile comme d&eacute;crit plus haut<br>
   (make -f Makefile.dist; ./configure [options]).<br>
<br>
<br>
<a name="17"><b> Quelle est la diff&eacute;rence entre CPPFLAGS et CXXFLAGS&nbsp;?</b></a><br>
   CPPFLAGS est utilis&eacute; pour des defines (c'est-&agrave;-dire les drapeaux dont vous n'avez besoin que pour la compilation)<br>
   CXXFLAGS est utilis&eacute; pour des switches du compilateur (e.a. -frtti), et aussi<br>
   pour le processus de linkage.<br>
<br>
<br>
<a name="18"><b> J'ai vu plusieurs solutions comme patcher Makefile.am avec
     DEFS+=-DMYDEFINE
   ou
     CXXFLAGS+=-fsigned-char
   ou
     LD_FLAGS+=-L/usr/local/lib
   Pourquoi ne pas les consid&eacute;rer&nbsp;?</b></a><br>
   Il y a un bogue dans automake 1.4, qui n'ajoute pas de drapeau &agrave; ceux<br>
   qui existent d&eacute;j&agrave;. Avec cette commande dans Makefile.am, vous effaceriez les param&egrave;tres existants<br>
   du drapeau en question.<br>
   Si vous voulez ces drapeaux uniquement pour le sous-r&eacute;pertoire du projet, utilisez :<br>
     AM_CPPFLAGS=-DMYDEFINE<br>
   ou<br>
     AM_CXXFLAGS=-fsigned-char<br>
   ou<br>
     AM_LDFLAGS=-L/usr/local/lib<br>
<br>
   Attention, ces drapeaux sont seulement publi&eacute;s par automake version 1.4.<br>
<br>
   Pour param&eacute;trer un de ces drapeaux pour l'ensemble du projet, il faut patcher<br>
   le fichier configure.in(.in) dans le r&eacute;pertoire racine du code source &agrave; la place.<br>
<br>
<br>
<a name="19"><b> Comment &ecirc;tre certain qu'un utilisateur de mon projet le construira avec automake
   version 1.4&nbsp;?</b></a><br>
   Ajoutez la variable AUTOMAKE_OPTIONS dans le fichier Makefile.am du r&eacute;pertoire racine<br>
     du code source avec la cha&icirc;ne « 1.4 ». <br>
   P.Ex .: AUTOMAKE_OPTIONS = foreign 1.4<br>
<br>
<br>
<a name="59"><b> J'ai ajout&eacute; un sous-projet existant &agrave; mon projet et &ccedil;a ne veut plus se construire.</b></a><br>
  &Ccedil;a peut arriver si builddir != topsrcdir. Dans ce cas, ex&eacute;cutez make distclean avant<br>
d'ajouter le sous-projet.<br>
<br>
<br>
<a name="20"><b> AM_CXXFLAGS (dans un Makefile.am) peut-il &ecirc;tre utilis&eacute; comme drapeau comme -frtti ou
   -fexceptions&nbsp;?</b></a><br>
   Non, dans ces cas-l&agrave; il y a un probl&egrave;me d'ordre. La variable standard CXXFLAGS<br>
   publi&eacute;e dans acinclude.m4.in contient d&eacute;j&agrave; un -fno-rtti (-fno_exceptions).<br>
   Si vous l'avez appliqu&eacute;e &agrave; AM_CXXFLAGS la commande du compilateur ins&egrave; alors<br>
   ces drapeaux avant les CXXFLAGS, p.ex. ici pour -frtti :<br>
   gpp ... -frtti ... -fno-exceptions -fno-rtti ......<br>
   Donc, le dernier drapeau (dans ce cas-ci, toujours -fno-rtti) sera utilis&eacute;.<br>
   KDE_CXXFLAGS par contre sera ins&eacute;r&eacute; apr&egrave;s le CXXFLAGS standard, donc &ccedil;a<br>
   devrait ressembler &agrave; &ccedil;a :<br>
   gpp ..... -fno-exceptions -fno-rtti ...... -frtti...<br>
   et voil&agrave; &ccedil;a marche.<br>
<br>
   Attention : KDE_CXXFLAGS sont seulement publi&eacute;s par des projets qui utilisent am_edit<br>
   et acinclude.m4.<br>
<br>
<br>
<a name="21"><b> Pourquoi patcher configure.in(.in) avec CXXFLAGS="$USE_EXCEPTIONS $CXXFLAGS" ne fonctionne pas&nbsp;?</b></a><br>
  Regardez le r&eacute;ponse &agrave; la question « AM_CXXFLAGS (dans un Makefile.am) peut-il &ecirc;tre utilis&eacute; comme drapeau comme -frtti ou
  -fexceptions&nbsp;? » ;-)<br>
<br>
<br>
<a name="22"><b> J'utilise CXXFLAGS="$USE_EXCEPTIONS" dans configure.in(.in) et &ccedil;a marche bien,
   pourquoi utiliserais-je votre solution&nbsp;?</b></a><br>
   Si vous utilisiez votre version avant AC_CHECK_COMPILERS(), un appel comme<br>
     CXXFLAGS="-pedantic" ./configure<br>
   ne fonctionnerait pas correctement.<br>
   Si vous l'utilisiez apr&egrave;s AC_CHECK_COMPILERS(), le CXXFLAGS affect&eacute; dans<br>
   AC_CHECK_COMPILERS() serait effac&eacute;.<br>
     (Par exemple dans un appel « configure --enable-debug », le CXXFLAGS serait <br>
    chang&eacute; pour ins&eacute;rer aussi les informations de debogage &agrave; votre code.)<br>
   Donc, veuillez utiliser CXXFLAGS="$CXXFLAGS $USE_EXCEPTIONS" &agrave; la place.<br>
<br>
<br>
<a name="23"><b> J'utilise des ent&ecirc;tes et des biblioth&egrave;ques suppl&eacute;mentaires pour mon projet KDE/QT. Mettre<br>
   -I/usr/include/foo dans les options du compilateur et -L/usr/lib/foo dans les options du lieur<br>
   ne transmet pas les param&egrave;tres dans le tarball.<br>
   Comment faire&nbsp;?</b></a><br>
   C'est la partie la plus difficile &agrave; faire convenablement.<br>
   Une solution facile mais incorrecte serait d'ajouter dans le fichier configure.in(.in) :<br>
<br>
   all_includes="$all_includes -I/usr/include/foo"<br>
   all_libraries="$all_libraries -L/usr/lib/foo"<br>
<br>
   [le meilleur endroit pour &ccedil;a, c'est avant les lignes :<br>
    AC_ARG_PROGRAM<br>
    AC_OUTPUT( ..... )<br>
    &agrave; la fin du fichier.]<br>
<br>
   Les probl&egrave;mes ici :<br>
   - Qui peut garantir que les includes seront toujours dans<br>
     /usr/include/foo... peut-&ecirc;tre que sur certains syst&egrave;mes, &ccedil;a pourrait &ecirc;tre dans /usr/local/foo/include<br>
     (et peut-&ecirc;tre que les biblioth&egrave;ques seraient dans /usr/local/foo/lib)&nbsp;?<br>
   - Peut-&ecirc;tre que je n'ai pas install&eacute; les choses foo, alors la construction &eacute;chouerait, mais ce serait<br>
     mieux si configure avait d&eacute;j&agrave; &eacute;chou&eacute; avec un message plus utile.<br>
<br>
   Donc, pour le faire convenablement, vous devez ajouter une macro &agrave;<br>
     configure.in(.in), qui fait certains tests et cherche un « foo » install&eacute;.<br>
<br>
   Si vous voulez le faire comme &ccedil;a, nous vous donnons un truc... essayez de<br>
   comprendre le fichier acinclude.m4.in ou cr&eacute;ez un projet  KDE-normal-ogl,<br>
   o&ugrave; vous trouverez un fichier qgl.m4, qui sera concat&eacute;n&eacute; &agrave;<br>
   acinclude.m4 (voyez "Makefile.dist"). Ca vous montre un exemple &eacute;tendu<br>
   pour chercher QT-OpenGL-Lib, vous devez le r&eacute;&eacute;crire pour votre probl&egrave;me.<br>
<br>
   Peut-&ecirc;tre que vous avez de la chance et que vous avez d&eacute;j&agrave; une solution &agrave; votre probl&egrave;me dans<br>
   acinclude.m4.in ainsi vous pouvez utiliser une fonction d&eacute;j&agrave; cr&eacute;&eacute;e.<br>
<br>
<br>
  <a name="25"><b> Dans les questions pr&eacute;c&eacute;dentes, je vois toujours « configure.in(.in) ». J'ai les deux fichiers dans mon <br>
   projet. Quel fichier doit &ecirc;tre patch&eacute;&nbsp;?</b></a><br>
   S'il y a un fichier configure.in.in dans le r&eacute;pertoire racine de votre projet, patchez-le.<br>
   Si vous n'avez pas trouv&eacute; un configure.in.in, patchez configure.in.<br>
<br>
<br>
<a name="28"><b> Y a-t-il des HOWTO disponibles sur la fa&ccedil;on de travailler avec des bo&icirc;tes de dialogues faites avec QT designer&nbsp;?</b></a><br>
  Oui, il y a un bon tutoriel sur <a href="http://women.kde.org/articles/tutorials/kdevelop3/index.html">http://women.kde.org/articles/tutorials/kdevelop3/index.html</a><br>
<br>
<br>
<a name="29"><b> J'ai install&eacute; htdig mais htsearch est maintenant disponible&nbsp;?</b></a><br>
   Sur les syst&egrave;mes RedHat p.ex. l'ex&eacute;cutable htsearch est plac&eacute; dans le r&eacute;p. /cgi-bin ou apache.<br>
   Vous pouvez cr&eacute;er des symlinks dans /usr/bin ou simplement ajouter ce chemin ro ~/.bashrc<br>
<br>
<br>
<a name="30"><b> J'ai htdig, htmerge et htsearch disponibles mais j'ai un message d'erreur qui signale que le fichier config
   de htdig ne peut &ecirc;tre trouv&eacute; ou est invalide&nbsp;?</b></a><br>
   Lisez README.htdig dans le r&eacute;pertoire source et cr&eacute;ez un fichier htdig.conf. Ensuite, copiez-le<br>
   dans $KDEDIR/share/apps/kdevelop/tools. Maintenant cr&eacute;ez votre index de recherche avec le menu de configuration de kdevelop.<br>
<br>
<br>

<a name="100"><b>Comment cr&eacute;er un simple projet avec seulement un Makefile (aussi connu sous le nom <em>Projet Personnalis&eacute;</em>)&nbsp;?</b></a><br>
Cr&eacute;ez un projet personnalis&eacute;. Il n'y a pas de mani&egrave;re directe de cr&eacute;er un projet personnalis&eacute; (p.ex. un projet qui fait ses propres makefiles). Utilisez Project->Import Existing Project &agrave; la place. N'oubliez pas d'affecter le type de projet appropri&eacute;, marqu&eacute; par un € additionnel (Custom Makefiles), dans la bo&icirc;te de dialogue. 
Utilisez les options du projet t&ocirc;t. A chaque fois que vous commencez un nouveau projet, n'oubliez pas de r&eacute;gler le Project->Project Options... &agrave; vos besoins.
<br>
<br>

<a name="101"><b>Pourquoi je ne vois pas les messages d'erreur de compilation&nbsp;?</b></a><br>
Si pendant les compilations, vous remarquez qu'une information importante est manquante dans la fen&ecirc;tre de vue des messages de sortie, &ccedil;a peut &ecirc;tre que le niveau de d&eacute;tail des messages est r&eacute;gl&eacute; trop bas. Faites un clic-droit dans la fen&ecirc;tre et s&eacute;lectionnez un aute niveau de d&eacute;tail dans le menu contextuel.
<br>
<br>

<a name="102"><b>Comment cr&eacute;er des nouveaux fichiers dans un projet&nbsp;?</b></a><br>
S&eacute;lectionnez le sous-projet dans la moiti&eacute; sup&eacute;rieure de Automake Manager, ensuite clic-droit dans la partie inf&eacute;rieure sur le titre des groupes pour lesquels vous voulez ajouter les fichier et s&eacute;lectionnez Cr&eacute;er un nouveau fichier.... 
<br>
<br>

<a name="103"><b>Comment ajouter des fichiers existants &agrave; un projet&nbsp;?</b></a><br>
S&eacute;lectionnez le sous-projet dans la moiti&eacute; sup&eacute;rieure de Automake Manager, ensuite clic-droit dans la partie inf&eacute;rieure sur le titre des groupes pour lesquels vous voulez ajouter les fichier et s&eacute;lectionnez Ajouter des fichiers existants.... 
<br>
<br>

<a name="104"><b>Comment supprimer un fichier d'un projet&nbsp;?</b></a><br>
S&eacute;lectionnez le sous-projet dans la moiti&eacute; sup&eacute;rieure de Automake Manager, ensuite clic-droit dans la partie inf&eacute;rieure sur le titre des groupes pour lesquels vous voulez supprimer les fichier et s&eacute;lectionnez Supprimer.... 
<br>
<br>

<a name="105"><b>Que faire si un projet ne veut plus se construire apr&egrave;s avoir chang&eacute; de/vers la cible par d&eacute;faut&nbsp;?</b></a><br>
Il y a un probl&egrave;me avec la machinerie automake/autoconf. 
Si Project->Build Configuration vous permet de choisir parmi trois r&eacute;pertoires de construction : par defaut, optimis&eacute;, et debug, &ccedil;a veut dire que vous choisissez l'un ou l'autre des cibles « par d&eacute;faut » ou debug/optimis&eacute;. 
<dl>
  <dd>Une fois que vous avez configur&eacute; votre projet avec par « d&eacute;faut », il ne se construira plus avec debug ou optimis&eacute;.</dd> 
  <dd>Une fois que vous avez configur&eacute; votre projet avec debug ou optimis&eacute;, il ne se construira plus avec « par d&eacute;faut ».</dd> 
</dl>
<br>
<br>

  <a name="106"><b>Erreur « Mauvaise version autoconf» etc.</b></a><br>
Il y a quelques messages d'erreur concernant des trop vieilles versions d'autoconf etc. emp&ecirc;chant configure de marcher convenablement. Ex&eacute;cutez autoreconf dans le r&eacute;pertoire o&ugrave; se trouvent les fichiers configure.in en question. Cette commande essayera de mettre &agrave; jour l'information dans les fichiers du syst&egrave;me de construction GNU. Voyez man autoreconf pour plus d'informations. 
<br>
<br>

<?php module_tail(); ?>