<?php module_head("KDevelop 3.1 Ver&ouml;ffentlichungsmitteilung"); ?>

<P>Datumszeile 19. AUGUST 2004</P>
<P>F&uuml;r sofortige Ver&ouml;ffentlichung</P>
<H3 ALIGN="center">KDevelop 3.1 Ver&ouml;ffentlichungsmitteilung</H3>
<P><STRONG>Das KDevelop-Team stellt Major Feature Release der preisgekr&ouml;nten IDE vor</STRONG></P>
<P>19. August 2004 (The INTERNET).
Das KDevelop Team ist stolz KDevelop 3.1, die zweite Hauptver&ouml;ffentlichung der preisgekr&ouml;nten Integrierten Entwicklungsumgebung (IDE - Integrated Development Environment) vorstellen zu können.
</P>
<P>
"KDevelop ist der Schl&uuml;ssel um v&ouml;llig neue Produktivit&auml;tsebenen zu erreichen. Es ist eine IDE die zu jeder Aufgabe, von Systemprogrammierung bis hin zu GUI RAD, passt. Durch die Integration aller g&auml;ngigen UNIX Entwicklungswerkzeuge, die Unterst&uuml;tzung von Teamentwicklung mit verschiedenen Versionskontrollsystemen und durch die umfangreiche Liste an unterst&uuml;tzten Sprachen ist KDevelop eine ausgezeichnete Wahl f&uuml;r UNIX Entwickler. Die Verf&uuml;gbarkeit auf verschiedenen Plattformen wie z.B. Mac OS X und Windows/Cygwin macht KDevelop zu einem gro&szlig;artigen Tool f&uuml;r Multiplattformentwicklung. Die Unterst&uuml;tzung f&uuml;r g&auml;ngige Entwicklungswerkzeuge erlaubt die Entwicklung von Anwendungen f&uuml;r eine gro&szlig;e Anzahl an Plattformen inklusive embedded Plattformen. " hebt Alexander Dymo, Mitverantwortlicher im Projekt, hervor.
</P>
<P>
"Mit dem neuen sprachunabh&auml;ngigen, plug-in basierten Kern und der Unterst&uuml;tzung vieler bekannter Entwicklungswerkzeuge ist KDevelop bereits die de-facto Standard IDE auf Linux/Unix Desktops." f&uuml;gte Harald Fernengel, ein langj&auml;hriges Projektmitglied, hinzu.
</P>
<P>
"Das KDevelop Team hat mit dieser Ver&ouml;ffentlichung exzellente Arbeit geleistet. &Uuml;ber 20 Entwickler haben &uuml;ber einen Zeitraum von mehr als sechs Monaten an dem Projekt gearbeitet. Man merkt sofort, dass wert auf eine sorgf&auml;ltige Dokumentation und die Benutzerschnittstelle gelegt wurde. Diese Version ist m&auml;chtig und doch einfach in der Handhabung." bemerkte Amilcar do Carmo Lucas, Release Co-Koordinator.
</P>

<H4>Wichtigste Verbesserungen</H4>
<P>
KDevelop unterst&uuml;tzt nun &uuml;ber 15 Programmiersprachen und zahlreiche Versionskontrollsysteme, Debugger, Dokumentatiosformate und Build-Tools. Jeder Editor, der das KTextEditor-Interface unterst&uuml;tzt, einschlie&szlig;lich kate, QEditor und kvim, kann als integrierter KDevelop Editor benutzt werden. Erstellungswerkzeuge wie automake, qmake oder ant werden nativ unterst&uuml;tzt, das bedeutet, dass KDevelop keine eigenen Objektverzeichnisse bereith&auml;lt. &Auml;nderungen in den nativen Projektdateien spiegeln sich direkt in KDevelop wieder und umgekehrt.
</P><P>
Die C++ Unterst&uuml;tzung bietet eine Klassenansicht, die alle Symbole entweder flach oder hierarchisch nach Namensr&auml;umen anzeigt und erlaubt damit eine einfache Codenavigation. Ein Hintergrund-Parser aktualisiert die Symbole st&auml;ndig und zeigt au&szlig;erdem syntaktische Fehler im Quellcode. Die Code-Komplettierung kann sogar mit Qt Signalen und Slots umgehen.
</P><P>
Mit der neuen offenen Architektur kann KDevelop in jeder Hinsicht angepasst werden. Die Benutzerschnittstelle kann w&auml;hrend der Arbeit vom klassichen MDI-Modus zum modernen IDEAl-Modus mit seinem Code-zentrierten Ansatz und on-demand Werkzeugansichten umgeschaltet werden.
</P><P>
KDevelop bietet umfangreiche Unterst&uuml;tzung um im Quellcode zu navigieren. Auf Symbole und Dateinamen kann zugegriffen werden, indem man nur einen Teil des Namens eingibt, k&uuml;rzlich ver&auml;nderte Dateien k&ouml;nnen mit nur einem einzigen Tastendruck erreicht werden.
</P><P>
KDevelop bietet Werkzeuge zum Erstellen von Dokumentationen, Debuggen des Codes, Speicherpr&uuml;fung, Code&uuml;berarbeitung (refactoring), Lesezeichenmanagement und dutzende weitere Tools um die Entwicklung leicht und bequem zu machen. Es ist in mehr als 16 Sprachen übersetzt.
</P>

<H4>Installieren der KDevelop 3.1 Bin&auml;rpakete</H4>
<P>
Bin&auml;re Pakete f&uuml;r alle gro&szlig;en Linux Distributionem k&ouml;nnen auf <a href="http://www.kdevelop.org/index.html?filename=3.1/download.html">http://www.kdevelop.org/index.html?filename=3.1/download.html</a> gefunden werden.
</P><P>
Eine Alpha-Version eines nativen Bin&auml;rpaketes f&uuml;r Mac OS X kann auf <a href="http://kde.opendarwin.org">http://kde.opendarwin.org</a> gefunden werden.
</P><P>
Das kde-cygwin Projekt stellt KDevelop auf <a href="http://kde-cygwin.sourceforge.net/kde3/installation.php">http://kde-cygwin.sourceforge.net/kde3/installation.php</a> zur Verf&uuml;gung.
</P><P>
Bitte beachten Sie, dass das KDevelop Team keine bin&auml;ren Versionen ver&ouml;ffentlicht. Alle Pakete werden von Drittanbietern zur Verf&uuml;gung gestellt. 
</P>

<H4>KDevelop 3.1 kompilieren</H4>
<P>
Der komplette Quellcode von KDevelop 3.1 kann frei von <a href="http://www.kdevelop.org/">http://www.kdevelop.org</a> heruntergeladen werden. Detaillierte Informationen &uuml;ber das Kompilieren entnehemen Sie bitte <a href="http://www.kdevelop.org/index.html?filename=3.1/branches_compiling.html">http://www.kdevelop.org/index.html?filename=3.1/branches_compiling.html</a>.
</P>


<H4>&Uuml;ber KDevelop</H4>
<P>
KDevelop ist ein unabh&auml;ngiges Projekt um eine m&auml;chtige und einfach zu benutzende integrierte Entwicklungsumgebung (IDE - Integrated Development Environment) zu schaffen. Als Teil des KDE Projektes teilt sich KDevelop das selbe offene Entwicklungsmodell und den selben modularen Rahmen. Das Ergebnis ist eine hochgradig anpassbare, sprachunabh&auml;ngige IDE unter der GPL Lizenz, die von dutzenden Entwicklern und Experten weltweit vorangebracht wird. Mehr &uuml;ber KDevelop k&ouml;nnen Sie auf <a href="http://www.kdevelop.org">http://www.kdevelop.org</a> finden.
</P>


<H4>&Uuml;ber KDE</H4>

<P>


KDE ist ein unabh&auml;ngiges Projekt von hunderten Entwicklern, &Uuml;bersetzern, Designern und anderen Experten weltweit, die &uuml;ber das Internet zusammenarbeiten um eine frei verf&uuml;gbare, hochentwickelte und stabile Arbeitsoberfl&auml;che und Office Umgebung zu erschaffen, die flexibel, komponentenbasiert, mit einer transparenten Netzwerkarchitektur ausgestattet und eine herausragende Entwicklungsplattform ist. KDE bietet eine stabile, ausgereifte Arbeitsoberfl&auml;che, ein komponentenbasiertes Office Paket (KOffice), eine gro&szlig;e Anzahl an Netzwerk- und Systemverwaltungswerkzeugen und Hilfsprogrammen, sowie mit KDevelop eine effiziente Entwicklungsumgebung. KDE ist der lebende Beweis, dass basar&auml;hnliche Open Source Entwicklung hochqualitative Anwendungen produzieren kann, die den Vergleich mit komplexen kommerziellen Programmen nicht scheuen brauchen.
</P>
<BR><BR>
<HR NOSHADE SIZE=1 WIDTH="90%" ALIGN="center">
<FONT SIZE=2>
<EM>Pressemeldung:</EM> Geschrieben von Harald Fernengel mit der unbezahlbaren Unterstützung unzähliger Freiwilliger des KDE Projekts.<BR>
<EM>Release Koordinatoren:</EM> Danke an Alexander Dymo und Amilcar do Carmo Lucas für ihre Dienste als Release Koordinatoren.<BR>
<EM>Markenzeichen:</EM>
KDE und K Desktop Environment sind Markenzeichen von KDE e.V. Linux ist ein eingetragenes Markenzeichen von Linus Torvalds. UNIX ist ein eingetragenes Warenzeichen der "The Open Group" in den Vereinigten Staaten und anderen Ländern. Alle anderen in diesem Dokument verwendeten Warenzeichen und Urheberrechte sind Eigentum des jeweiligen Besitzers. 
<BR>
</FONT>
<HR NOSHADE SIZE=1 WIDTH="90%" ALIGN="center">

<H4>Pressekontakte:</H4>

Weltweit (deutsch und englisch): Harald Fernengel, <a href="mailto:harry at kdevelop.org">harry at kdevelop.org</a>, (47) 92043220<BR>
Weltweit (ukrainisch, russisch und englisch): Alexander Dymo, <a href="mailto:cloudtemple at mksat.net">cloudtemple at mksat.net</a>, (38) 0675122801<BR>
Weltweit (schwedisch und englisch): Jens Dagerbo, <a href="mailto:jens.dagerbo at swipnet.se">jens.dagerbo at swipnet.se</a><BR>
Weltweit (portugiesisch): Amilcar do Carmo Lucas, <a href="mailto:amilcar at ida.ing.tu-bs.de">amilcar at ida.ing.tu-bs.de</a><BR>

<?php module_tail(); ?>
