<?php module_head("R&eacute;compenses pour KDevelop");?>

<ul>

<li>
<H4>Prix 2004 des membres de LinuxQuestions.org</H4>
Les membres de
<a href="http://www.linuxquestions.org/">
LinuxQuestions.org</a> ont choisi KDevelop comme
<a href="http://www.linuxquestions.org/questions/t272124.html">
interface de d&eacute;veloppement pour l'ann&eacute;e 2004</a>.
<br><br>
<img src="graphics/awards/lq_2004mca.png" alt="Prix 2004 des membres de LinuxQuestions.org  KDevelop - Interface de d&eacute;veloppement de l'ann&eacute;e 2004">
<br><br>
</li>

<li>
<H4><a href="http://www.linuxworldexpo.com">Conf&eacute;rence et exposition Linuxworld New York 2004</a>:
Premi&egrave;re place dans la cat&eacute;gorie "Meilleurs outils de d&eacute;veloppement"</H4>
Pr&eacute;sent&eacute; avec l'association UniForum, un ensemble de juges et d'experts du secteur industriel
ont r&eacute;compens&eacute; les produits et services innovateurs ainsi que les solutions libres en informatique
qui ont &eacute;t&eacute; pr&eacute;sent&eacute;es par les participants. C'est un tr&egrave;s grand honneur de recevoir un prix d'excellence. Nous remercions sinc&egrave;rement la communaut&eacute; Open Source pour son support continu.
<br><br>
<img src="graphics/awards/lwce_award_logo_2004.gif" alt="Logo of LinuxWord Conference &amp; Expo Award" width="25%">
<br><br>
</li>

<li>
<H4>Prix Linux New Media 2003&nbsp;: premi&egrave;re place pour "Syst&egrave;me de d&eacute;veloppement IDE"</H4>
Un jury d'auteurs, d'industriels et de membres de la communaut&eacute; Open Source aussi bien que les &eacute;diteurs du journal Linux Magazine ont vot&eacute; pour KDevelop comme &eacute;tant le meilleur dans la cat&eacute;gorie "Syst&egrave;me de d&eacute;veloppement IDE". KDevelop a gagn&eacute; avec 29.4% des votes, les seconde et trois&egrave;me places sont revenues &agrave; Eclipse et Anjuta. Veuillez trouver l'article complet
<a href="http://www.linux-magazine.com/issue/38/Linux_New_Media_Awards.pdf">en anglais</a> ou
<a href="http://www.linux-magazin.de/Artikel/ausgabe/2003/12/award/award.html">en allemand</a>.
<br><br>
<img src="graphics/awards/lnm_award_logo_2003.jpg" alt="Logo of Linux New Media Award">
<br><br>
</li>

 <li>
<H4>Prix Linux New Media 2002&nbsp;: Second rang pour le "Meilleur logiciel de développement"</H4>
Dans chacune des 10 catégories, les première, seconde et troisi&egrave;me places ont été
déterminées par le vote d'un jury de 35 personnes. Le jury était composé de professionnels Linux
incluant les équipes éditoriales et les contributeurs réguliers à Linux Magazine, Linux-Magazin, LinuxUser et
Linux-Community.de. D'autres personnes du jury étaient des membres importants de la scène Open
Source et de l'industrie Linux tels que le coordinateur pour le noyau Linux Alan Cox,
le Président de Linux International Jon "maddog" Hall,
le président de la Fondation Pour les Logiciels Libres en Europe Georg Greve, l'évangéliste Linux de IBM
Tom Schwaller et Kalle Dalheimer
<br><br>
<img SRC="graphics/awards/lnm_award_logo.jpg" ALT="Logo Of Linux New Media Award">
<br><br>
</li>

<li>
<H4>R&eacute;compense pour le meilleur outil de d&eacute;veloppement Open Choice 2002</H4>
Timothy R. Butler (&Eacute;diteur en chef, Open for Business) a &eacute;crit&nbsp;:<br>
"...Je suis heureux d'annoncer que Open for Business a choisi KDevelop 2.1.2 pour
la r&eacute;compense pour le meilleur outil de d&eacute;veloppement Open Choice 2002. L'article mentionnant le prix pour KDevelop de OfB.biz Open Choice 2002
est situ&eacute; &agrave; <a href="http://www.ofb.biz/modules.php?name=News&amp;file=article&amp;sid=146">http://www.ofb.biz/modules.php?name=News&amp;file=article&amp;sid=146</a>...<br>
...Open for Business est localis&eacute; aux Etats Unis mais c'est exclusivement une publication en-ligne..."
<img SRC="graphics/awards/open-choice_awardlogo.jpg" ALT="Logo Of Open Choice Award">
<br><br>
</li>

<li>
<H4>Prix Linux Format 2001</H4>
Richard Smedley (&Eacute;diteur de Production pour Linux Format) dit
&nbsp:<br> "Linux Format est le plus grand (le plus ancient, ayant les
meilleures ventes, etc...  [;-)] magazine GNU/Linux du Royaume-Uni, avec
des ventes considérables en Scandinavie, au Bénélux, en Australie et
aux USA. Au début de l'année, les lecteurs ont voté quelles nominations mettre
dans chaque catégorie sur le site (<a
href="http://www.linuxformat.co.uk">www.linuxformat.co.uk</a>), puis lorsque les
nominations furent décidées, elles ont été annoncées dans le magazine et sur le
site et les votes débutèrent.

L'histoire n'est pas en première page du site mais bientôt l'article du
magazine apparaîtra dans nos archives en ligne...
Je l'enverrai (le prix) à Mirko Boehm à KDE e.V"<br><br>
<img SRC="graphics/awards/linux-format_awardlogo.jpg" ALT="Logo Of Linux Format Award">
<br><br>
</li>

<li>
<H4>Prix Linux New Media 2001 pour le "Meilleur outil de
développement Linux"</H4>
Ralf Nolden a accepté le prix du Directeur Général de  <a
href="http://www.linux-events.de">Linux New Media</a> à la foire Systems à
Munich en Allemagne. Nous avons placé l'argent (1500 Euro) sur le
<a href="http://www.kde.org/support/">compte de l'organisation KDE
</a>.<br><br> <br><br> </li>

</ul>

<?php module_tail(); ?>
