<?php module_head("Comment rejoindre l'&eacute;quipe KDevelop"); ?>
Il n'y a aucune raison de r&eacute;criminer contre les bogues ou contre des caract&eacute;ristiques manquantes. KDevelop peut seulement &ecirc;tre bon si vous contribuez &agrave; l'am&eacute;liorer.<br>
Aussi <b>nous avons besoin de vous&nbsp;!</b> Notre &eacute;quipe recherche toujours de bons programmeurs Qt ou KDE.<br>
<br><br>
Que faire pour devenir membre de l'&eacute;quipe&nbsp;?
<ul>
<li>avoir une id&eacute;e de ce qui est ennuyant, mauvais ou manquant dans KDevelop et avoir la volont&eacute; de l'impl&eacute;menter.</li>
<li><a href="index.html?filename=HEAD/branches_compiling.html">obtenir les sources de kdevelop SVN</a></li>
<li>tout compiler vous-m&ecirc;me comme version debogu&eacute;e pour &ecirc;tre capable de tracer les crashes.</li>
<li>&eacute;tudier le code source de kdevelop, d&eacute;boguer KDevelop lui-m&ecirc;me et &eacute;tudier les backtraces pour en comprendre les m&eacute;canismes; reconna&icirc;tre les classes C++ importantes et non-importantes du projet.</li>
<li>patcher les sources du projet</li>
<li>cr&eacute;er un fichier patch (*.diff) contre la version cvs actuelle</li>
<li>l'envoyer &agrave; <a href="index.html?filename=mailinglist.html">kdevelop-devel at kdevelop.org</a></li>
<li>attendre la r&eacute;ponse, des cris et de l'amour</li>
<li>&eacute;crire d'autres patches aussi cools et enquiquiner la liste de diffusion avec eux &agrave; nouveau </li>
<li>conna&icirc;tre <a href="http://developer.kde.org/policies/commitpolicy.html">les r&egrave;gles de commit au SVN </a></li>
<li>obtenir votre propre compte kdevelop-cvs, et peut-&ecirc;tre votre adresse votre nom at kdevelop.org pour pouvoir committer votre code vous-m&ecirc;me</li>
<li>...</li>
<li>* ann&eacute;es pour devenir un membre confirm&eacute; de l'&eacute;quipe* (&agrave; regarder les gens, les patches et les versions venir et s'en aller)</li>
<li>...</li>
<li>devenir un gourou KDevelop</li>
<li>...</li>
<li>devenir riche &agrave; cause de cadeaux de milliers de fans et de trucs re&ccedil;us... ;-)</li>
<li>...</li>
<li>sortie de KDevelop-20.5.134 </li>
<li>...</li>
<li>La Fin.</li>
</ul>
<?php module_tail(); ?>
