<?php module_head("Nouvelles en 2001");?>
<b>20 Décembre 2001</b> - <b>KDevelop 2.1 Beta 1</b> est publié avec <A HREF="http://www.kde.org/announcements/announce-3.0beta1.php">KDE 3.0 Beta 1</A>. <br>Veuillez aussi trouver plus de détails sur la nouvelle fonctionalité qui supporte la compilation sur plusieurs plates-formes <a href="http://dot.kde.org/1007435836">ici</a>.<br><br>
<b>23 Novembre 2001</b> - La version de correction de bogues <b>KDevelop 2.0.2</b> est sortie et fait partie de <A HREF="http://www.kde.org/announcements/announce-2.2.2.php"> la sortie de KDE 2.2.2</A>. <br><br>
<b>20 Novembre 2001</b> - Il existe aussi une version en anglais de la récompense gagnée ci-dessous. Lisez-la <a href="http://dot.kde.org/1005265771">ici</a>.<br><br>
<b>22 Octobre 2001</b> - Jeudi dernier, KDevelop a gagné le <a href="http://home.in.tum.de/meyerc/Systems/pict0030.jpg">Linux New Media Award 2001 pour le "Meilleur outil de développement Linux"</a>. :-) <a href="http://www.kde.org/people/images/ralf2.jpg">Ralf Nolden</a> a accepté le prix remis par le <a href="http://www.linux-events.de">Linux New Media AG</a> à la <a href="http://home.in.tum.de/meyerc/Systems">Systems fair à Munich, Allemagne</a>. Nous avons donné l'argent (1500 Euros) au <a href="http://www.kde.org/helping.html"> compte de l'organisation KDE</a>.<br><br>
<b>11 Octobre 2001</b> - HarryF et F@lk ont porté KDevelop 2.0 vers KDE3 alpha 1. La branche CVS KDE_2_2_BRANCH <a href="index.html?filename=2.1/kdevelop.html#Downloads">compile</a> et se lance avec KDE3alpha1/Qt3beta6 de même qu'avec KDE2/Qt2.<br><br>
<b>19 Septembre 2001</b> - La version de correction de bogues <b>KDevelop 2.0.1</b> <a href="index.html?filename=2.1/announce-kdevelop-2.0.html">est sortie</a> et fait part de <A HREF="http://www.kde.org/announcements/announce-2.2.1.php">la sortie de KDE 2.2.1</A>. <br><br>
<b>15 Août 2001</b> - <b>KDevelop 2.0</b> <a href="index.html?filename=2.1/announce-kdevelop-2.0.html"> est mis à disposition</a> en même temps que <A HREF="http://www.kde.org/announcements/announce-2.2.php">la sortie de KDE 2.2</A>. Vous pouvez utiliser n'importe quel <A HREF="http://www.kde.org/mirrors/">miroir KDE </A> pour le télécharger avec KDE 2.2<br>. Un <A HREF="index.html?filename=2.1/changes.html">journal plus détaillé</A> est aussi disponible.<br><br>
<b>5-8 Juillet 2001</b> - <a href="http://www.linuxtag.org">LinuxTag</a>, l'évènement Open
Source numéro 1 en Europe. Vous pouvez trouver <a href="index.html?filename=events/linuxtag2001.html">ici</a> des
photos sur cette expo.<br>
<br>
<b>6 Juillet 2001</b> - <b>KDevelop 2.0 Beta1</b> est sorti et fait part de la <A HREF="http://www.kde.org/announcements/announce-2.2-beta1.php">version KDE 2.2 Beta1</A>.<br><br>
<b>9 Juin 2001</b> - Le dot a publié une mise à jour sur le
<a href="http://dot.kde.org/992083107/">statut de la branche HEAD</a> qui inclut plusieurs captures d'écran.<br><br>
<b>9 Mai 2001 </b> - Falk a écrit un petit <a href="index.html?filename=2.1/features.html">article</a> qui montre et explique la nouvelle interface utilisateur pour KDevelop2.0. Profitez-en&nbsp;!<br><br>
<b>23 Avril 2001</b> - Falk Brettschneider a écrit <a href="http://lists.kde.org/?l=kdevelop-devel&amp;m=98800682211334&amp;w=2">une liste</a> TODO pour KDevelop2.0. Si vous voulez aider, veuillez regarder les sources et souscrivez à la liste de diffusion kdevelop-devel.
 Nous apprécierions énormément votre aide.
<br><br>
<b>17 Avril 2001</b> - <a href="http://www.radiotux.de">RadioTux</a> - La
LinuxInternetRadio allemande - présente dans son second show une interview de Ralf
Nolden sur KDevelop.<br><br>
<b>10 Avril 2001</b> - KDE.org publie une <a href="http://www.kde.org/people/ralf.html">interview</a> avec Ralf Nolden, l'un des d&eacute;veloppeurs principaux de KDevelop.<br><br>
<b>4 Avril 2001</b> - La branche HEAD de KDevelop contient maintenant les sources de <a href="http://apps.kde.com/na/2/info/id/1068">gideon</a>. Pour plus d'information, veuillez lire l'<a href="http://dot.kde.org/986594487/">article</a> sur dot.kde.org.<br><br>


<b>13 Mars 2001</b> - <A HREF="mailto:nolden at kde.org">Ralf Nolden</A> sera &agrave; nouveau disponible pour la premi&egrave;re date du tour du show de KDevelop avec KDE 2.1 au CeBit, Hannover les 24 et 25 Mars. La premi&egrave;re pr&eacute;sentation aura lieu le
24 &agrave; 11h45 du matin au stand SuSE, Hall 3 Stand E45, la seconde le m&ecirc;me jour au stand Rheinland-Pfalz dans le Hall 18, stand B 43 &agrave; 3h00 de l'apr&egrave;s-midi apr&egrave;s la pr&eacute;sentation de Martin Konold sur KDE 2.1 &agrave; 14h30.<br><br>
<b>8 Mars 2001</b> - <A HREF="mailto:omid at kdevelop.org">Omid Givi</A> a &eacute;crit une petite <A HREF="http://lists.kde.org/?l=kdevelop&amp;m=98379930132535&amp;w=2">introduction</A> pour tous ceux qui veulent nous aider pour la prochaine sortie de KDevelop (version 3.0).<br><br>
<b>7 Mars 2001</b> - <A HREF="mailto:rnolden at kdevelop.org">Ralf Nolden</A> a produit la "feuille de route de KDevelop pour 2001". Vous pouvez la lire <A HREF="http://lists.kde.org/?l=kdevelop&amp;m=98352993506471&amp;w=2">ici</A>.<BR><BR>
<b>26 F&eacute;vrier 2001</b> - <b>KDevelop 1.4</b> est sorti et fait partie de <A HREF="http://www.kde.org/announcements/announce-2.1.php">la sortie de KDE 2.1</A>. Vous pouvez utiliser tout <A HREF="http://www.kde.org/mirrors/">miroir KDE</A> pour le t&eacute;l&eacute;charger avec KDE 2.1.<br><br>
<b>20 F&eacute;vrierr 2001</b> - Anne-Marie Mahfouf a &eacute;crit un <A HREF="http://women.kde.org/articles/tutorials.php">tutoriel</A> sympa sur l'utilisation de KDevelop1.4 et Qt designer. Il est publi&eacute; sur le site web <a href="http://women.kde.org">women.kde.org</A><br><br>
<b>02 F&eacute;vrier 2001</b> - Avec la sortie de KDE2.1beta2, il y a aussi une nouvelle mise &agrave; jour de KDevelop. <b>KDevelop1.4beta2</b> est surtout un port de KDevelop1.3 port pour KDE2.1 mais contient aussi de petites am&eacute;liorations comme des widgets ancr&eacute;s. Vous pouvez obtenir le code source et les versions ex&eacute;cutables dans notre <a href="index.html?filename=2.1/kdevelop.html#Downloads">section</a> t&eacute;l&eacute;chargement ou sur tout miroir ftp KDE.
<br>
<br>
<b>07 Janvier 2001</b> - <a href="mailto:bartel at rz.uni-potsdam.de">Stefan Bartel</a> a cr&eacute;&eacute; un style KDE2 inspir&eacute; par le site web KDevelop. Vous pouvez le t&eacute;l&eacute;charger depuis <a href="http://kde.themes.org/themes.phtml?themeid=973183975">kde.themes.org</a>. Vraiment cool!
<br>
<br>

<b>04 Janvier 2001</b> - KDevelop 1.4 pour KDE2.1. Deux semaines apr&egrave;s la derni&egrave;re annonce,
c'est ce que nous avons produit. Il fonctionne, il est super, il devient tout simplement l'interface de d&eacute;veloppement
pour KDE de dernier cri pour la programmation d'applications de bureau. Veuillez jeter un coup d'oeil sur la droite dans le coin des images
pour voir la toute derni&eacute;re capture d'&eacute;cran&nbsp;!
<br>
<br>

<?php module_tail();?>
