<?php module_head("Nouvelles en 2000");?>
<b>20 D&eacute;cembre 2000</b> - KDevelop1.3 pour KDE2.1&nbsp;? Beaucoup d'utilisateurs l'ont demand&eacute; aussi <a href="mailto:jbb at kdevelop.org">John Birch</a> et d'autres ont commenc&eacute; &agrave; le porter il y a quelques jours. Il contient encore des bogues, n'a pas de nouvelles fonctionalit&eacute;s (les nouveaux ajouts seront pour KDevelop 2.0), mais la premi&egrave;re <a href="graphics/kdevelop_1_4.jpg">capture d'&eacute;cran</a> para&icirc;t assez prometteuse. La premi&egrave;re version beta sortira avec KDE2.1.
<br>
<br>

<b>11 D&eacute;cembre 2000</b> - L'&eacute;quipe KDevelop est fi&egrave;re d'annoncer la sortie de <b>KDevelop 1.3</b>. Cette version est une mise &agrave; jour majeure qui fait suite aux versions couronn&eacute;es de succ&egrave;s 1.1 and 1.2 pour permettre de d&eacute;velopper rapidement des applications pour le nouveau bureau KDE 2.0. Veuillez lire <a href="index.html?filename=1.3/announce-kdevelop-1.3.html">l'annonce officielle</a> pour plus de d&eacute;tails. Vous pouvez t&eacute;l&eacute;charger une <a href="ftp://ftp.kdevelop.org/pub/kdevelop/kdevelop-1.3-linux-i386.tar.bz2">version</a> pr&eacute;compil&eacute;e qui tourne sous toute machine Linux/i386 ou le code source complet <a href="ftp://ftp.kdevelop.org/pub/kdevelop/kdevelop-1.3.tar.bz2">ici</a>. Veuillez utiliser un <a href="index.html?filename=1.3/kdevelop.html#Downloads">miroir</a> au cas o&ugrave; le serveur serait bloqu&eacute;..
<br>
<br>

<b>27 Novembre 2000</b> - <b>KDevelop1.3beta1</b> est sorti. Cette version contient des squelettes pour KDE2 (XML-framework, KAction), un support pour Qt Designer, Qt Linguist et doxygen. Il y a aussi 3 nouveaux outils (kimport, kdevdlg2ui, one2two), quelques nouvelles options de configuration et comme toujours, des corrections de bogues.<br>KDevelop1.3 n&eacute;cessite les biblioth&egrave;ques Qt1/KDE1 pour &ecirc;tre compil&eacute;, mais nous avons aussi un <a href="ftp://ftp.kdevelop.org/pub/kdevelop/kdevelop-1.3beta1-1-linux-i386.tar.bz2">paquetage</a> pr&eacute;compil&eacute; pour i386/Linux, qui tourne sans installation de KDE1. Amusez-vous bien&nbsp;!
<br>
<br>

<b>26 Octobre 2000</b> - Une autre date est post&eacute;e par <a href="mailto:rnolden at kdevelop.de">Ralf Nolden</a> pour expliquer KDevelop&nbsp;: d'abord il y a
l'expo Systems &agrave; Munich en Allemagne, o&ugrave; KDevelop sera montr&eacute; au stand the KDE du 7 au 10 Novembre. Et tout de suite apr&egrave;s il sera disponible
pour r&eacute;pondre &agrave; vos questions &agrave; l'expo Comdex &agrave; Las Vegas, USA du 13 au 17 Novembre, toujours au stand KDE. Rendez-vous l&agrave;&nbsp;!
<br>
<br>
<b>20 Octobre 2000</b> - KDE 2.0 va bient&ocirc;t arriver et avec lui une nouvelle version de KDevelop. Bien qu'il d&eacute;pende toujours des biblioth&egrave;ques KDE 1.x et
qu'il soit un KDevelop 1.2 mis &agrave; jour, la nouvelle version va contenir le support pour les derni&egrave;res API dans KDE 2 ainsi que pour cr&eacute;er des dialogues avec Qt Designer.
De plus, une autre date&nbsp;: <a href="mailto:rnolden at kdevelop.de">Ralf Nolden</a> sera pr&eacute;sent &agrave; l'expo Systems &agrave; Munich en Allemagne du 7
au 10 Novembre au stand KDE. Si vous avez des questions concernant le d&eacute;veloppement pour KDE 2 avec KDevelop, venez y faire un tour et demandez, il sera content de faire de vous
un nouveau d&eacute;veloppeur KDE&nbsp;!
<br>
<br>
<b>03 Octobre 2000</b> - L'&eacute;quipe KDevelop est &agrave; nouveau en tourn&eacute;e&nbsp;! Ralf Nolden et Bernd Gehrmann, des d&eacute;veloppeurs KDevelop vont &ecirc;tre pr&eacute;sents au stand KDE et TrollTech pendant la Linux World Expo &amp; Conference &agrave; Frankfurt,
en Allemagne du 5 au 7 Octobre.  On peut aussi rencontrer Ralf au Oldenburger Linuxtage le 14 Octobre &agrave; Oldenburg en Allemagne.<br>
<br>
<b>29 Ao&ucirc;t 2000</b> - Florent Pillet a sorti la version 1.0 de <a href="http://kprof.sourceforge.net/">KProf</a>. C'est une application KDE2 sympa qui affiche la sortie g&eacute;n&eacute;r&eacute;e par <a href="http://www.gnu.org/manual/gprof-2.9.1/gprof.html">gprof</a>.<br>
<br>
<b>3 Ao&ucirc;t 2000</b> - Il existe un nouveau portail de d&eacute;veloppement pour tous les programmeurs KDE/Qt. <a href="http://www.ksourcerer.org">KSourcerer</a> contient un r&eacute;pertoire des classes dans lequel vous pouvez naviguer et vous pouvez t&eacute;l&eacute;charger des classes utiles pour vos applications. Merci de supporter ce projet int&eacute;ressant&nbsp;!<br>
<br>
<b>29 Juillet 2000</b> - Thomas Fromm a ajout&eacute; un petit <a href="index.html?filename=events/linuxtag2000.html">rapport sur LinuxTag</a>.
Vous pouvez voir des photos de la premi&egrave;re rencontre KDevelop au <a href="http://www.linuxtag.org">LinuxTag 2000</a>.<br>
<br>
<b>19 Juin 2000</b> - <a href="http://www.sco.com">L'entreprise Santa Cruz Operation (SCO)</a> sponsorisele d&eacute;veloppeur KDevelop
<a href="mailto:rnolden at kdevelop.de">Ralf Nolden</a> avec une nouvelle machine PIII/600 (512 MB RAM, 2x 15GB HDD) pour programmer sur
KDevelop et aider &agrave; rendre KDE 2.0 et KDevelop disponibles sur le syst&egrave;me d'exploitation SCO?s UnixWare7.
Merci &agrave; SCO, du bon mat&eacute;riel est toujours demand&eacute; par l'&eacute;quipe KDevelop. Si vous d&eacute;sirez suivre l'exemple de SCO et nous sponsoriser, soyez
libre de nous contacter&nbsp;! Pour plus d'information, veuillez regarder notre nouvelle page <a href="index.html?filename=sponsors.html">Sponsors</a>.
<br><br>

<b>19 Juin 2000</b> - <a href="http://www.siemens.de">Siemens Germany</a> nous aide en sponsorisant <a href="mailto:Ingo.Zevenbergen at post.rwth-aachen.de">
Ingo Zevenbergen</a> pour &eacute;crire une nouvelle r&eacute;f&eacute;rence C/C++ pour le prochain KDevelop 2.0. Cette r&eacute;f&eacute;rence sera &eacute;crite en style docbook et int&eacute;gr&eacute; dans
KDevelop et aura un copyright KDevelop. Merci &agrave; Siemens&nbsp;!
<br><br>

<b>7 Juin 2000</b> - <a href="mailto:rnolden at kdevelop.de">Ralf Nolden</a> va faire une pr&eacute;sentation de KDevelop 1.2 et de l'orientation future
durant l'exposition <a href="http://www.linuxtag.org">LinuxTag 2000</a> &agrave; Stuttgart en Allemagne le vendredi 30 Juin entre 16h30 et 17h30 au
stand de <a href="http://www.id-pro.de">ID-PRO</a>. Il sera aussi disponible au stand KDE pendant toute l'exposition du jeudi au dimanche,
venez lui parler de KDE et de KDevelop - il sera content de vous rencontrer&nbsp;!<br><br>

<b>5 Juin 2000</b> - <a href="mailto:Richard_Dale at tipitina.demon.co.uk">Richard Dale</a> a t&eacute;l&eacute;charg&eacute; sur le serveur son <a href="ftp://fara.cs.uni-potsdam.de/incoming/kdkobjc-0.2.tar.gz">correctif Objective C</a> pour KDevelop 1.2.
Celui-ci inclut un correctif pour l'&eacute;diteur de dialogue pour cr&eacute;&eacute;r du code Objective C pour Kangaroo (une tentative pour faire un bouclage automatique des classes Qt en Objective C). <br><br>

<b>23 Mai 2000</b> - <a href="mailto:RFunken at kdevelop.de">Ralf Funken</a> de l'&eacute;quipe KDevelop a &eacute;crit un livre d'apr&egrave; les manuels de KDevelop 1.2.
Le livre est disponible en format postscript (formats letter et DIN A4) ou comme paquetage source (contenant tous les fichiers n&eacute;cessaires pour compiler le livre + README).
Vous pouvez t&eacute;l&eacute;charger les paquetages <a href="ftp://129.187.206.68/pub/unix/ide/KDevelop/documentation/kdevelop_book" target=_top>ici</a>.<br>
OpenDocs, qui a d&eacute;j&agrave; fourni le livre version 1.0 va publier une version imprim&eacute;e prochainement. &Agrave; nouveau, jusqu'&agrave; 40% des profits reviendront
au projet KDevelop pour aider &agrave; continuer le d&eacute;veloppement.<br><br>

<b>16 Mai 2000</b> - Cosource a publi&eacute; une <a href="http://www.cosource.com/digest/lineo.html" target=_top>interview</a> avec le CTO de Lineo Tim Bird sur le patronage de projets Open Source. Il y a quelque temps, Lineo a parrain&eacute; l'int&eacute;gration de htdig dans KDevelop. <br><br>

<b>4 Mai 2000</b> -<b>KDevelop 1.2 final</b> est sorti. En plus de le la version 1.1, celle ci contient beaucoup de nouvelles traductions, un support pour le d&eacute;veloppement d'applications GNOME, plusieurs am&eacute;liorations dans le navigateur de doc, un d&eacute;bogueur int&eacute;gr&eacute; et beaucoup de corrections de bogues. Il y a aussi une mise &agrave; jour du <b>kit de d&eacte;veloppement KDE</b>, qui contient presque tout ce dont vous avez besoin pour un d&eacute;veloppement r&eacute;ussi avec C/C++ et KDE.<br><br>

<b>8 Avril 2000</b> - <a href="mailto:Ralf.Nolden at post.rwth-aachen.de">Ralf Nolden</a> de l'&eacute;quipe KDevelop donnera une <a href="http://Braunschweiger.LinuxTage.de/programm/index.html.en" target=_top>pr&eacute;sentation (voir au hall A &agrave; 15h00)</a> aux <a href="http://Braunschweiger.LinuxTage.de/index.html.en" target=_top>2nd Braunschweig Linux-Days</a> le samedi 14 Mai 2000. Si vous &ecirc;tes dans les environs, passez le rencontrer&nbsp;! <br><br>

<b>6 Avril 2000</b> - KDevelop dans les journaux ! Voyez page 88 du num&eacute;ro du 3 Avril 200 de <a href="http://www.infoworld.com" target=_top>InfoWorld</a> an <a href="http://www.infoworld.com/cgi-bin/deleteframe.pl?story=/articles/op/xml/00/04/03/000403oppetreley.xml" target=_top>article</a> about Qt and KDevelop. Nicholas Petreley dit "... Je vous recommande un programme appel&eacute; KDevelop, disponible &agrave; www.kdevelop.org. C'est un environnement int&eacute;gr&eacute; libre de programmation KDE et Qt de toute beaut&eacute; et il inclut la documentation Qt et le tutoriel..." <br><br>

<b>30 Mars 2000</b> - Quelques nouvelles du site web&nbsp;: il y a de nouvelles pages comme les <a href="index.html?filename=1.3/kdevelop.html#Tutorials">tutoriels</a> et les <a href="index.html?filename=splashscreens.html">images de d&eacute;marrage</a>, la 40&egrave;me <a href="index.html?filename=users.html">application</a> cr&eacute;&eacute;e en utilisant KDevelop a &eacute;t&eacute; ajout&eacute;e. Les coupures de <a href="index.html?filename=in_the_press.html">presse</a> pour KDevelop1.0 et 1.1 sont maintenant en-ligne.<br><br>

<b>21 Mars 2000</b> - <a href="mailto:geiseri at msoe.edu">Ian Reinhart Geiser</a> a mis &agrave; jour son "convertisseur de projet KDeveop vers un fichier SPEC"<a href="http://www.msoe.edu/~geiseri/projects.phtml?project=Kpp" target=_top> Kpp</a> pour KDevelop. Cette version contient de nouvelles caract&eacute;ristiques et fonctionne avec toutes les versions les plus r&eacute;centes de KDevelop. <br><br>

<b>7 Mars 2000</b> - Un nouveau r&eacute;pertoire (appel&eacute; "kdk_updates") est ouvert maintenant sur les miroirs ftp. Vous pouvez y trouver des mises &agrave; jour des paquetages individuels de KDK,
s'ils n'ont pas de site web d&eacute;di&eacute;. Actuellement, c'est le cas d'un nouveau paquetage de kdesgmltools-package (version de d&eacute;veloppement journali&egrave;re CVS avec un petit correctif).
Veuillez cliquer <a href="ftp://129.187.206.68/pub/unix/ide/KDevelop/kdk_updates" target=_top>ici</a> pour aller dans ce nouveau r&eacute;pertoire.<br><br>

<b>3 Mars 2000</b> - Les <b>manuels KDevelop 1.1</b> complets sont maintenant disponibles dans les formats suivants&nbsp;: dvi, PostScript, PDF, &agrave; la fois en lettre et A4&nbsp;: <a href="ftp://fara.cs.uni-potsdam.de/incoming" target=_top>T&eacute;l&eacute;chargement</a><br><br>

<b>3 Mars 2000</b> - Des paquetages ex&eacute;cutables pour KDevelop 1.1 et/ou le kit de d&eacute;veloppement KDE 1.1 sont disponibles pour les plates-formes suivantes&nbsp;: Linux (SuSE 6.x, RedHat 6.1, Mandrake 7, Debian 2.1), FreeBSD 4.0 et Unixware 7. Merci &agrave; toutes les personnes qui les font&nbsp;!<br><br>

<b>2 Mars 2000</b> - <a href="http://www.linuxports.com" target="_top">Linuxports.com</a> mettent maintenant en <b>vente</b> Developing Linux Applications: KDE Edition.<br> Ce livre contient toute la documentation en-ligne de KDevelop dans une &eacute;dition imprim&eacute;e. Jusqu'&agrave; 40% des profits nets reviendront au projet KDevelop pour aider &agrave; continuer le d&eacute;veloppement.<br><br>

<b>29 F&eacute;vrier 2000</b> - <a href="mailto:Richard_Dale at tipitina.demon.co.uk">Richard Dale</a> a mis &agrave; jour son <a href="ftp://129.187.206.68/pub/unix/ide/KDevelop/patches/KDKOBJC-0.1.tar.gz">correctif</a> Objective C pour le kit de d&eacute;veloppement KDE. Gr&acirc;ce &agrave; l'installation de ce correctif, vous pouvez d&eacute;velopper pour GNUstep avec KDevelop. Merci &agrave; Richard&nbsp;!<br><br>

<b>28 F&eacute;vrier 2000</b> -<b>KDevelop 1.1 final</b> est sorti. En plus de la version 1.0, cette version contient plusieurs nouveaux <a href="index.html?filename=1.3/changes.html">&eacute;l&eacute;ments</a> et d'importantes corrections de bogues. Il y a aussi la mise &agrave; jour du <b>kit de d&eacute;veloppement KDE</b>, qui contient presque tout ce dont vous avez besoin pour une programmation C/C++ et KDE r&eacute;ussie.<br><br>

<b>21 F&eacute;vrier 2000</b> -Petr Sorfa (petrs at sco.com) a &eacute;crit un <a href="http://www.sco.com/skunkware/kde/kdevelop_tutorial/" target=_top>tutoriel</a> pour les d&eacute;butants de KDevelop. On peut le voir &agrave; <a href="http://www.sco.com" target=_top> www.sco.com</a>. Merci beaucoup&nbsp;!<br><br>

<table><tr><td>
 <center><a href="phorum5/read.php?2,1">
 <img src="graphics/forum.gif" alt="forum pic" border=0></a></center>
</td> <td valign=top> <b>11 F&eacute;vrier 2000</b> - L'&eacute;quipe KDevelop est fi&egrave;re de pr&eacute;senter leur propre <b>forum KDevelop</b>. Il est pr&eacute;vu pour des discussions concernant des sujets en relation avec KDevelop, KDE et QT. Veuillez poster vos messages sur ces sujets. Un autre ajout&nbsp;: on vous enverra un mail automatiquement si quelqu'un r&eacute;pond &agrave; votre message.<br>Pour le voir fonctionnner, veuillez cliquer soit sur l'image soit <a href="phorum5/read.php?2,1">ici</a>.
<br></td></tr></table>

<b>4 F&eacute;vrier 2000</b> - Sortie de la <b>documentation de la biblioth&egrave;que KDE 1.1Beta2</b> pr&eacute; g&eacute;n&eacute;r&eacute;e pour fonctionner avec KDevelop. Cette version corrige le bogue des liens crois&eacute;s avec la documentation de la biblioth&egrave;que QT et d'autres bogues mineurs.
Apr&egrave;s l'avoir install&eacute;, veuillez relancer "kdevelop --setup" et la documentation devrait &ecirc;tre trouv&eacute;e automatiquement...<br>
Ce paquetage se trouve dans le r&eacute;pertoire "documentation" des miroirs.
Veuillez cliquer <a href="index.html?filename=1.3/kdevelop.html#Downloads">ici</a> pour la page de t&eacute;l&eacute;chargement.<br>

<table><tr><td>
 <center><img src="graphics/small_1_1_logo.jpg" alt="kdevelop logo" border=0>
            </center>
</td> <td valign=top> <b>31 Janvier 2000</b> - Sortie de <b>KDevelop 1.1Beta2</b>. Cette version contient 7 nouvelles applications de base, un d&eacute;bogueur int&eacute;gr&eacute; am&eacute;lior&eacute; et plusieurs autres caract&eacute;ristiques et corrections de bogues. Cliquez <a href="index.html?filename=1.3/changes.html">ici</a> pour plus d'information.<br></td></tr></table>


<table><tr><td>
 <center><a href="http://www.linuxports.com" target="_top">
              <img src="graphics/coversmall.jpg" alt="book picture" border=0></a></center>
</td> <td valign=top> <b>26 Janvier 2000</b> - <a href="http://www.linuxports.com" target="_top">Linuxports.com</a> accepte maintenant des ordres de commande pour "Developing Linux Applications: KDE Edition".<br>Ce livre contient toute la documentation de KDevelop en format imprim&eacute; plus la non officielle Redhat 6.1 et KDevelop 1.0. Plus de 40% des profits nets reviennent aussi au projet KDevelop pour aider &agrave; continuer le d&eacute;veloppement.</td></tr></table>

<b>20 Janvier 2000</b> - <a href="mailto:Richard_Dale at tipitina.demon.co.uk">Richard Dale</a> a mis &agrave; jour son <a href="ftp://fara.cs.uni-potsdam.de/incoming/kdevelop-1.1-beta1.0objc.patch.gz">correctif</a> Objective C pour KDevelop 1.1beta1.<br><br>

<b>17 Janvier 2000</b> - Sortie de <b>KDevelop 1.1Beta1</b>. Cette version contient beaucoup de nouvelles caract&eacute;ristiques et plusieurs corrections de bogues. Merci &agrave; tous ceux qui ont contribu&eacute; &agrave; cette version. Cliquez <a href="index.html?filename=1.3/changes.html">ici</a> pour plus d'information.<br><br>

<b>13 Janvier2000</b> - <a href="mailto:Nils.Ulltveit-Moe at hia.no">Nils Ulltveit-Moe</a> a fait un  <a href="ftp://fara.cs.uni-potsdam.de/incoming/nfs.patch">correctif</a> qui corrige plusieurs probl&egrave;mes si vous utilisez KDevelop 1.0 avec des environnements NFS (Network File System).<br><br>

<b>10 Janvier 2000</b> - <a href="mailto:belran at worldnet.att.net">Robert.M.Wheat</a> propose un correctif pour ajouter un projet OpenGL(tm) au gestionnaire de cr&eacute;ation de projets. Ce <a href="ftp://fara.cs.uni-potsdam.de/incoming/kdevelop-1.0beta4.1_ogl_diff.tar.gz">correctif</a> fonctionne avec 1.0Beta4 et 1.0final.<br>
<br>
<b>7 Janvier 2000</b> - <a href="http://www.linuxports.com/" target=_top>Linuxports.com </a> va vendre "Developing Applications for Linux: KDE Edition". Le livre contient la documentation compl&egrave;te de KDevelop ainsi que la non officielle Redhat 6.1 et KDevelop 1.0.<br>
<br>

<b>3 Janvier 2000</b> - <a href="mailto:a2h8fu at bg.bib.de">Ralf Funken</a> a fait un paquetage du kit de d&eacute;veloppement KDE pour Redhat 6.1 (x86). Veuillez le t&eacute;l&eacute;charger <a href="ftp://129.187.206.68/pub/unix/ide/KDevelop/binaries/RedHat-6.1/kdk-1.0a-1.i386.rpm"> ici.</a> Le paquetage a &eacute;t&eacute; li&eacute; contre la libstdc++ 2.95, que vous pouvez trouver <a href="ftp://ftp.redhat.com/pub/contrib/libc6/i386/libstdc++-2.95.1_2.10.0-3.i386.rpm">ici</a> .<br>
<br>

<?php module_tail();?>
