<?php module_head("Nouvelles en 2003");?>
<b>08 D&eacute;cembre 2003</b> - Sortie de la version Beta 2 de KDevelop-3.0.0.
Vous pouvez voir les changements dans le <a
href="index.html?filename=3.0/changes.html">journal des changements</a>. Vous
pouvez la t&eacute;l&eacute;charger &agrave; <a
href="index.html?filename=3.0/download.html">la page de
t&eacute;l&eacute;chargement</a>.<br><br>
<b>24 Novembre 2003</b> - Veuillez trouver en-ligne et automatiquement
synchronis&eacute; avec le dernier cvs HEAD <a
href="http://docs.kde.org/kde3/en/kdevelop/kdevelop/">le manuel de
l'utilisateur</a>. Fourni par Daniel Naber de <a
href="http://l10n.kde.org/">l'&eacute;quipe de documentation de KDE</a>.<br><br>
<b>23 Novembre 2003</b> - Ajout de trois nouveaux <a
href="index.html?filename=tutorials.html">tutoriels</a>.<br><br>
<b>22 Novembre 2003</b> - KDevelop a gagn&eacute; le prix 2003 de Linux New Media comme meilleure interface de d&eacute;veloppement int&eacute;gr&eacute;. Vous trouverez plus d'information <a href="index.html?filename=awards.html">ici</a>.<br><br>
<b>18 Novembre 2003</b> - <a href="HEAD/doc/api/html/index.html">KDevelop API documentation</a> is now cross linked with KDE and Qt API documentation. Besides that it includes links to the <a href="http://bugs.kde.org/buglist.cgi?product=kdevelop&amp;bug_status=UNCONFIRMED&amp;bug_status=NEW&amp;bug_status=ASSIGNED&amp;bug_status=REOPENED&amp;order=bugs.bug_id">bugzilla bug database</a> and links to the <a href="HEAD/doc/api/html/requirements.html">required software</a>.<br><br>
<b>03 Novembre 2003</b> - L'ex&eacute;cutable de la version Beta 1 de KDevelop-3.0.0 s'appelle &agrave; nouveau kdevelop&nbsp;! Vous pouvez lire les changements dans le <a href="index.html?filename=3.0/changes.html">journal des changements</a>. Vous pouvez la t&eacute;l&eacute;charger dans la <a href="index.html?filename=3.0/download.html">page de t&eacute;l&eacute;chargement</a>.<br><br>
<b>13 Octobre 2003</b> - KDevelop-3.0 Alpha 7 <a href="http://sourceforge.net/forum/forum.php?forum_id=318425">est maintenant disponible sous Win32 (cygwin)</a>. Merci &agrave; Ralf Habacker et <a href="http://kde-cygwin.sourceforge.net/">son &eacute;quipe</a>&nbsp;!<br><br>
<b>25 Septembre 2003</b> - Attendue depuis longtemps, la <a href="HEAD/doc/api/html/index.html">documentation de l'API KDevelop</a> (mise &agrave; jour automatiquement toutes les 24H) est maintenant en ligne. Des versions mises &agrave; jour automatiquement du <a href="http://docs.kde.org/kde3/en/kdevelop/kdevelop/">manuel utilisateur</a> actuellement obsol&egrave;te et de <a href="http://docs.kde.org/kde3/en/kdevelop/kde_app_devel/">D&eacute;velopper une application KDE avec KDevelop</a> suivront d&egrave;s que l'administrateur syst&egrave;me du serveur installera docbook2html.<br><br>
<b>24 Septembre 2003</b> - Sortie de la version Alpha 7 de KDevelop-3.0 (Gideon). Les changements se trouvent dans le <a href="index.html?filename=3.0/changes.html">journal des changements</a>. Vous pouvez la t&eacute;l&eacute;charger sur la <a href="index.html?filename=3.0/download.html">page des t&eacute;l&eacute;chargements</a>.<br><br>
<b>10 Septembre 2003</b> - Sortie de la version Alpha 6 de KDevelop-3.0 (Gideon). Les changements se trouvent dans le  <a href="index.html?filename=3.0/changes.html">journal des changements</a>. Vous pouvez la t&eacute;l&eacute;charger sur la <a href="index.html?filename=3.0/download.html">page des t&eacute;l&eacute;chargements</a>.<br><br> 
<b>31 Ao&ucirc;t 2003</b> - La Conf&eacute;rence s'est termin&eacute;e et KDevelop a eu quelques am&eacute;liorations - l'analyseur C++ est plus rapide, peut g&eacute;rer la compl&eacute;tion de code pour les signals et les slots de qt, l'interface utilisateur a &eacute;t&eacute; am&eacute;lior&eacute;e, tous les modules externes ont un num&eacute;ro de version pour les pr&eacute;munir contre l'enfer des DLL, le language de programmation actif peut &ecirc;tre chang&eacute; au vol, le support SQL a une vue des classes et le travail commence sur un gestionnaire de projets g&eacute;n&eacute;rique. Les vues de la pr&eacute;sentation de harryF sont disponibles <a href="http://events.kde.org/info/kastle/conference_program.php">ici</a>.<br><br>
<b>28 Ao&ucirc;t 2003</b> - &Agrave; cause de <a href="http://dot.kde.org/1061858903">la conf&eacute;rence des d&eacute;veloppeurs de KDE</a>, vous pouvez avoir remarqu&eacute; de nouvelles fonctionalit&eacute;s (ainsi que certains probl&egrave;mes) pour Gideon. Veuillez &ecirc;tre patient lorsque vous faites une mise &agrave; jour du CVS et merci de ne pas inonder notre syst&egrave;me de rapport de bogues, nous savons ce qui ne fonctionne pas ;).<br><br>
<b>15 Juillet 2003</b> - KDevelop-3.0 va suivre <a href="http://developer.kde.org/development-versions/kde-3.2-release-plan.html">le plan de sortie de KDE3.2</a>.<br><br>
<b>24 Mai 2003</b> - Walter Roth a &eacute;crit une <a href="2.1/doc/HowToInstallKdevelopOnSuSE.txt">documentation</a> sur comment installer un KDevelop 2.x complet sous SuSE (avec un index de recherche). Cela devrait &ecirc;tre la m&ecirc;me chose pour d'autres distributions. <br><br>
<b>20 Mai 2003</b> - Voici encore un autre tutoriel sympathique, il montre comment cr&eacute;er un dialogue de configuration. Vous pouvez en lire la traduction fran&ccedil;aise  <a href="3.0/doc/tutorial_settings/index_fr.html">ici</a>.<br><br>
<b>18 Avril 2003</b> - Sortie de KDevelop-3.0 (Gideon) Alpha 4 <a href="index.html?filename=3.0/changes.html">Journal des changements</a>.<br><br>
<b>26 Mars 2003</b> - Antonio Larrosa a &eacute;crit un tutoriel sympa qui permet d'utiliser ensemble KDevelop et Qt Designer.  Vous pouvez le consulter <a href="http://developer.kde.org/~larrosa/visualtutorial.html">ici</a>.<br><br>
<b>9 Mars 2003</b> - Roberto a con&ccedil;u un <a href="3.0/doc/tutorial_qtopia/">tutoriel</a> sympa sur comment &eacute;crire des applications <a href="http://www.trolltech.com/products/qtopia/index.html">Qtopia</a> pour tous les appareils PDA avec KDevelop 3.x (<a href="index.html?filename=3.0/branches_compiling.html">CVS HEAD</a> seulement).<br><br>
<b>5 Mars 2003</b> - Rencontrez les utilisateurs et les d&eacute;veloppeurs de KDevelop en ligne&nbsp;! La cha&icirc;ne #kdevelop sur le serveur irc.kde.org est maintenant enregistr&eacute;e officiellement, merci de venir y faire un tour (en utilisant ksirc par exemple).<br><br>
<b>5 Mars 2003</b> - ccurtis0 at yahoo dot com a &eacute;crit un beau "<a href="index.html?filename=3.0/doc/tutorial_autoconf.html">tutoriel sur autoconf et KDevelop</a>" pour KDevelop (2.x et 3.0 alpha).<br><br>
<b>29 Janvier 2003</b> - linuxlah a &eacute;crit un nouveau "<a href="http://arfa.komnas.com/~jeffry_johar/linuxlaht1/t1.html">tutoriel KDevelop & QT Designer</a>" pour KDevelop 2.1.<br><br>
<b>28 Janvier 2003</b> - <b>KDevelop 2.1.5</b> est disponible en version mise &agrave; jour pour les utilisateurs de KDE 3.1. Merci &agrave; Ralf Nolden pour &ecirc;tre &agrave; l'origine de cette sortie.<br><br>
<b>8 Janvier 2003</b> - Sortie Alpha 3 def KDevelop-3.0 (Gideon).<br><br>
<?php module_tail();?>
