<?php module_head("Auszeichnungen f&uuml;r KDevelop");?>

<ul>

<li>
<H4>2004 Wahl-Preise Der LinuxQuestions.org Mitglieder</H4>
Die Mitglieder von
<a href="http://www.linuxquestions.org/">
LinuxQuestions.org</a> wählten KDevelop als der
<a href="http://www.linuxquestions.org/questions/t272124.html">
IDE für das Jahr von 2004</a>.
<br><br>
<img src="graphics/awards/lq_2004mca.png" alt="2004 LinuxQuestions.org Member's Choice Awards  KDevelop - IDE of the year 2004">
<br><br>
</li>

<li>
<H4><a href="http://www.linuxworldexpo.com">Linuxworld New York 2004 Konferenz &amp; Ausstellung</a>:
Erster Platz in der Kategorie "Bestes Entwicklungswerkzeug"</H4>
Der Preis wird in Zusammenarbeit mit der UniForm Association, einem Gremium von Experten aus 
der Industrie, vergeben und erkennt Leistungen im Bereich Produkt/Service Innovation und 
L&ouml;sungen in quelloffener Computersoftware an. Es ist eine gro&szlig;e Ehre f&uuml;r uns einen 
"Product Excellence Award" zu erhalten. Wir danken der Open Source Gemeinschaft f&uuml;r ihre
lang andauernde Unterst&uuml;tzung.
<br><br>
<img src="graphics/awards/lwce_award_logo_2004.gif" alt="Logo des LinuxWord Conference &amp; Expo Award" width="25%">
<br><br>
</li>

<li>
<H4>Linux New Media Award 2003: Erster Platz in der Kategorie "IDE Entwicklungssystem"</H4>
Eine Jury aus Autoren, Gr&ouml;&szlig;en aus der Industrie und Mitgliedern der Open Source Gemeinschaft sowie die Reporter des Linux Magazins stimmten f&uuml;r KDevelop als beste Anwendung im Bereich "IDE Entwicklungssystem". KDevelop konnte 29.4&nbsp;% aller Stimmen auf sich vereinen, auf dem zweiten und dritten Platz landeten Eclipse und Anjuta. Der komplette Artikel ist <a href="http://www.linux-magazine.com/issue/38/Linux_New_Media_Awards.pdf">in englisch</a> oder <a href="http://www.linux-magazin.de/Artikel/ausgabe/2003/12/award/award.html">in deutsch</a> verf&uuml;gbar.
<br><br>
<img src="graphics/awards/lnm_award_logo_2003.jpg" alt="Logo des Linux New Media Award">
<br><br>
</li>

<li>
<H4>Linux New Media Award 2002: Zweiter Platz in der Kategorie "Beste Entwicklungssoftware"</H4>
In jeder der zehn Kategorien wurden die ersten drei Pl&auml;tze bei einer Jury aus 35 Personen bestimmt. Die Jury bestand aus Linux Professionals, wie Reportern und regelm&auml;&szlig;en Autoren des Linux Magazine, Linux Magazin, LinuxUser, and Linux-Community.de. Weitere Jurymitglieder waren bedeutende Personen in der Open Source Szene und im Open Source Business, wie Kernel Koordinator Alan Cox, Linux International Pr&auml;sident Jon "maddog" Hall, FreeSoftwareFoundation Europas Pr&auml;sident Georg Greve, IBM Linux Evangelist Tom Schwaller und Kalle Dalheimer.
<br><br>
<img SRC="graphics/awards/lnm_award_logo.jpg" ALT="Logo des Linux New Media Award">
<br><br>
</li>

<li>
<H4>Open Choice 2002 Best Development Tool Award</H4>
Timothy R. Butler (Chefredakteur von Open for Business) schrieb:<br>
"(...) Ich habe die Ehre dass Open for Business KDevelop 2.1.2 mit dem "Open Choice 2002 Best Development Tool Award" ausgezeichnet hat. Der Artikel der KDevelop's Empfang der Auszeichnung erw&auml;hnt befindet sich unter 
<a href="http://www.ofb.biz/modules.php?name=News&amp;file=article&amp;sid=146">http://www.ofb.biz/modules.php?name=News&amp;file=article&amp;sid=146</a> (...)<br>
Open for Business hat seinen Sitz in den Vereinigten Staaten, und ver&ouml;ffentlicht nur online."<br><br>
<img SRC="graphics/awards/open-choice_awardlogo.jpg" ALT="Logo des Open Choice Award">
<br><br>
</li>

<li>
<H4>Linux Format Award 2001</H4>
Richard Smedley (Produktions-Verantwortlicher, Linux Format) schrieb:<br>
"Linux Format ist das gr&ouml;&szlig;te (&auml;lteste, am besten verkaufende, etc... [;-)]) GNU/Linux Magazin in Gro&szlig;britannien, mit bedeutenden Verkaufszahlen in Skandinavien, den Benelux-Staaten, Australien und in den USA. Zu Beginn dieses Jahres die Leser stimmten &uuml;ber die Nominierungen f&uuml;r die Auszeichnungen in den Kategorien auf unserer Internetseite (<a href="http://www.linuxformat.co.uk">www.linuxformat.co.uk</a>) ab. Nachdem die Nominationen entschieden und im Magazin ver&ouml;ffentlicht waren, wurden die Stimmen abgegeben.
Die Geschichte ist nicht auf der Startseite, aber in K&uuml;rze wird der Artikel in unseren Onlinearchiven erscheinen. Ich sende es [die Auszeichnung] an Mirko Boehm von KDE e.V."<br><br>
<img SRC="graphics/awards/linux-format_awardlogo.jpg" ALT="Logo des Linux Format Award">
<br><br>
</li>

<li>
<H4>Linux New Media Award 2001 f&uuml;r das "Beste Linux Entwicklungswerkzeug"</H4>
Ralf Nolden nahm den Preis der <a href="http://www.linux-events.de">Linux New Media AG</a> auf der Systems in M&uuml;nchen entgegen. Wir haben das Preisgeld (1.500 Euro) dem <a href="http://www.kde.org/support/">Konto der KDE Organisation (in englisch)</a> gespendet.<br><br>
<br><br>
</li>

</ul>

<?php module_tail(); ?>
