<?php module_head("Neues 2001");?>
<b>20. Dezember 2001</b> - <b>KDevelop 2.1 Beta 1</b> freigegeben als Teil der <A HREF="http://www.kde.org/announcements/announce-3.0beta1.php">KDE 3.0 Beta 1 Ver&ouml;ffentlichung</A>. Ihr k&ouml;nnt es <A HREF="http://www.kde.org/download.html">hier von den KDE-Servern</A>.<br> herunterladen. Die Liste der &Auml;nderungen findet ihr <A HREF="index.html?filename=2.1/changes.html">hier</A>.<br>Lest <a href="http://dot.kde.org/1007435836">hier</a> mehr &uuml;ber das neue Feature der Unterst&uuml;tzung von plattform&uuml;bergreifendem Compilieren.<br><br>
<b>23. November 2001</b> - Bugfixversion <b>KDevelop 2.0.2</b> freigegeben als Teil der <A HREF="http://www.kde.org/announcements/announce-2.2.2.php">KDE 2.2.2 Ver&ouml;ffentlichung</A>. Ihr k&ouml;nnt es <A HREF="http://www.kde.org/download.html">hier von den KDE-Servern</A> herunterladen. Die Liste der &Auml;nderungen findet ihr <A HREF="index.html?filename=2.1/changes.html">hier</A>.<br><br>
<b>20. November 2001</b> - Es gibt auch eine englische Version vom Award (siehe unten). Lest <a href="http://dot.kde.org/1005265771">hier</a>.<br><br>
<b>22. October 2001</b> - Am Donnerstag gewann KDevelop den <a href="http://home.in.tum.de/meyerc/Systems/pict0030.jpg">Linux New Media Award 2001 f&uuml;r das "Beste Linux-Entwicklungstool"</a>. :-) <a href="http://www.kde.org/people/images/ralf2.jpg">Ralf Nolden</a> nahm den Preis von der <a href="http://www.linux-events.de">Linux New Media AG</a> auf der <a href="http://home.in.tum.de/meyerc/Systems">Systems-Messe in M&uuml;nchen</a> entgegen. Wir spenden das Geld (1500 Euro) auf das <a href="http://www.kde.org/helping.html">Konto der KDE e.V.</a><br><br>
<b>11. Oktober 2001</b> - HarryF und F@lk haben KDevelop 2.0 auf KDE3 alpha 1 portiert. Der CVS-Branch KDE_2_2_BRANCH <a href="index.html?filename=2.1/kdevelop.html#Downloads">compiliert</a> und l&auml;uft mit KDE3alpha1/Qt3beta6 wie auch weiterhin mit KDE2/Qt2.<br><br>
<b>19. September 2001</b> - Bugfixversion <b>KDevelop 2.0.1</b> <a href="announce-kdevelop-2.0.html">freigegeben</a> als Teil der <A HREF="http://www.kde.org/announcements/announce-2.2.1.php">KDE 2.2.1 Ver&ouml;ffentlichung</A>. Ihr k&ouml;nnt einen der <A HREF="http://www.kde.org/mirrors/">KDE mirrors</A> nutzen, um es zusammen mit KDE 2.2.1 herunterzuladen.<br> Eine <A HREF="index.html?filename=2.1/changes.html">detaillierte Liste</A> der &Auml;nderungen ist ebenfalls verf&uuml;gbar.<br><br>
<b>7. September 2001</b> - Linux-Magazin ver&ouml;ffentlicht einen Artikel von F@lk &uuml;ber KDevelop 2.0. Kaufen und Lesen! ;-)<br><br>
<b>15. August 2001</b> - <b>KDevelop 2.0</b> <a href="announce-kdevelop-2.0.html">freigegeben</a> als Teil der <A HREF="http://www.kde.org/announcements/announce-2.2.php">KDE 2.2 Ver&ouml;ffentlichung</A>. Ihr k&ouml;nnt einen der <A HREF="http://www.kde.org/mirrors/">KDE mirrors</A> nutzen, um es zusammen mit KDE 2.2 herunterzuladen.<br> Eine <A HREF="index.html?filename=2.1/changes.html">detaillierte Liste</A> der &Auml;nderungen ist ebenfalls verf&uuml;gbar.<br><br>
<b>5.-8. Juli 2001</b> - <a href="http://www.linuxtag.org">LinuxTag</a>, Das OpenSource-Ereignis Nr.1 in Europa. <a href="index.html?filename=events/linuxtag2001.html">Hier</a> findet Ihr ein paar Bilder dazu.<br><br>
<b>6. Juli 2001</b> - <b>KDevelop 2.0 Beta1</b> als Teil von <A HREF="http://www.kde.org/announcements/announce-2.2-beta1.php">KDE 2.2 Beta1 release</A> ver&ouml;ffentlicht. Ihr k&ouml;nnt einen der <A HREF="http://www.kde.org/mirrors/">KDE mirrors</A> nutzen, um es zusammen mit KDE 2.2 Beta1 herunterzuladen.<br> Eine <A HREF="index.html?filename=2.1/changes.html">ausf&uuml;hrlichere Liste der &Auml;nderungen</A> ist auch verf&uuml;gbar.<br><br>
<b>9. Juni 2001</b> - Auf "dot" wurde ein neuer <a href="http://dot.kde.org/992083107/">Status des HEAD-Branches</a> ver&ouml;ffentlicht, inclusive verschiedener Schnappsch&uuml;sse<br><br>
<b>5. Juni 2001</b> - Falk brachte die ToDo-<a href="index.html?filename=current_work.html">Liste</a> f&uuml;r KDevelop2.0 auf den neuesten Stand. Wenn Ihr helfen wollt, z&ouml;gert nicht, Eure coolen Patches einzuschicken.<br><br>
<b>15. Mai 2001 </b> - Einige Leute hatten Probleme mit der Installation von KDevelop 2.0. Hier ist eine <a href="http://lists.kde.org/?l=kdevelop&amp;m=98993419130573&amp;w=2">Beschreibung</a>, wie man eine CVS-Schnappschuss-Version von KDevelop 2.0 zum Laufen kriegt. Das sollte eigentlich schon helfen.<br><br>
<b>9. Mai 2001 </b> - Falk schrieb einen kleinen <a href="index.html?filename=2.1/features.html">Beitrag</a>, der die neue Benutzeroberfl&auml;che f&uuml;r KDevelop2.0 zeigt und erkl&auml;rt. Viel Spa&szlig;!<br><br>
<b>23. April 2001</b> - Falk Brettschneider schrieb eine ToDo-<a href="http://lists.kde.org/?l=kdevelop-devel&amp;m=98800682211334&amp;w=2">Liste</a> f&uuml;r KDevelop2.0. Wenn Ihr helfen wollt, checkt den Quellcode aus and schreibt Euch auf der kdevelop-devel-Mailingliste ein.
 Wir w&uuml;rden uns sehr &uuml;ber Eure Hilfe freuen.
<br><br>
<b>17. April 2001</b> - <a href="http://www.radiotux.de">RadioTux</a> - The German
LinuxInternetRadio - pr&auml;sentiert in seiner zweiten Sendung ein Interview mit Ralf Nolden &uuml;ber KDevelop.<br><br>
<b>10. April 2001</b> - KDE.org publiziert ein <a href="http://www.kde.org/people/ralf.html">Interview</a> mit Ralf Nolden, einem der Hauptentwickler von KDevelop.<br><br>
<b>4. April 2001</b> - Der KDevelop HEAD-Branch beinhaltet nun die <a href="http://apps.kde.com/na/2/info/id/1068">Gideon</a>-Quellcodes. N&auml;here Informationen k&ouml;nnt Ihr im <a href="http://dot.kde.org/986594487/">Artikel</a> auf dot.kde.org nachlesen.<br><br>
<br>
<b>13. März 2001</b> - <A HREF="mailto:nolden at kde.org">Ralf Nolden</A> wird wieder zum ersten Tour-Termin der KDevelop Roadshow und KDE 2.1 auf der CeBit in Hannover am 24./25. März mit dabei sein. Die erste Präsentation findet
 am 24. 11:45Uhr auf dem SuSE-Stand (Halle 3, Stand E45) statt,  die zweite am selben Tag auf dem Rheinland-Pfalz-Stand in Halle 18, Stand B 43 15:00Uhr nach Martin Konold's KDE-2.1-Präsentation um 14:30Uhr.<br><br>
<b>8. März 2001</b> - <A HREF="mailto:omid at kdevelop.org">Omid Givi</A> schrieb eine kleine <A HREF="http://lists.kde.org/?l=kdevelop&amp;m=98379930132535&amp;w=2">Einführung</A> für alle, die uns bei der nächsten großen KDevelop-Auslieferung (version 3.0) helfen wollen.<br><br>
<b>7. März 2001</b> - <A HREF="mailto:rnolden at kdevelop.org">Ralf Nolden</A> stellte die offizielle "KDevelop Roadmap 2001" zusammen. Ihr könnt sie <A HREF="http://lists.kde.org/?l=kdevelop&amp;m=98352993506471&amp;w=2">hier</A> lesen.<BR><BR>
<b>26. Februar 2001</b> - <b>KDevelop 1.4</b> als Teil der <A HREF="http://www.kde.org/announcements/announce-2.1.php">KDE-2.1-Release</A> veröffentlicht. Ihr könnt einen der <A HREF="http://www.kde.org/mirrors/">KDE-Mirrors</A> nutzen, um es zusammen mit KDE 2.1 herunterzuladen.<br><br>
<b>20. Februar 2001</b> - Anne-Marie Mahfouf schrieb eine hübsche <A HREF="http://women.kde.org/articles/tutorials.php">Anleitung</A>, wie man KDevelop1.4 und den Qt-Designer benutzt. Publiziert ist es auf <a href="http://women.kde.org">women.kde.org</A>.<br><br>
<b>02. Februar 2001</b> - Zusammen mit der KDE2.1beta2-Veröffentlichung gibt es auch ein erneuertes KDevelop. <b>KDevelop1.4beta2</b> ist hauptsächlich eine Portierung von KDevelop1.3 auf den neuen KDE2.1-Desktop, aber beinhaltet auch ein paar kleine Neuerungen, wie Dockwidgets. Ihr könnt den Quellcode und die Versionen der Binaries von diesem <a href="index.html?filename=1.3/kdevelop.html#Downloads">Bereich</a> oder einem der KDE-ftp-Mirrors herunterladen.
<br>
<br>
<b>07. Januar 2001</b> - <a href="mailto:bartel at rz.uni-potsdam.de">Stefan Bartel</a> erstellte einen KDE2-Style, der von der KDevelop-Homepage inspiriert wurde. Ihr könnt ihn von <a href="http://kde.themes.org/themes.phtml?themeid=973183975">kde.themes.org</a> herunterladen. Wirklich cool!
<br>
<br>
<b>04. Januar 2001</b> - KDevelop 1.4 für KDE2.1 . Ein Fortschritt seit der letzten Veröffentlichung, das ist unser jetziger Stand. Funktioniert, geht ab wie Schmidt's Katze, bringt einfach Eure Lieblings-IDE
für KDE-Entwicklung auf den Stand der Zeit der Desktop-Programmierung. Werft mal einen Blick rechts in die Bilder-Ecke, um den neuesten Schnappschuß anzukucken!
<br>
<br>

<?php module_tail();?>
