<?php module_head("Neues 1999");?>
<b>27. Dezember 1999</b> - <a href="mailto:alexis at abc.cap.ru">Alexis Mikhailov</a> hat einen Patch ver&ouml;ffentlicht, der die Nutzung von ht://dig als Suchmaschine erm&ouml;glicht. Dieser <a href="ftp://fara.cs.uni-potsdam.de/incoming/SearchEnginePatch.diff">Patch</a> wurde von CoSource gesponsort.
<br>
<br>

<b>12. Dezember 1999</b> - <a href="mailto:andi at europe.de">Andreas Richter</a> hat ein Bin&auml;rpaket des KDE Development Kits f&uuml;r FreeBSD 3.x ver&ouml;ffentlicht. Dieses enth&auml;lt KDevelop, KDbg, KTranslator und einige andere Werkzeuge und kann <a href="ftp://129.187.206.68/pub/unix/ide/KDevelop/binaries/FreeBSD/kdk-1.0-freebsdx86.tar.gz">hier</a> heruntergeladen werden.
<br>
<br>

<b>9. Dezember 1999</b> - Neue Bin&auml;rpakete sind auf unseren FTP-Servern verf&uuml;gbar. Jetzt finden Sie dort die RPMs f&uuml;r SuSE, RedHat, Debian und Unixware. Weitere werden bald folgen, wenn Sie uns dabei behilflich sind ;-).
<br>
<br>

<b>8. Dezember 1999</b> - Heute wurden zwei Links zur Seite der <a href="index.html?filename=links_tools.html">Entwicklungswerkzeuge</a> hinzugef&uuml;gt:<br>
Der erste zeigt auf die QPL-lizensierte <b>Moonshine QPL</b>, der zweite auf die <b>QextMDI-Bibliothek</b>, die es Ihnen erm&ouml;glicht, MDI-Anwendungen zu erstellen. Das ist cool genug, dass es den Weg in den HEAD-Bereich schafft.<br>
Au&szlig;erdem habe ich einige kleine Fehler der Homepage ausgebessert.
<br>
<br>

<b>6. Dezember 1999</b> - Freigabe von <b>KDevelop 1.0</b> und dem <b>KDE Development Kit</b><br>
Wir freuen uns, ank&uuml;ndigen zu d&uuml;rfen, dass wir die Version 1.0 endlich fertiggestellt haben. Als Weihnachtsgeschenk f&uuml;r Sie :-) haben wir das KDK gebaut, um Ihnen das KDE-Entwicklerleben etwas zu vereinfachen.
<br>
<?php if (isset($design) and $design=="theme0") {
echo "<br>PS: Vergessen Sie nicht auf den
<a href=\"index.html?filename=$filename&amp;design=theme1&amp;ch_log=$ch_log\"><b>Grafikmodus</b></a>
zu klicken ... f&uuml;r einen Moment Magie :-)<br>";
} ?>
<br>

<b>30. November 1999</b> - John Birch hat seinen gro&szlig;artigen
<a HREF="http://homepages.ihug.co.nz/~jbb/">Debugger-Patch</a> f&uuml;r KDevelop erneuert.
<br>
<br>

<b>25. November 1999</b> - <a href="mailto:RolandSchaefer at gmx.net">Roland Sch&auml;fer</a> und
<a href="mailto:chcouder at club-internet.fr">Christian Couder</a> haben einen Patch f&uuml;r das Anzeigen von Lesezeichen-Icons ver&oouml;ffentlicht.
<a href="ftp://fara.cs.uni-potsdam.de/incoming/ShowBookmarks.tar.gz">Hier</a> ist er.
<br>
<br>

<b>21. November 1999</b> - Ein Bereich <a href="index.html?filename=bugs.html">
"Fehler &amp; Anregungen"</a> wurde zur Webseite hinzugef&uuml;gt. Die Informationen &uuml;ber in Arbeit Befindliches ist zur Zeit Quatsch, aber Sie k&ouml;nnen dabei helfen, es zu aktualisieren, indem Sie uns <a href="mailto:smeier at rz.uni-potsdam.de,
chcouder at club-internet">eine Mitteilung schicken</a>.
<br>
<br>

<b>15. November 1999</b> - Ian Reinhart Geiser hat die erste Version seines <a href="http://www.msoe.edu/~geiseri/projects.phtml?project=Kpp">Kpp</a> (KDevelop Project nach SPEC-File-Konverter) ver&ouml;ffentlicht.
<br>
<br>

<b>13. November 1999</b> - <a href="mailto:chcouder at club-internet.fr">Christian Couder</a> hat das "Auskommentieren/Nicht auskommentieren" von Quelltext-Bl&ouml;cken implementiert. Sie k&ouml;nnen den Patch <a href="ftp://129.187.206.68/pub/unix/ide/KDevelop/patches/commentfeaturediff">hier</a> herunterladen.
<br>
<br>

<b>9. November 1999</b> - Ein KDevelop-<a href="ftp://ftp.e-technik.fh-muenchen.de/pub/unix/ide/KDevelop/binaries" >Bin&auml;rpaket</a> f&uuml;r FreeBSD ist nun verf&uuml;gbar. Dank an <a href="mailto:andi at europe.de">Andreas Richter</a>.
<br>
<br>

<b>8. November 1999</b> - Die <a href="ftp://ftp.e-technik.fh-muenchen.de/pub/unix/ide/KDevelop/documenation/" >Dokumentation</a> ist nun im PDF-Format verf&uuml;gbar. Dank an Kenny G. Dubuisson
<br>
<br>

<b>3. November 1999</b> - <a href="http://members.nextra.at/johsixt//kdbg.html">KDbg 1.0final</a> freigegeben.
<br>
<br>

<b>31. Oktober 1999</b> - Visual Developer ver&ouml;ffentlichte einen <a HREF="http://www.visual-developer.com/features/features.cfm">Artikel</a> &uuml;ber KDevelop- und KDE-Programmierung.
<br>
<br>

<b>31. Oktober 1999</b> - John Birch hat seinen <a HREF="http://homepages.ihug.co.nz/~jbb/">Debugger-Patch</a> f&uuml;r KDevelop erneuert. Diese Version beherrscht nun zus&auml;tzlich die &Uuml;berwachung von Variablen, Programmstatus und Fehlerbereinigungen.
<br>
<br>

<b>31. Oktober 1999</b> - Wir haben KDevelop1.0Beta4.1-Bin&auml;rpakete f&uuml;r Mandrake 6.1, SuSE 6.2 und Debian 2.2 erhalten. Hui, das ging schnell! :-)
<br>
<br>

<b>30. Oktober 1999</b> - <b>KDevelop 1.0Beta4.1 freigegeben</b>, diese Version behebt einige Probleme der Beta4. Entschuldigt das bitte. Wenn Sie die Beta4 bereits haben, laden Sie den <a HREF="ftp://fara.cs.uni-potsdam.de/pub/kdevelop/kdevelop-1.0beta4.1diff.tar.gz">Patch</a> herunter.
<br>
<br>

<b>29. Oktober 1999</b> - Richard Dale hat seinen Objective-C-Patch f&uuml;r KDevelop erneuert. Sie k&ouml;nnen ihn <a HREF="ftp://129.187.206.68/pub/unix/ide/KDevelop/patches/kdeobjc.tar.gz">hier</a> herunterladen.
<br>
<br>

<b>29. Oktober 1999</b> - Wir haben KDevelop1.0Beta4-<a HREF="ftp://ftp.e-technik.fh-muenchen.de/pub/unix/ide/KDevelop/binaries/">Bin&auml;rpakete</a> f&uuml;r SuSE 6.2, RedHat 6.x und Mandrake 6.1 erhalten. Einige &auml;ltere Versionen sind zus&auml;tzlich f&uuml;r UnixWare, FreeBSD, LinuxPPC, Solaris usw. vorhanden. Danke allen Packern!
<br>
<br>

<b>27. Oktober 1999</b> - <b>KDevelop 1.0Beta4 freigegeben</b>, diese Version enth&auml;lt viele wichtige Fehlerbereinigungen, einen verbesserten Klassenparser und &Uuml;bersetzungen in 16 Sprachen.
<br>
<br>

<b>25. Oktober 1999</b> - KDevelop-Bin&auml;rpakete f&uuml;r Solaris 2.5/2.6 und 7 sind nun bei <a href="http://www.freeware4sun.com/kde/2.6/index.html">www.freeware4sun.com</a> verf&uuml;gbar.
<br>
<br>

<b>11. Oktober 1999</b> - "Made with KDevelop" von Jacek Wojdel hinzugef&uuml;gt.
<br>
<br>

<b>8. Oktober 1999</b> - KDevelop-Interview im <a href="http://www.kde-forum.org">KDE-Forum</a>
<br>
<br>

<b>29. September 1999</b> - "Plugins &amp; Patches" Bereich hinzugef&uuml;gt.
<br>
<br>

<b>28. September 1999</b> - <a href="http://members.nextra.at/johsixt//kdbg.html">KDbg 1.0 Beta 3</a> freigegeben.
<br>
<br>

<b>24. September 1999</b> - <b>KDevelop 1.0Beta3 freigegeben</b>
<br>
<br>

<b>16. September 1999</b> - <a href="mailto:jbb at ihug.co.nz">John Birch</a> hat den ersten Patch ver&ouml;ffentlicht, der einen Debugger in KDevelop integriert. Mehr Informationen dazu gibt es auf <a href="http://homepages.ihug.co.nz/~jbb/">Johns Homepage</a>
<br>
<br>

<b>7. September 1999</b> - KDevelop-Paket f&uuml;r Caldera auf dem <a href="ftp://altair.dhs.org/pub/kdevelop/">altair.dhs.org</a>-Spiegelserver. Danke an Charles Samuels.
<br>
<br>

<b>3. September 1999</b> - Verweise zu Paketen f&uuml;r Suse, RedHat und Debian hinzugef&uuml;gt. Danke an alle Paketbetreuer!
<br>
<br>

<b>30. August 1999</b> - Neue Rubrik "Users" hinzugef&uuml;gt
<br>
<br>

<b>23. August 1999</b> - <a href="http://members.telecom.at/~johsixt/kdbg.html">KDbg 1.0 Beta 2</a> freigegeben.
<br>
<br>

<b>23. August 1999</b> - KDevelop 1.0Beta2 freigegeben.
<br>
<br>

<b>19. August 1999</b> - Witold 'Ortodox' Dbrowski <a href="http://lists.kde.org/?l=kde-kdevelop&amp;m=93495855029309&amp;w=2">beschreibt</a>, wie man KDevelop auf FreeBSD kompiliert.
<br>
<br>

<b>16. August 1999</b> - Dokumentation der KDE-Bibliotheken mit kdoc erstellt und zum Downloadbereich hinzugef&uuml;gt.
<br>
<br>

<b>12. August 1999</b> - Neuen Spiegelserver zum herunterladen hinzugef&uuml;gt. Danke an Charles Samuels.
<br>
<br>

<b>09. August 1999</b> - Rod Roark <a href="http://www.sunsetsystems.com/tip-kdevelop.html">beschreibt</a> die vollst&auml;ndige Installation von KDevelop auf RedHat 6.0. Danke!
<br>
<br>

<b>08. August 1999</b> - Neuen Spiegelserver zum herunterladen hinzugef&uuml;gt. Danke an Antonin Sprinzl.
<br>
<br>

<b>04. August 1999</b> - <a href="http://members.telecom.at/~johsixt/kdbg.html">KDbg 1.0 Beta 1</a> freigegeben.
<br>
<br>

<b>03. August 1999</b> - RPM-Bin&auml;rpakete f&uuml;r Suse und RedHat zum Downloadbereich hinzugef&uuml;gt.
<br>
<br>

<b>02. August 1999</b> - Die erste Beta-Version ist nun verf&uuml;gber. Lesen Sie die <a href="index.html?filename=1.3/pressrelease1.0.html">Pressemitteilungen</a> f&uumlr; weitere Informationen!
<br>
<br>

<b>28. July 1999</b> - Wir haben jetzt ein Mailarchiv mit Suchfunktion bei
<a href="http://lists.kde.org/?l=kde-kdevelop&amp;r=1&amp;w=2">lists.kde.org</a>.
Danke an Hank Leininger.
<br>
<br>

<b>23. July 1999</b> - Neuen Spiegelserver zum herunterladen hinzugef&uuml;gt. Danke an Daniel Schuler.
<br>
<br>

<b>20. July 1999</b> - KDevelop feiert seinen ersten Geburtstag.
<br>
<br>

<b>15. July 1999</b> - Es gibt nun ein &Uuml;bersetzung-HOWTO. Schauen Sie auf die "i18n"-Seite.
<br>
<br>

<b>14. July 1999</b> - Wir brauchen &Uuml;bersetzer f&uuml;r alle Sprachen um die Dokumentation und die Anwendung bis zur Fertigstellung von KDE 1.2 zu &uuml;bersetzen. Bitte bei <a href="mailto:martin.piskernig at stuwo.at">Martin Piskernig</a> melden.
<br>
<br>

<b>13. July 1999</b> - Neuen Spiegelserver zum herunterladen hinzugef&uuml;gt. Danke an Dmitry Sivachenko.
<br>
<br>

<b>11. July 1999</b> - KDevelop 4.0-Pakete f&uuml;r Slackware hinzugef&uuml;gt. Danke an <a href="mailto:srecko.grasic at uni-mb.si">Matej GRASIC</a>.
<br>
<br>

<b>05. July 1999</b> - Die KDevelop-Homepage hat eine neue Adresse: <b><a href="http://www.kdevelop.org/">www.kdevelop.org</a></b>
Danke an <a href="mailto:Sascha.Beyer at gecits-eu.com">Sascha Beyer</a> f&uum;r die Bereitstellung der Domain!!!
<br>
<br>

<b>04. July 1999</b> - Postscript-Documentation ins "book"-Format aktualisiert.
<br>
<br>

<b>29. June 1999</b> - Ab jetzt bieten wir t&auml;gliche Snapshots an. Danke an Walter Tasin.
<br>
<br>

<b>23. June 1999</b> - KDevelop 0.4-Pakete f&uuml;r Suse 6.x hinzugef&uuml;gt. Danke an Matthias D&uuml;sterh&ouml;ft (duesti at gmx.de).
<br>
<br>

<b>22. June 1999</b> - KDevelop 0.4-Pakete f&uuml;r Debian hinzugef&uuml;gt.
<br>
<br>

<b>21. June 1999</b> - Neue Version f&uuml;r FreeBSD im Downloadbereich. Danke an Michal Pasternak.
<br>
<br>

<b>18. June 1999</b> - KDevelop-Dokumentation im PostScript-Format hinzugef&uuml;gt.
<br>
<br>

<b>17. June 1999</b> - RPM-Pakete f&uuml;r KDevelop 0.4 hinzugef&uuml;gt. Danke an Troy Engel.
<br>
<br>

<b>15. June 1999</b> - Neuen Spiegelserver zum herunterladen hinzugef&uuml;gt. Danke an Ralf Kayser.
<br>
<br>

<b>14. June 1999</b> - KDevelop 0.4 freigegeben.
<br>
<br>

<b>22. April 1999</b> - Einige Bildschirmfotos der neuen Version hinzugef&uuml;gt.
<br>
<br>

<b>13. April 1999</b> - Kdbg 0.3 und einen neuen Snapshot zum Downloadbereich hinzugef&uuml;gt.
<br>
<br>

<b>30. March 1999</b> - Einige &Auml;nderungen im Downloadbereich.
<br>
<br>

<b>19. March 1999</b> - Es gibt nun einige RPM-Pakete im Downloadbereich. Danke an <a href="mailto:tengel at sonic.net">Troy Engel</a>.
<br>
<br>

<b>10. March 1999</b> - KDevelop 0.3.1 (Alpha) freigegeben. Diese Version dient der Fehlerkorrektur.
<br>
<br>

<b>08. March 1999</b> - KDevelop 0.3 (Alpha) freigegeben.
<br>
<br>

<?php module_tail();?>
