<?php module_head("Neues 2004");?>
<b>23. Dezember 2004</b> - Vierte Ausgabe von KDevelop TechNotes ist bereit.
<br><a href="doc/technotes/navigation.html">Ausgabe 4: Wirkungsvolle Codenavigation</a><br>
<br>
<b>08. Dezember 2004</b> - Die KDevelop 3.1.2 bugfix Version wurde freigegeben. Die 
Änderungen sind im <a href="index.html?filename=3.1/changes.html">Changelog</a>.
Sie können es in der <a href="index.html?filename=3.1/download.html">Download seite </a>downloaden.
Benutzer werden <b>stark geraten</b>, zu dieser Version
zu aktualisieren, weil sie viele Rückbildungwanzen repariert.<br>
Wir regelten auch <b>alle</b> defekten Verbindungen in den 18000 Seiten dieser Web site:)
Genießen Sie es<br>
<br>
<b>05. Dezember 2004</b> - Eine andere Ausgabe von KDevelop TechNotes ist bereit.
<br><a href="doc/technotes/rubyrad.html">Ausgabe 3: Rad mit KDevelop mit Ruby/Qt/KDE</a><br>
<br>
<b>30. November 2004</b> - Erste zwei Ausgaben von KDevelop TechNotes werden auf unserem 
Aufstellungsort veröffentlicht.
<br><a href="doc/technotes/kdevassistant.html">Ausgabe 1: Grasenunterlagen mit KDevAssistant</a>
<br><a href="doc/technotes/cpprad.html">Ausgabe 2: Rad mit KDevelop mit C++/Qt/KDE</a><br>
<br>
<b>04. November 2004</b> - Das Wiki ist wieder funktionst&auml;tig. Es enth&auml;lt Informationen &uuml;ber das Entwickeln und auch &uuml;ber die Zukunft der KDevelop-Plattform.<br>
<br>
<b>18. Oktober 2004</b> - Der PHP5-Apache-Webserver ist wieder online. Damit funktionieren der Online-Chat und die Foren <a href="phorum5/read.php?2,26159">wieder</a>. Das Wiki wird als n&auml;chstes repariert.
<br>
<br>
<b>12. Oktober 2004</b> - Die Version 3.1.1 von KDevelop wurde ver&ouml;ffentlicht. Die &Auml;nderungen im  Vergleich zu Vorg&auml;ngerversion befinden sich im <a href="index.html?filename=3.1/changes.html">Changelog</a>. Sie k&ouml;nnen diese Version auf der <a href="index.html?filename=3.1/download.html">Download-Seite</a> herunterladen.<br>
<br>
<br>
<b>27. September 2004</b> - Wir sind wieder online nach einem Tag Unterbrechung wegen einer defekten Festplatte. Wir haben Daten aus drei Wochen vom Forum und der Wiki-Datenbank verloren und einige Teile der Webseite sind noch nicht wieder hergestellt. Bitte habt Geduld, wir stellen eine Nachricht auf die Seite, sobald alle Probleme gel&ouml;st sind.<br>
<br>
<b>14. September 2004</b> - Einige Fotos vom KDevelop-Team (gemacht während des aKademy Weltgipfels) sind auf unserer <a href="index.html?filename=events/akademy2004.html">akademy2004 Ereignisseite</a> zu sehen.<br>
Sie können auch eine <a href="3.1/doc/promo/presentation.kpr">Präsentation</a> herunterladen, die auf der <em>"KDE Users and Administrators conference"</em> gehalten wurde.<br>
<br>
<b>19. August 2004</b> - KDevelop 3.1 wurde zusammen mit KDE 3.3 ver&ouml;ffentlicht.
Bitte beachten Sie die <a href="3.1/announce-kdevelop-3.1.html">offizielle Pressemitteilung</a>,
die &Auml;nderungen k&ouml;nnen Sie im <a href="index.html?filename=3.1/changes.html">Changelog</a> ansehen
und downloaden Sie <a href="index.html?filename=3.1/download.html">Pakete</a>!<br>
<br>
<b>22. Juli 2004</b> - KDevelop 3.1 beta 2 zusammen mit KDE 3.3 beta 2 freigegeben.
Sie können es auf der <a href="index.html?filename=3.1/download.html">Downloadseite</a> herunterladen.<br>
<br>
<b>16. Juli 2004</b> - Es wird einen <a href="http://conference2004.kde.org/tut-kdevelop.php">KDevelop Workshop</a>
am 26. August während des <a href="http://conference2004.kde.org">2004 KDE Community Weltgipfels</a> in Ludwigsburg/Deutschland geben.<br>
Die chinesische Übersetzung der Website wurde dank Kun Xi komplettiert.<br>
<br>
<b>07. Juli 2004</b> - KDevelop 3.1 beta 1 zusammen mit KDE 3.3 beta 1 freigegeben.
Sie können es auf der <a href="index.html?filename=3.1/download.html">Downloadseite</a> herunterladen.<br>
<br>
<b>17. Juni 2004</b> - Die Webseite ist nun komplett in Deutsch, Spanisch, Franz&ouml;sisch, Polnisch, Portugiesisch und Brasilianisch &uuml;bersetzt. Unser Dank geht an die &uuml;bersetzer: Christian Weickhmann, Philipp Wagner, Miguel &Aacute;ngel De Blas B&uacute;rdalo, Alejandro Exojo, Anne-Marie Mahfouf, Marcin Mikolajczyk,
Jo&atilde;o Luis Silva Assun&ccedil;&atilde;o, Amilcar do Carmo Lucas, Eric Jardim and Helio Roberto Santana.<br>
<br>
<b>09. Juni 2004</b> - KDevelop 3.0.4 zusammen mit KDE 3.2.3 freigegeben.
Die &Auml;nderungen befinden sich im <a href="index.html?filename=3.0/changes.html">Changelog</a>.
Sie k&ouml;nnen die neue Version auf unserer <a href="index.html?filename=3.0/download.html">Download-Seite</a> herunterladen.
&uuml;bersetzungen in Hindi und Slovienisch wurden hinzugef&uuml;gt.<br>
<br>
<b>02. Mai 2004</b> - Die Webseite funktioniert wieder.
Ein Angriff auf unseren Apache Webserver verursachte einen 8-t&auml;gigen Ausfall.
Wir haben jetzt neue Hardware, drei Mal schneller als die alte, unter SuSE 9.0.
Au&szlig;erdem haben wir unserer Downloadseite viele neue Bin&auml;rpakete hinzugef&uuml;gt und 
bieten bessere Informationen f&uuml;r die &Uuml;bersetzer.<br>
<br>
<b>19. April 2004</b> - KDevelop 3.0.3 zusammen mit KDE 3.2.2 ver&ouml;ffentlicht.
Die &Auml;nderungen befinden sich im <a href="index.html?filename=3.0/changes.html">Changelog</a>.
Sie k&ouml;nnen die neue Version auf unserer <a href="index.html?filename=3.0/download.html">Download-Seite</a> herunterladen.
Diese Version wurde vollst&auml;ndig in folgende Sprachen &uuml;bersetzt: d&auml;nisch, deutsch, britisches englisch, spanisch, estisch, franz&ouml;sisch, ungarisch, italienisch, brasilianisches portugiesisch, serbisch und schwedisch.
Und zu mehr als 87 Prozent in: katalanisch, japanisch, niederl&auml;ndisch, russisch, tamilisch und vereinfachtes chinesisch.<br>
<br>
<b>22. M&auml;rz 2004</b> - Wir haben einen neuen Spanisch-&Uuml;bersetzer, Miguel Angel De Blas Burdalo, willkommen im Team.<br>
<br>
<b>13. M&auml;rz 2004</b> - Wir haben einen neuen Deutsch-&Uuml;bersetzer, Philipp Wagner, willkommen im Team. Wir haben eine alte &Uuml;bersetzung in brasilianisches portugiesisch gefunden, aber wir ben&ouml;tigen weiterhin alle Dateien im 3.0 Verzeichnis. Deshalb sind wir weiterhin auf der Suche nach einem &Uuml;bersetzer f&uuml;r brasilianisches portugiesisch.<br>
<br>
<b>10. M&auml;rz 2004</b> - Nachdem das neue Seitendesign jetzt fertig ist, suchen wir 
freiwillige &Uuml;bersetzer die diese Seiten in brasilianisches portugiesisch, spanisch und 
deutsch &uuml;bersetzen. Falls Sie Lust und Zeit haben, setzen Sie sich bitte mit dem Webmaster 
in Verbindung (die Adresse befindet sich am Ende dieser Seite)<br>
<br>
<b>09. M&auml;rz 2004</b> - KDevelop 3.0.2 wurde zusammen mit KDE 3.2.1 ver&ouml;ffentlicht. Die
&Auml;nderungen sind im <a href="index.html?filename=3.0/changes.html">Changelog</a> festgehalten.
Sie k&ouml;nnen auf der <a href="index.html?filename=3.0/download.html">Downloadseite</a> 
herunterladen.<br>
<br>
<b>06. M&auml;rz 2004</b> - Gro&szlig;e Design-Umstellung. Die Webseite spielt eine bedeutende
Rolle in <a href="HEAD/doc/api/html/architecture.html#devteammodel">KDevelop's Entwicklungs-Infrastruktur</a>. Das Hauptziel war f&uuml;r die verschiedenen Versionen
verschiedene Seiten bereitstellen zu k&ouml;nnen. Das erm&ouml;glicht es uns, zwischen der
aktuellen <a href="index.html?filename=3.0/kdevelop.html">stabilen Version</a> (3.0.x) and den 
Entwicklungsversionen (HEAD) von KDevelop zu unterscheiden..<br>
Das hatte einige <i>Nebeneffekte</i>: wiedergefundene Informationen &uuml;ber das alte 
<a href="index.html?filename=1.3/kdevelop.html">KDevelop-1.x</a>, 
<a href="http://www.w3.org/">W3C</a> HTML Kompaktibilit&auml;t, reparierte tote Links, mehr
CSS-Einsatz, Benutzer k&ouml;nnen zwischen vier CSS Stilen entscheiden, Google Webseiten-Suche, 
und letztendlich, ein neues Aussehen. Ich hoffe es gef&auml;llt Ihnen - Amilcar Lucas.<br><br>
<b>16. Februar 2004</b> - KDevelop 3.0.1 wurde ver&ouml;ffentlicht. Die &Auml;nderungen 
k&ouml;nnen Sie im <a href="index.html?filename=3.0/changes.html">Changelog</a> ansehen.
Sie k&ouml;nnen die neue Version auf unserer <a href="index.html?filename=3.0/download.html">Download Seite</a> herunterladen.<br><br>
<b>03. Februar 2004</b> - KDevelop 3.0 wurde zusammen mit KDE 3.2 ver&ouml;ffentlicht. Bitte 
beachten Sie die <a href="3.0/announce-kdevelop-3.0.html">offizielle Pressemitteilung</a> und 
downloaden Sie <a href="index.html?filename=3.0/download.html">Pakete</a>!<br><br>
<b>28. Januar 2004</b> - Die Entwicklung 
<a href="index.html?filename=3.0/changes.html">geht weiter</a>! Und wir haben einen brandneuen 
<a href="3.0/doc/promo/kdevelop.pdf">KDevelop 3.0 Flyer</a>. Unser Dank geht an <a href="http://www.sourcextreme.com/">SourceXtreme</a>.<br><br>
<b>21. Januar 2004</b> - KDevelop hat den 
<a href="http://www.linuxworldexpo.com/linuxworldny/V40/index.cvn?ID=10240">Best Development Tool</a> <i>Product Excellence Award</i> von der <a href="http://www.linuxworldexpo.com">Linuxworld New York 2004 Konferenz &amp; Ausstellung</a> erhalten.<br><br>
<b>19. Januar 2004</b> - Die erste Vorabversion (Release Candidate 1) von KDevelop 3.0.0 ist da.
Die &Auml;nderungen finden Sie im <a href="index.html?filename=3.0/changes.html">Changelog</a>. 
Die neue Version k&ouml;nnen Sie von unserer <a href="index.html?filename=3.0/download.html">Downloadseite</a> herunterladen.<br><br>
<b>14. Januar 2004</b> - KDevelop kam in die <a href="http://www.linuxworldexpo.com/linuxworldny/V40/">Endrunde f&uuml;r die besten Entwicklungswerkzeuge</a>
bei den "Product Excellence Awards" der LinuxWorld Konferenz und Ausstellung.<br><br>
<b>13. Januar 2004</b> - <a href="http://docs.kde.org/kde3/en/kdevelop/kde_app_devel/">Mehr</a> <a href="http://docs.kde.org/kde3/en/kdevelop/kdearch/">Dokumentation</a> wir jetzt automatisch aus dem KDevelop CVS erstellt. Unser Dank geht an Lauri Watts vom Internationalisierungs-Team.<br><br>
<b>09. Januar 2004</b> - Die Problem mit der Online API Dokumentation wurde behoben.<br><br>
<b>07. Januar 2004</b> - Die Online API Dokumentation funktioniert derzeit nicht. Wir hoffen den Fehler innerhalb der n&auml;chsten Tage beheben zu k&ouml;nnen.<br><br>
<b>03. Januar 2004</b> - Alle Webseiteninhalte wurden aktualisiert. Wir bedanken uns bei Alexander Dymo.<br><br>
<?php module_tail();?>
