<?php module_head("&Icirc;nterb&#259;ri frecvente KDevelop $k_series_version (F.A.Q.)");?>
<b>General questions</b><br>
<ul>
<li><a href="#36"> De unde ob&#x163;in KDEvelop? Cum &icirc;l instalez?</a></li>
<li><a href="#37"> Pot dezvolta aplica&#x163;ii comerciale cu KDevelop?</a></li>
<li><a href="#137"> Pot dezvolta plugin-uri comerciale cu KDevelop?</a></li>
<li><a href="#45"> Am compilat &#x15F;i instalat KDevelop 3.0 dar v&#259;d numai meniurile Fi&#x15F;ier (File) &#x15F;i Ajutor (Help)</a></li>
<li><a href="#100">Cum se poate crea un proiect simplu pornind numai de la un fi&#x15F;ier Makefile (&icirc;n alte cuvinte <em>Proiect Customizat</em>) ?</a></li>
</ul>
<b>&Icirc;ntreb&#259;ri despre KDevelop IDE</b><br>
<ul>
<li><a href="#102">Cum creez Fi&#x15F;iere Noi &icirc;ntr-un Proiect?</a></li>
<li><a href="#103">Cum adaug fi&#x15F;iere deja existente la un Proiect?</a></li>
<li><a href="#104">Cum &#x15F;terg un Fi&#x15F;ier indtr-un Proiect?</a></li>
<li><a href="#38">Cum schimb &icirc;ntre fi&#x15F;ierele deschise utiliz&acirc;nd numai tastatura?</a></li>
<li><a href="#39">Pot introduce text &icirc;n timpul depan&#259;rii unei aplica&#x163;ii consol&#259;?</a></li>
<li><a href="#40">Cum activez completarea de cod (code completion) pentru biblioteci externe?</a></li>
</ul>
<b>Probleme la compilare &#x15F;i depanare</b>
<ul>
<li>sctript-ul de configurare
<br>
<ul>
<li><a href="#3"> Script-ul de configurare nu g&#259;ses_te biblioteca mea Qt.
</a></li>
</ul>
</li>
<li>configure.in.in
<br>
<ul>
<li><a href="#12"> configure.in.in nu are nici un test AC_CHECK_COMPILERS(). Unde s&#259; pun CXXFLAGS="$CXXFLAGS $USE_EXCEPTIONS" men&#x163;ionat mai sus?</a></li>
<li><a href="#25"> &Icirc;n &icirc;ntreb&#259;rile de mai sus v&#259;d tot timpul "configure.in(.in)". Am ambele fi&#x15F;iere &icirc;n proiect. Care fi&#x15F;ier ar trebui ataptat?</a></li>
<li><a href="#21"> De ce fix&acirc;nd configure.in(.in) cu CXXFLAGS="$USE_EXCEPTIONS $CXXFLAGS" nu merge?</a></li>
<li><a href="#22"> Eu am CXXFLAGS="$USE_EXCEPTIONS" &icirc;n configure.in(.in) &#x15F;i merge bine, de ce a&#x15F; folosi solu&#x163;ia voastr&#259;?</a></li>
</ul>
</li>
<li>Makefile.am
<br>
<ul>
<li><a href="#17"> Care este diferen&#x163;a &icirc;ntre CPPFLAGS &#x15F;i CXXFLAGS?
</a></li>
<li><a href="#18"> Am v&#259;zut unele solu&#x163;ii ca de exemplu fixarea fi&#x15F;ierului Makefile.am cu
     DEFS+=-DMYDEFINE
   sau
     CXXFLAGS+=-fsigned-char
   sau
     LD_FLAGS+=-L/usr/local/lib
   De ce nu le lua&#x163;i &icirc;n considerare?
</a></li>
<li><a href="#20"> Pot AM_CXXFLAGS (&icirc;ntr-un Makefile.am) fi utilizate pentru op&#x163;iuni ca -frtti sau -fexceptions?</a></li>
</ul>
</li>
<li>htdig
<br>
<ul>
<li><a href="#29"> Am instalat htdig dar acum este htsearch disponibil?
</a></li>
<li><a href="#30"> Am htdig, htmerge &#x15F;i htsearch disponibile dar ob&#x163;in un mesaj de eroare c&#259; fi&#x15F;ierul de configurare al htdig nu poate fi g&#259;sit sau este invalid?
</a></li>
</ul>
</li>
<li>automake, autoconf
<br>
<ul>
<li><a href="#19"> Cum pot fi sigur ca un utilizator al proiectului meu &icirc;l va construi folosing automake versiunea 1.4?</a></li>
</ul>
<ul>
<li><a href="#105">Ce pot face dac&#259; proiectul nu poate fi construit din nou dup&#259; schimbarea destina&#x163;iei de la/c&#259;tre cea implicit&#259;?</a></li>
<li><a href="#106">Erori "Versiune gre&#x15F;it&#259; a autoconf" etc..</a></li>
<li><a href="#59"> Am ad&#259;ugat in subproiect existent la proiectul meu &#x15F;i nu &icirc;l mai pot construi.
</a></li>
</ul>
</li>
<li>rtti, informa&#x163;ii de tipul run-time (la momentul execu&#x163;iei)
<br>
<ul>
<li><a href="#13"> Dezvolt o aplica&#x163;ie care necesit&#259; informa&#x163;ii de tipul run-time complilate. Cum pot s&#259; fac acest lucru?
</a></li>
</ul>
</li>
<li>TrollTech's Designer &#x15F;i KDevelop
<br>
<ul>
<li><a href="#28"> Exist&#259; vre-un HOWTO disponibil despre cum s&#259; lucrez cu dialog-uri create cu QT designer?
</a></li>
</ul>
</li>
<li>altele
<br>
<ul>
<li><a href="#101">De ce nu pot vedea mesajele de eroare la compilare?</a></li>
<li><a href="#8"> Fixarea configure/Makefile/Makefile.in/config.h nu ajut&#259;, dup&#259; pornirea autoconf/automake/autoheader scumb&#259;rile mele sunt pierdute. Unde are trebui s&#259; schimb?</a></li>
<li><a href="#9"> Dezvolt o aplica&#x163;ie &#x15F;i am nevoie s&#259; setez op&#x163;iuni -D la preprocessor.Dac&#259; le adaug &icirc;n KDevelop la op&#x163;iunile proiectului, totul este &icirc;n regul&#259;. dar c&acirc;nd distribui arhiva, op&#x163;iunile setate &icirc;n KDevelop nu sunt utilizate. Ce pot face s&#259; ob&#x163;in resultatele dorite?</a></li>
<li><a href="#10"> Exist&#259; o alta posibilitate de a-mi face publice propriile defini&#x163;ii?</a></li>
<li><a href="#11"> Dezvolt o aplica&#x163;ie care necesit&#259; tratarea excep&#x163;iilor. Cum o pot face?</a></li>
<li><a href="#16"> Toate solu&#x163;iile prezentate sunt interesante, dar eu vreau asta numai pentru un sub-director specific (de exemplu o bibliotec&#259; static&#259; &icirc;n proiectul meu). Cum pot face acest lucru?</a></li>
<li><a href="#23"> Eu utilizez fi&#x15F;iere header &#x15F;i biblioteci adi&#x163;ionale pentru proiectul meu KDE/QT. Ad&#259;ug&acirc;nd  -I/usr/include/foo &icirc;n op&#x163;iunuile compilatorului &#x15F;i -L/usr/lib/foo la op&#x163;iunile linker-ului nu vor distribui set&#259;rile la arhiva (tarball). Ce am de f&#259;cut?</a></li>
</ul>
</li>
</ul>
<br>

<a name="36"><b> De unde ob&#x163;in KDEvelop? Cum &icirc;l instalez?</b></a><br>
Echipa KDevelop nu face disponibile versiuni binare de KDevelop (RPM-uri).
RPM-uri pot fi g&#259;site la server-ul distribuitorului sau in subdirectoarele corespunz&#259;toare a <a href="ftp://ftp.kde.org/pub/">ftp.kde.org</a> sau a uneia din <a href="http://www.kde.org/ftpmirrors.html">mirror-uri</a><br>
Uita&#x163;i-v&#259; la <a href="index.html?filename=<?php echo $k_base_version; ?>/download.html">pagina noastr&#259; de download</a> pentru informa&#x163;ii privitoare la download-ul &#x15F;i compilarea codului surs&#259;.<br>
<br>
<br>
<a name="37"><b> Pot dezvolta aplica&#x163;ii comerciale cu KDevelop?</b></a><br>
Oricine este liber s&#259; utilizeze KDevelop. Codul generat poate fi pus sub orice licen&#x163;&#259; dori&#x163;i. Ca urmare, generatorul de proiecte con&#x163;ine c&acirc;mpuri pentru ad&#259;ugarea propriilor informa&#x163;ii privitoare la drepturile de copiere ale fi&#x15F;ierelor generate, dar pentru a simplifica lucrurile &#x15F;i a avea un exemplu, licen&#x163;a implicit&#259; este GPL. Deci pute&#x163;i ad&#259;uga licen&#x163;a dvs. aici.<br>

C&acirc;nd vine vorba de editarea etc. a programului dvs., utilizarea KDevelop este echivalent&#259; cu folosirea oric&#259;rui alt editor, este un program ce este GPL si este f&#259;cut pentru a fi utilizat &#x15F;i nu are implica&#x163;ii referitoare la scopul utiliz&#259;rii. Deci pute&#x163;i scrie software comercial/inchis &icirc;n ciuda faptului c&#259; KDevelop &icirc;n sine este GPL.<br>

Referitor la utilizarea func&#x163;iilor KDE sou orice alle lucruri "free software", trebuie s&#259; fi&#x163;i atent(&#259;) la notele de licen&#x163;a ale bibliotecilor pe care le ve&#x163;i folosi. Deci, pentru dezvoltare de aplica&#x163;ii comerciale Qt/KDE ve&#x163;i avea nevoie doar de o licen&#x163;&#259; profesional&#259; de la Trolltech. bibliotecile KDE sunt LGPL, ceea ce &icirc;nseamn&#259; c&#259; pute&#x163;i utiliza func&#x163;iile &#x15F;i lega programul dvs. la aceste biblioteci. Acestea &icirc;ncorporeaz&#259; bibliotecile apar&#x163;in&acirc;nd kdelibs, kdebase (nonqueror, kcontrol etc.) &#x15F;i bibliotecile koffice (pentru crearea de aplica&#x163;ii koffice).<br>
Pentru mai multe informat_'ii vizita&#x163;i <a href="1.3/doc/programming/index-16.html">Licen&#x163;ierea KDevelop</a><br>
<br>
<br>
<a name="137"><b> Pot dezvolta plugin-uri comerciale cu KDevelop?</b></a><br>
KDevelop include o bibliotec&#259; libkdeveloplgpl.so pentru a permite dezvoltarea de plugin-uri comerciale. Aceast&#259; bibliotec&#259; inclure interfe&#x163;e KDevelop interfaces &#x15F;i func&#x163;ii utilitare publicate sub licen&#x163;&#259; LGPL. Dac&#259; ave&#x163;i o licen&#x163;&#259; profesional&#259; de la Trolltech, pute&#x163;i lega codul dvs. la libkdeveloplgpl &#x15F;i publica sub orice licen&#x163;&#259;.<br>
<br>
<br>
<a name="45"><b> Am compilat &#x15F;i instalat KDevelop 3.0 dar v&#259;d numai meniurile Fi&#x15F;ier (File) &#x15F;i Ajutor (Help)</b></a><br>
Ca orice alt&#259; compilare a unei aplica&#x163;ii KDE, trebuie s&#259; v&#259; asigura&#x163;i c&#259; plugin-urile KDevelop sunt recunoscute de KDE. Le pute&#x163;i instala &icirc;n directorul dvs. KDE (de exemplu cu comanda configure --prefix=/opt/kde3) sau ad&#259;uga&#x163;i calea director a KDevelop la variabila sistem KDEDIRS &#x15F;i rula&#x163;i din nou"kbuildsycoca". Un exemplu de linie de comand&#259; pentru bash (presupun&acirc;nd c&#259; KDevelop este instalat &icirc;n /home/harry/kdevelop):<br>
<tt>export KDEDIRS=/home/harry/kdevelop:$KDEDIRS &amp;&amp; kbuildsycoca</tt><br>
<br>
<br>
<a name="38"><b> Cum schimb &icirc;ntre fi&#x15F;ierele deschise utiliz&acirc;nd numai tastatura?</b></a><br>
Pute&#x163;i utiliza ALT-Left &#x15F;i ALT-Right pentru a v&#259; duce la fi&#x15F;ierul deschis anterior/urm&#259;tor. Aceste taste pot fi configurate &icirc;n dialogul de configurare al KDevelop. De asemenea exist&#259; o func&#x163;ie de Deschidere Rapid&#259; (Quick Open) (CTRL-SHIFT-O) pentru a selecta &#x15F;i deschide un fi&#x15F;ier &icirc;n proiect &#x15F;i o func&#x163;ie Schimba La (Switch To) (CTRL-/) ce permite schimbarea la un fi&#x15F;ier deschis prin tip&#259;rirea primelor caractere din name.<br>
<br>
<br>
<a name="39"><b>Pot introduce text &icirc;n timpul depan&#259;rii unei aplica&#x163;ii consol&#259;?</b></a><br>
Fereastra GDB permite tip&#259;rirea comenzilor dvs..<br>
<br>
<br>
<a name="40"><b>Cum activez completarea de cod (code completion) pentru biblioteci externe?</b></a><br>
Daca ave&#x163;i un proiect C/C++ deschis, &icirc;n meniul <i>Proiect->Set&#259;ri Proiect</i> (Project->Project Settings), &icirc;n dialogul <i>in Optiuni Proiect</i> (Project Options) alege&#x163;i tab-ul <i>Specifice C++</i> (C++ Specific) apoi tab-ul pentru <i>Completare Cod</i> (Code Completion). Ap&#259;sa&#x163;i butonul <i>Adaug&#259; Persistant Class Store</i> (Add Persistant Class Store) &#x15F;i completa&#x163;i ghidul pentru ad&#259;ugare unui nou "Persistant Class Store". Dup&#259; completarea ghidului, asigura&#x163;i-v&#259; c&#259; noul creat depozit este bifat &icirc;n lista de depozite a tab-ului <i>Completare Cod</i>.
<br>
<br>
<a name="3"><b> Script-ul de configurare nu g&#259;ses_te biblioteca mea Qt.</b></a><br>
   Folos&#x163;i iotiunile:<br>
     --with-qt-includes=calea_c&#259;tre_headerele_qt<br>
   and<br>
     --with-qt-libraries=calea_c&#259;tre_biblioteca_qt<br>
   sau seta&#x163;i variabila sistem QTDIR s&#259; indice calea director unde Qt este instalat<br>
   ( "export QTDIR=/cale/c&#259;tre/qt" ).<br>
<br>
<br>
<a name="8"><b> Patching configure/Makefile/Makefile.in/config.h doesn't help, after starting autoconf/automake/autoheader my changes are lost.
   Where should I patch things?</b></a><br>
   There's a list of file, where you may patch things for the autotools.<br>
   Makefile.am, configure.in.in, configure.in (only if there is no configure.in.in)<br>
   [rarely used: acconfig.h, configure.in.mid, configure.in.bot]<br>
<br>
<br>
<a name="9"><b> Dezvolt o aplica&#x163;ie &#x15F;i am nevoie s&#259; setez op&#x163;iuni -D la preprocessor.Dac&#259; le adaug &icirc;n KDevelop la op&#x163;iunile proiectului, totul este &icirc;n regul&#259;. dar c&acirc;nd distribui arhiva, op&#x163;iunile setate &icirc;n KDevelop nu sunt utilizate. Ce pot face s&#259; ob&#x163;in resultatele dorite?</b></a><br>
   Editwaz&#259; fi&#x15F;ierul configure.in(.in) &icirc;n cel mai &icirc;nalt nivel al directorului surs&#259;. Aici, trebuie s&#259; introduce&#x163;i dup&#259; macro-ul AC_CHECK_COMPILERS:<br>
     CPPFLAGS="$CPPFLAGS -DMYDEFINE"<br>
   Dup&#259; aceea trebuie s&#259; recrea&#x163;i un nou "configure" cu comanda "make -f Makefile.dist" &#x15F;i apoi s&#259; executa&#x163;i din nou script-ul de configurare.<br>
<br>
<br>
<a name="10"><b> Exist&#259; o alta posibilitate de a-mi face publice propriile defini&#x163;ii?</b></a><br>
   Alt&#259; posibilitate de a include DEFINE-uri &icirc;n proiect este de a le face publice via config.h. Pentru aceasta, terbuie s&#259; modifica&#x163;i urm&#259;toarele fi&#x15F;iere:<br>
   Ad&#259;uga&#x163;i la acconfig.h &icirc;n directorul principal al proiectului urm&#259;toarea linie:<br>
     #undef MYDEFINE<br>
<br>
   &#x15F;i insera&#x163;i &icirc;n configure.in(.in), dup&#259; apelul macro AC_CONFIG_HEADER(config.h):<br>
     AC_DEFINE_UNQUOTED(MYDEFINE)<br>
<br>
   (Deci va fi definit &icirc;n config.h dup&#259; reactualizarea proiectului via "make -f Makefile.dist; configure [op&#x163;iunile dvs.]".<br>
<br>
   Cerin&#x163;ele pentru acest&#259; solu&#x163;ie sunt::<br>
     AC_CONFIG_HEADER(config.h)<br>
   &icirc;n configure.in(.in) &#x15F; &icirc;n codul surs&#259; un set<br>
     #ifdef HAVE_CONFIG_H<br>
     #include &#060;config.h&#062;<br>
     #endif<br>
   &icirc;nainte de orice alt&#259; comand&#259; de includere (&icirc;n mod normal aceast&#259; opera&#x163;ie este automatizat&#259; &icirc;n template-urile noastre de proiect).<br>
<br>
   Not&#259;: Un avantaj al acestei solu&#x163;ii este ilustrat prin facerea MYDEFINE dependent de situa&#x163;ii specifice (ce de exemplu crearea unei op&#x163;iuni pentru configurare). Aceasta necesit&#259; bine&acirc;n&#x163;eles s&#259; v&#259; scrie&#x163;i propria func&#x163;ie macro.<br>
<br>
<br>
<a name="11"><b> Dezvolt o aplica&#x163;ie care necesit&#259; tratarea excep&#x163;iilor. Cum o pot face?</b></a><br>
   Edita&#x163;i fi&#x15F;ierul configure.in(.in) &icirc;n directorul r&#259;d&#259;cin&#259; al surselor. Aici, terbuie s&#259; introduce&#x163;i dup&#259; macro-ul AC_CHECK_COMPILERS():<br>
     CXXFLAGS="$CXXFLAGS $USE_EXCEPTIONS"<br>
   Dup&#259; aceea trebuie s&#259; crea&#x163;i din nou "configure" cu comanda "make -f Makefile.dist" &icirc;n directorul r&#259;d&#259;cin&#259; al surselor &#x15F;i s&#259; restarta&#x163;i script-ul de configurare.<br>
<br>
<br>
<a name="12"><b>configure.in.in nu are nici un test AC_CHECK_COMPILERS(). Unde s&#259; pun CXXFLAGS="$CXXFLAGS $USE_EXCEPTIONS" men&#x163;ionat mai sus?</b></a><br>
   Noile versiuni ale configure.in.in ai fost simplificate. Acum pute&#x163;i ad&#259;uga linia dup&#259; AM_INIT_AUTOMAKE(&#060;nume-arhiv&#259;&#062;,&#060;versiune&#062;).<br>
<br>
<br>
<a name="13"><b> Dezvolt o aplica&#x163;ie care necesit&#259; informa&#x163;ii de tipul run-time complilate. Cum pot s&#259; fac acest lucru?</b></a><br>
   Edita&#x163;i fi&#x15F;ierul onfigure.in(.in)  &icirc;n directorul r&#259;d&#259;cin&#259; al surselor. Aici, terbuie s&#259; introduce&#x163;i dup&#259; macro-ul AC_CHECK_COMPILERS():<br>
     CXXFLAGS="$CXXFLAGS $USE_RTTI"<br>
   Dup&#259; aceea trebuie s&#259; crea&#x163;i din nou "configure" cu comanda "make -f Makefile.dist" &icirc;n directorul r&#259;d&#259;cin&#259; al surselor &#x15F;i s&#259; restarta&#x163;i script-ul de configurare.<br>
<br>
<br>
<a name="16"><b> Toate solu&#x163;iile prezentate sunt interesante, dar eu vreau asta numai pentru un sub-director specific (de exemplu o bibliotec&#259; static&#259; &icirc;n proiectul meu). Cum pot face acest lucru?</b></a><br>
   Edita&#x163;i fi&#x15F;ierul Makefile.am &icirc;n directorul surs&#259; dorit. Aici, trebuie s&#259; introduce&#x163;i undeva &icirc;n afara p&#259;r&#x163;ii specifice KDevelop:<br>
     KDE_CXXFLAGS=$(USE_EXCEPTIONS)<br>
   Aten&#x163;ie la faptul c&#259; aceast&#259; solu&#x163;ie este valabil&#259; numai dac&#259; proiectul dvs. utilizeaz&#259; am_edit.(Func&#x163;ioneaz&#259; numai pentru acinclude.m4 mai noi &amp; am_edit, din c&acirc;te stim trebuie s&#259; fie mai recente de 12-09-1999, &icirc;n trecut era cunoscut ca APPEND_CXXFLAGS - &icirc;n aceast&#259; versiune de KDevelop, ve&#x163;i g&#259;si versiunea care trebuie.)<br>
<br>
   Trebuie s&#259; actualiza&#x163;i sistemul Makefile ca descris mai sus (make -f Makefile.dist; ./configure [op&#x163;iuni]).<br>
<br>
<br>
<a name="17"><b> Care este diferen&#x163;a &icirc;ntre CPPFLAGS &#x15F;i CXXFLAGS?</b></a><br>
   CPPFLAGS sete utilizat numai pentru defini&#x163;ii (op&#x163;iuni utilizate numai la compilare)<br>
   CXXFLAGS este utilizat pentru op&#x163;iuni ale compilatorului (de exemplu -frtti), care sunt aplicate &#x15F;i la procesul de link-are.<br>
<br>
<br>
<a name="18"><b> Am v&#259;zut unele solu&#x163;ii ca de exemplu fixarea fi&#x15F;ierului Makefile.am cu
     DEFS+=-DMYDEFINE
   sau
     CXXFLAGS+=-fsigned-char
   sau
     LD_FLAGS+=-L/usr/local/lib
   De ce nu le lua&#x163;i &icirc;n considerare?</b></a><br>
   O defec&#x163;iune exist&#259; &icirc;n automake 1.4, care nu adaug&#259; op&#x163;iuni la cele deja existente. Cu aceast&#259; comand&#259; &icirc;n Makefile.am, a&#x163;i &#x15F;terge set&#259;rile existente ale op&#x163;iunii respective.<br>
   Dac&#259; dori&#x163;i aceste op&#x163;iuni numai pentru utilizare &icirc;ntr-un subdirector al proiectului, folosi&#x163;i:<br>
     AM_CPPFLAGS=-DMYDEFINE<br>
   sau<br>
     AM_CXXFLAGS=-fsigned-char<br>
   sau<br>
     AM_LDFLAGS=-L/usr/local/lib<br>
<br>
   Aten&#x163;ie, aceste op&#x163;iuni sunt disponibile public numai &icirc;n automake versiunea 1.4.<br>
<br>
   Pentru a seta o asemenea op&#x163;iune la nivelul &icirc;ntregului proiect, v&#259; rug&#259;m s&#259; modifica&#x163;i configure.in(.in) &icirc;n directorul r&#259;d&#259;cin&#259; al sursei &icirc;n loc.<br>
<br>
<br>
<a name="19"><b> Cum pot fi sigur ca un utilizator al proiectului meu &icirc;l va construi folosing automake versiunea 1.4?</b></a><br>
   Ad&#259;uga&#x163;i la variabila AUTOMAKE_OPTIONS &icirc;n fi&#x15F;ierul Makefile.am aflat &icirc;n directorul r&#259;d&#259;cin&#259; al proictului &#x15F;irul de caractere"1.4". De exemplu:<br>
   AUTOMAKE_OPTIONS = foreign 1.4<br>
<br>
<br>
<a name="59"><b> Am ad&#259;ugat in subproiect existent la proiectul meu &#x15F;i nu &icirc;l mai pot construi.</b></a><br>
  Aceasta se poate &icirc;nt&acirc;mpla c&acirc;nd builddir != topsrcdir. &Icirc;n acest caz, rula&#x163;i "make distclean" &icirc;nainte de a ad&#259;uga subproiectul.<br>
<br>
<br>
<a name="20"><b> Pot AM_CXXFLAGS (&icirc;ntr-un Makefile.am) fi utilizate pentru op&#x163;iuni ca -frtti sau -fexceptions?</b></a><br>
   Nu! I6n aceste cazuti apare o problem&#259; de ordonare. Variabila standard CXXFLAGS f&#259;cut&#259; public&#259; de acinclude.m4.in con&#x163;ine deja un  -fno-rtti (-fno_exceptions).<br>
   Daca a&#x163;i fi aplicat-o la AM_CXXFLAGS, compilatorul ar insera aceste op&#x163;iuni &icirc;nainte de  CXXFLAGS, de exemplu pentru -frtti:<br>
   gpp ... -frtti ... -fno-exceptions -fno-rtti ......<br>
   Deci ultima op&#x163;iune (&icirc;n acest caz, &icirc;nc&#259; -fno-rtti) va fi utilizat&#259;.<br>
   KDE_CXXFLAGS vor fi inserate dup&#259; CXXFLAGS, deci comanda va ar&#259;ta astfel:<br>
   gpp ..... -fno-exceptions -fno-rtti ...... -frtti...<br>
   &#x15F;i voil&#224; func&#x163;ioneaz&#259; corect.<br>
<br>
   Not&#259;: KDE_CXXFLAGS sunt f&#259;cute publice de proiecte care utilizeaz&#259; am_edit &#x15F;i acinclude.m4.<br>
<br>
<br>
<a name="21"><b> De ce fix&acirc;nd configure.in(.in) cu CXXFLAGS="$USE_EXCEPTIONS $CXXFLAGS" nu merge?</b></a><br>
   Uita&#x163;i-v&#259; la r&#259;spunsul la &icirc;ntrebarea "Pot AM_CXXFLAGS (&icirc;ntr-un Makefile.am) fi utilizate pentru op&#x163;iuni ca -frtti sau -fexceptions?" ;-)<br>
<br>
<br>
<a name="22"><b> Eu am CXXFLAGS="$USE_EXCEPTIONS" &icirc;n configure.in(.in) &#x15F;i merge bine, de ce a&#x15F; folosi solu&#x163;ia voastr&#259;?</b></a><br>
   Dac&#259; a&#x163;i folosi versiunea dvs. &icirc;nainte de AC_CHECK_COMPILERS() un apel de genul<br>
     CXXFLAGS="-pedantic" ./configure<br>
   nu ar func&#x163;iona corect.<br>
   Dac&#259; folosi&#x163;i &icirc;nter-adev&#259;r dup&#259; AC_CHECK_COMPILERS(), atunci CXXFLAGS setat &icirc;n AC_CHECK_COMPILERS() va fi "curat".(De exemplu, &icirc;ntr-o comand&#259; "configure --enable-debug" CXXFLAGS va fi alterat s&#259; permit&#259; inserarea de informa&#x163;ie de depanare &icirc;n codul dvs.)<br>
   Deci, v&#259; rug&#259;m s&#259; folosi&#x163;i CXXFLAGS="$CXXFLAGS $USE_EXCEPTIONS" &icirc;n loc.<br>
<br>
<br>
<a name="23"><b> Eu utilizez fi&#x15F;iere header &#x15F;i biblioteci adi&#x163;ionale pentru proiectul meu KDE/QT. Ad&#259;ug&acirc;nd  -I/usr/include/foo &icirc;n op&#x163;iunuile compilatorului &#x15F;i -L/usr/lib/foo la op&#x163;iunile linker-ului nu vor distribui set&#259;rile la arhiva (tarball). Ce am de f&#259;cut?</b></a><br>
   Aceasta esre cea mai dificil&#259; parte de f&#259;cut cum trebuie. O solu&#x163;ie u&#x15F;oar&#259;, dar incorect&#259; ar fi s&#259; ad&#259;uga&#x163;i la configure.in(.in):<br>
<br>
   all_includes="$all_includes -I/usr/include/foo"<br>
   all_libraries="$all_libraries -L/usr/lib/foo"<br>
<br>
   [Cel mai bun loc este inaintea liniilor:<br>
    AC_ARG_PROGRAM<br>
    AC_OUTPUT( ..... )<br>
    la sf&acirc;r&#x15F;itul fi&#x15F;ierului.]<br>
<br>
   Problemele ap&#259;rute aici:<br>
   - Cine poate garanta c&#259; headerele vor fi mereu &icirc;n /usr/include/foo... poate &icirc;n unele sisteme poate fi  &icirc;n /usr/local/foo/include     (&#x15F;i poate bibliotecile vor fi &icirc;n /usr/local/foo/lib)??<br>
   - Poate foo nu este instalat &#x15F;i compilarea va e&#x15F;ua, dar ar fi mai bine ca "configure" s&#259; fi e&#x15F;uat deja cu un mesaj ajut&#259;tor.<br>
<br>
   Deci, pentru a proceda cum terbuie, va terbui s&#259; ad&#259;uga&#x163;i o func&#x163;ie macro la configure.in(.in), care s&#259; execute teste &#x15F;i c&#259;ut&#259;ri specifice inei instal&#259;ri a "foo".<br>
<br>
   Dac&#259; dori&#x163;i s&#259; face&#x163;i acest lucru, v&#259; puem da un sfat... &icirc;ncerca&#x163;i s&#259; &icirc;n&#x163;elege&#x163;i acinclude.m4.in sau crea&#x163;i un proiect KDE-normal-ogl, unde ve&#x163;i g&#259;si un fi&#x15F;ier numit qgl.m4, care este concatenat la (vezi "Makefile.dist"). Acesta ilustreaz&#259; un exemplu extensiv pentru c&#259;utarea a QT-OpenGL-Lib, pe care terbuie sa-l rescrie&#x163;i pentru problema dvs. specific&#259;.<br>
<br>
   Poate ave&#x163;i noroc &#x15F;i g&#259;si&#x163;i o solu&#x163;ie &icirc;n acinclude.m4.in, astfel &icirc;nc&acirc;t ve&#x163;i putea folosi o func&#x163;ie creat&#259; deja.<br>
<br>
<br>
<a name="25"><b> In the questions above I always see "configure.in(.in)". I have both files in my<br>
   project. Which file should be patched?</b></a><br>
   If there is a configure.in.in in your top-level project directory patch this one.<br>
   If you didn't find a configure.in.in patch configure.in.<br>
<br>
<br>
<a name="28"><b> Exist&#259; vre-un HOWTO disponibil despre cum s&#259; lucrez cu dialog-uri create cu QT designer?</b></a><br>
  Da, exist&#259; un tutorial excelent la <a href="http://women.kde.org/articles/tutorials/kdevelop3/index.html">http://women.kde.org/articles/tutorials/kdevelop3/index.html</a> (englez&#259;)<br>
<br>
<br>
<a name="29"><b> Am instalat htdig dar acum este htsearch disponibil?</b></a><br>
   De exemplu &icirc;n sisteme RedHat executabilul htsearch este locat &icirc;n directorul /cgi-bin al apache.<br>
   Pute&#x163;i crea leg&#259;turi simbolice &icirc;n /usr/bin sau doar ad&#259;uga&#x163;i acest director la variabila sistem PATH &icirc;n  ~/.bashrc<br>
<br>
<br>
<a name="30"><b> Am htdig, htmerge &#x15F;i htsearch disponibile dar ob&#x163;in un mesaj de eroare c&#259; fi&#x15F;ierul de configurare al htdig nu poate fi g&#259;sit sau este invalid?</b></a><br>
   Citi&#x163;i README.htdig (englez&#259;) &icirc;n directorul surs&#259; &#x15F;i crea&#x163;i un fi&#x15F;ier htdig.conf. Apoi copia&#x163;i-l &icirc;n $KDEDIR/share/apps/kdevelop/tools. Acum crea&#x163;i index-ul de c&#259;utare cu meniul de set-up al KDevelop.<br>
<br>
<br>

<a name="100"><b>Cum se poate crea un proiect simplu pornind numai de la un fi&#x15F;ier Makefile (&icirc;n alte cuvinte <em>Proiect Customizat</em>)?</b></a><br>
Crea&#x163;i un proiect customizat (Custom Project).  Nu exist&#259; o cale direct&#259; de a crea un proiect customizat (adic&#259; un proiect care s&#259; utilizeze propriile fi&#x15F;iere Makefile). Utiliza&#x163;i Proiect-> Import Proiect Existent (Project->Import Existing Project) in loc. Re&#x163;ine&#x163;i s&#259; seta&#x163;i tipul proiectului (Project Type) &icirc;n mod corespunz&#259;tor, identificat printr-un aditional (Custom Makefiles) &icirc;n dialog. 
Folosi&#x163;i Op&#x163;iuni Proiect (Project Options) devreme. C&acirc;nd &icirc;ncepe&#x163;i un proiect, nu uita&#x163;i s&#259; seta&#x163;i Project->Project Options... conform cerin&#x163;elor dvs.. 
<br>
<br>

<a name="101"><b>De ce nu pot vedea mesajele de eroare la compilare?</b></a><br>
Dac&#259; &icirc;n timpul compli&#259;rilor observa&#x163;i c&#259; informa&#x163;ie util&#259; lipse&#x15F;te din fereastra "Messages Output View", poate c&#259; nivelul de detaliu al mesajelor este setat prea jos. In fereastr&#259;, da&#x163;i right-click &#x15F;i selecta&#x163;i alt nivel de detaliu din meniul context. 
<br>
<br>

<a name="102"><b>Cum creez Fi&#x15F;iere Noi &icirc;ntr-un Proiect?</b></a><br>
Selecta&#x163;i un subproiect &icirc;n partea de sus a manager-ului Automake (Automake Manager), apoi da&#x163;i right-click in partea de jos pe numele grupului unde dori&#x163;i s&#259; ad&#259;uga&#x163;i fi&#x15F;ierul &#x15F;i selecta&#x163;i Creaz&#259; Fi&#x15F;ier Nou... (Create New File...). 
<br>
<br>

<a name="103"><b>Cum adaug fi&#x15F;iere deja existente la un Proiect?</b></a><br>
Selecta&#x163;i un subproiect &icirc;n partea de sus a manager-ului Automake (Automake Manager), apoi da&#x163;i right-click in partea de jos pe numele grupului unde dori&#x163;i s&#259; ad&#259;uga&#x163;i fi&#x15F;ierul &#x15F;i selecta&#x163;i Adaug&#259; Fi&#x15F;iere Existente... (Add Existing Files...). 
<br>
<br>

<a name="104"><b>Cum &#x15F;terg un Fi&#x15F;ier indtr-un Proiect?</b></a><br>
Selecta&#x163;i un subproiect &icirc;n partea de sus a manager-ului Automake (Automake Manager), apoi, &icirc;n partea de jos a ferestrei deshide&#x163;i grupul de unde dori&#x163;i s&#259; &#x15F;terge&#x163;i fi&#x15F;ierul, da&#x163;i right-click pe numele fi&#x15F;ierului &#x15F;i selecta&#x163;i "&#x15E;terge" (Remove). 
<br>
<br>

<a name="105"><b>Ce pot face dac&#259; proiectul nu poate fi construit din nou dup&#259; schimbarea destina&#x163;iei de la/c&#259;tre cea implicit&#259;?</b></a><br>
Exist&#259; o problem&#259; cu sistemul automake/autoconf. Dac&#259; "Proiect->Construe&#x15F;te Configura&#x163;ie" (Project->Build Configuration) furnizeaz&#259; o selec&#x163;ie &icirc;ntre trei directoare de construc&#x163;ie: default, optimized, and debug, v&#259; sf&#259;tuim s&#259; folosi&#x163;i ori destina&#x163;ia default (implicit&#259;), ori combina&#x163;ia debug/optimized (depanare/optimizat). 
<dl>
<dd>Odat&#259; configurat cu "default", proiectul nu se va mai putea construi folosind "debug" sau "optimized".</dd> 
<dd>Odat&#259; ce a&#x163;i configurat proiectul cu "debug" sau "optimized" nu va mai putea fi construit cu "default".</dd>
</dl>
<br>
<br>

<a name="106"><b>Erori "Versiune gre&#x15F;it&#259; a autoconf" etc..</b></a><br>
Exist&#259; c&acirc;teva mesaje de eroare pivitoare la versiuni prea vechi de autoconf etc. ce &icirc;mpiedic&#259; func&#x163;ionarea coract&#259; a "configure". Executa&#x163;i autoreconf &icirc;n directorul unde de afl&#259; fi&#x15F;ierele configure.in &icirc;n chestiune. Aceast&#259; comand&#259; va &icirc;ncerca s&#259; actualizeze informa&#x163;ia &icirc;n fi&#x15F;ierele sistemului de construc&#x163;ie GNU (GNU Build System). Consulta&#x163;i man autoreconf pentru mai multe informa&#x163;ii. 
<br>
<br>

<?php module_tail(); ?>