<?php module_head("KDevelop Community at LinuxTag 2000");?>

<h4>Pessoas & KDevelop - Impress&otilde;es da LinuxTag 2000 em Estugarda/Alemanha</h4>
<table width="100%">
<tr>
<td>
<a href="graphics/fotos/linuxtag2000/sitting.jpg">
<img src="graphics/fotos/linuxtag2000/sitting.jpg" height=200 width=260 border=0 alt="sentados"></a>
</td><td>
Aqui est&atilde;o algumas fotos da reuni&atilde;o KDevelop na LinuxTag Stuttgart (29.6.-2.7.)
Na foto do lado esquerdo podem ser vistos na &uacute;ltima fila da esquerda para a direita, Walter Tasin programador do  
n&uacute;cleo do KDevelop, Stephan Uhlmann, ele &Eacute; o <a href="http://www.kmud.de">Kmud</a> e o &uacute;nico com  
uma tradu&ccedil;&atilde;o da p&aacute;gina do KDevelop :-), uma fila antes est&aacute; Mario Keller, 
que viajou  connosco a Estugarda, n&atilde;o involvido no projecto KDevelop, 
mas tamb&eacute;m ele um "K-user". E por fim mas n&atilde;o menos importante Sandy Meier, coordenador.<br>
Para todos aqueles que entendem alem&atilde;o, podem encontrar <a href="http://www.php-center.de/artikel/linuxtag.php3"> 
um bom relato</a> meu (eu sou Thomas Fromm) da nossa jornada em Estugarda.<br>
No <a href="ftp://fara.cs.uni-potsdam.de/pub/linuxtag/2000/">nosso FTP</a> pode tamb&eacute;m encontrar 
algumas fotos do stand <a href="http://www.php.net">PHP</a>. Fala-se de cooperar com o 
stand PHP na LinuxTag 2001. ( Espero que nesta altura o KDevelop 2 suporte PHP :-) ).
</td>
</tr>
<tr>
<td>
Aqui podem ser vistos (da esquerda para a direita) Ralf Nolden conhecido da lista de discus&atilde;o, ele &eacute; 
tamb&eacute;m o primeiro homem para recitar e tamb&eacute;m o tipo com a bela m&aacute;quina PIII/600 da SCO :-). 
</td><td>
<td>
<a href="graphics/fotos/linuxtag2000/group.jpg">
<img src="graphics/fotos/linuxtag2000/group.jpg" height=200 width=260 border=0 alt="grupo"></a>
</td>
</tr>
<tr>
<td>
<a href="graphics/fotos/linuxtag2000/wtasin.jpg">
<img src="graphics/fotos/linuxtag2000/wtasin.jpg" height=200 width=260 border=0 alt="wtasin"></a>
</td><td>
Walter Tasin. Todos n&oacute;s o conhecemos como o homem que transforma bugs em funcionalidades :-).<bR>
Os rumores contam, que &eacute; ele quem escreve o parser PHP. Na sec&ccedil;&atilde;o Quem &eacute; Quem, em   
qual me encontro a trabalhar, ele pode dizer por ele mesmo o que faz.
</td>
</tr>
<tr>
<td>
Stephan Uhlmann, famoso programador e coordenador do <a href="http://www.kmud.de">Kmud</a>
 e que trabalha noutros projectos interessantes. Descubra voc&ecirc; mesmo na sua pr&oacute;pria  
<a href="http://www.cs.uni-potsdam.de/~uhlmann/">p&aacute;gina</a>. Ele foi o &uacute;nico que n&atilde;o recebeu
um <a href="http://www.guug.de:8080/fotos/linuxtag/images/lk2k025-pUILMLDgy.jpg">pinguim que grasna da HP</a>,
 em toda a LinuxTag ! (Se algu&eacute;m da HP ler isto, talvez lhe pudessem enviar um  :-) )
</td><td>
<a href="graphics/fotos/linuxtag2000/uhlmann.jpg">
<img src="graphics/fotos/linuxtag2000/uhlmann.jpg" height=200 width=260 border=0 alt="uhlmann"></a>
</td>
</tr>
<tr>
<td>
<a href="graphics/fotos/linuxtag2000/smeier.jpg">
<img src="graphics/fotos/linuxtag2000/smeier.jpg" height=200 width=260 border=0 alt="smeier"></a>
</td><td>
Sandy Meier. Ele coordena um pequeno projecto chamado KDevelop. Algu&eacute;m j&aacute; ouviu falar ?<br>
Para al&eacute;m do KDevelop ele gosta de programar PHP, a raz&atilde;o pela qual o KDevelop vai suportar PHP :-).
Stephan, Sandy e eu estamos a trabalhar em Berlim para uma empresa "startup" de internet, a <a href="http://www.inubit.com">InUBIT</a>.
Eles j&aacute; avisaram que pretendem patrocinar o stand na LinuxTag 2001.
</td>
</tr>
<tr>
<td>
Ralf dando suporte de primeiro n&iacute;vel.
</td><td>
<a href="graphics/fotos/linuxtag2000/rnolden.jpg">
<img src="graphics/fotos/linuxtag2000/rnolden.jpg" height=200 width=260 border=0 alt="rnolden"></a>
</td>
</tr>
<tr>
<td colspan=2>
Pronto, foi tudo por agora. Para mais informa&ccedil;&otilde;es sobre a LinuxTag Estugarda d&ecirc; uma vista de olhos <a href="http://www.linuxtag.de">aqui</a>.
Mais impress&otilde;es e fotos sobre toda a reuni&atilde;o encontram-se <a href="http://www.guug.de:8080/fotos/linuxtag/story/">aqui</a>.<br>
<br>
Vemo-nos na Linuxday 2001,<br>
sauda&ccedil;&otilde;es cordiais,<br>
<a href="http://tfromm.com">Thomas</a> 
</td></tr>
</table>

<?php module_tail();?>
