<?php module_head("KDevelop Community at LinuxTag 2001");?>

<h4>Pessoas & KDevelop - LinuxTag 2001 em Estugarda/Alemanha</h4>
<table width="100%">
<tr>
<td colspan=2>
       &Aacute; procura de mais fotos da comunidade?
      <br>
<a href="http://women.kde.org/events/">http://women.kde.org</a> apresenta a mais completa lista de endere&ccedil;os de galerias de fotos da LinuxTag.
      <br><br>
</td>
</tr>
<tr>
<td>
<a href="http://tfromm.com/linuxtag/DSCF0032.JPG">
<img src="http://tfromm.com/linuxtag/DSCF0032.JPG" height=200 width=260 border=0 alt="foto"></a>
</td><td>
       A LinuxTag &eacute; um evento muito interessante na Europa. Existe a possibilidade de voc&ecirc; se sentar por um instante para ler os seus emails e estar sentado ao lado de pessoas famosas como Jon Maddog Hall ou Eric S. Raymond.
      <br>
      Para al&eacute;m da feira em si, onde podem ser encontrados bons projectos como por exemplo este do Grupo de Linux Jap&atilde;o (Linux numa Dreamcast), a LinuxTag oferece um bom programa de confer&ecirc;ncias aos visitantes.
      <br>
      Mais informa&ccedil;&otilde;es sobre a LinuxTag podem ser encontradas <a href="http://www.linuxtag.org">aqui</a>.<br>
</td>
</tr>
<tr>
<td>
       Jon Maddog Hall fala sobre os diversos aspectos da utiliza&ccedil;&atilde;o de Linux.
    </td>
<td>
<a href="http://tfromm.com/linuxtag/DSCF0033.JPG">
<img src="http://tfromm.com/linuxtag/DSCF0033.JPG" height=200 width=260 border=0 alt="foto"></a>
</td>
</tr>
<tr>
<td>
<a href="http://tfromm.com/linuxtag/DSCF0021.JPG">
<img src="http://tfromm.com/linuxtag/DSCF0021.JPG" height=200 width=260 border=0 alt="foto"></a>
</td><td>
       Sandy Meier e Bernd Gehrmann falando sobre tecnologia e o futuro do KDevelop3 tamb&eacute;m conhecido por Gideon. Bernd &eacute; um tipo bastante porreiro com bastante conhecimento e exper&ecirc;ncia. Quando voc&ecirc; tamb&eacute;m ver o que ele faz todo o dia, tamb&eacute;m vai concordar ;-).
    </td>
</tr>
<tr>
<td>
       Stephan tamb&eacute;m esteve l&aacute; de novo, e estava bastante com a sua tshirt do Kmud. (Nunca pens&aacute;mos que o <a href="http://www.kmud.de">Kmud</a> chegaria a 1.0, mas finalmente ele lan&ccedil;ou-o &aacute; poucos dias atr&aacute;s.
      <br>
       Quando ele n&atilde;o passava o tempo nas confer&ecirc;ncias &nbsp;discutia aspectos t&eacute;cnicos com a equipa Kmud.
      <br>
       As pessoas nesta mesa da esquerda para a direita:
      <br>
Andre Bell (Kmud)<br>
       Sandy Meier (ele trabalha num IDE gr&aacute;tis, mas n&atilde;o me perguntem qual...)
      <br>
Kevin Krammer (Kmud)<br>
       Stephan Uhlmann (a TShirt - olhem a &nbsp;TShirt!)
      <br>
       Pessoa desconhecida
      <br>
       Sebastian Bergmann (tipo bastante conhecido na comunidade PHP)
      <br>
       Rasmus Lerdorf (Fundador do projecto PHP)
    </td><td>
<a href="http://tfromm.com/linuxtag/DSCF0012.JPG">
<img src="http://tfromm.com/linuxtag/DSCF0012.JPG" height=200 width=260 border=0 alt="foto"></a>
</td>
</tr>
<tr>
<td>
<a href="http://tfromm.com/linuxtag/DSCF0005.JPG">
<img src="http://tfromm.com/linuxtag/DSCF0005.JPG" height=200 width=260 border=0 alt="foto"></a>
</td><td>
       Nesta discuss&atilde;o eles engenharam qualquer coisa com DCOP e Python no Kmud se bem me lembro.
      <br>
       Nomes da esquerda para a direita:
      <br>
       Kevin Krammer, Andre Bell, Sandy Meier (projecto desconhecido), Stephan Uhlmann (notem a TShirt Kmud), e depois na frente (programador KMail) e ao fundo Eric S. Raymond. (<a href="http://tfromm.com/linuxtag/DSCF0010.JPG">um grande plano de Raymond</a>)
</td>
</tr>
<tr>
<td>
       Em qualquer altura o pavilh&atilde;o KDE podia ser encontrado repleto de visitantes. Eu n&atilde;o posso tirar nenhuma fotografia do Ralf Nolden, mas deixem-me que vos diga, que em qualquer altura que o vejo, ele presta suporte de primeiro n&iacute;vel aos clientes ;-).
      <br>
</td><td>
<a href="http://tfromm.com/linuxtag/DSCF0034.JPG">
<img src="http://tfromm.com/linuxtag/DSCF0034.JPG" height=200 width=260 border=0 alt="foto"></a>
</td>
</tr>
<tr>
<td>
<a href="http://linuxtag.openit.de/2001/pictures/kde/0800x0600/p7061027-623b35.jpg">
<img border=0 alt="foto" src="http://linuxtag.openit.de/2001/pictures/kde/0160x0120/p7061027-623b35.jpg"></a>
</td><td>
       Esta &eacute; uma fotografia de todos os programadores do KDE em Estugarda.
      <br>
       (ah, esperem, na fotografia em baixo &aacute; esquerda, o homem de neg&oacute;cios sorridente, aquele &eacute; thats Ralf Nolden ;-)
      <br>
       Mas falta-me alguem... hmhm... penso que o seu nome era Sr Meyer, ou Maier, n&atilde;o me lembro. E &eacute; claro, todos n&oacute;s sentimos a falta de Walter Tasin nesses dias :-).
    </td></tr>
<tr><td colspan=2>
       Acabou. Espero que estas poucas frases tenham sido suficientes para o fazer decidir a vir at&eacute; &aacute; LinuxTag em 2002. Nesta altura tenho que dizer um &quot;obrigado&quot; ao tipo que me ofereceu uma bola transparente de borracha com um pinguim sobre gelo (era da Compaq), no &uacute;ltimo dia da feira no pavilh&atilde;o KDE :-). Um presente bastante fixe.
      <br>
       Vemo-nos na LinuxTag 2002,
      <br>
       sauda&ccedil;&otilde;es cordiais,
      <br>
<a href="http://tfromm.com">Thomas</a> 
</td></tr>
</table>
<br>

<?php module_tail();?>