<?php module_head("Annonce de la sortie de KDevelop 3.1"); ?>

<P>DATE 19 AOUT 2004</P>
<P>POUR SORTIE IMMEDIATE</P>
<H3 ALIGN="center">Annonce de la sortie de KDevelop 3.1</H3>
<P><STRONG>L'&eacute;quipe de KDevelop sort une version majeure de leur EDI r&eacute;compens&eacute;</STRONG></P>
<P>19 Ao&ucirc;t 2004 (INTERNET).
L'&eacute;quipe de KDevelop est fi&egrave;re de livrer KDevelop 3.1, la deuxi&egrave;me version majeure de son Environnement de D&eacute;veloppement Int&eacute;gr&eacute; (EDI) r&eacute;compens&eacute;.
</P>
<P>
"KDevelop est une clef pour atteindre de tout nouveaux niveaux de productivit&eacute;. C'est un EDI qui convient pour toutes les t&acirc;ches de la programmation syst&egrave;me au d&eacute;veloppement d'interfaces RAD. En int&eacute;grant tous les outils standards de d&eacute;veloppements UNIX, en proposant du support pour le d&eacute;veloppement en &eacute;quipe avec divers outils de contr&ocirc;le de version et en ayant une longue liste de langages support&eacute;s, KDevelop est un excellent choix pour les d&eacute;veloppeurs UNIX. Disponible sur diff&eacute;rentes plateformes comme Mac OS X et Windows/Cygwin, KDevelop est un bon outil pour le d&eacute;veloppement multiplateforme. Le support pour des outils de d&eacute;veloppement communs vous permet de d&eacute;velopper des applications pour un grand nombre de plateformes y compris les plateformes embarqu&eacute;es" d&eacute;clara Alexander Dymo, co-mainteneur du projet.
</P>
<P>
"Avec son nouveau noyau ind&eacute;pendant du langage, bas&eacute; sur des plugins et son large support pour les outils de d&eacute;veloppement communs, KDevelop est d&eacute;j&agrave; l'EDI standard de-facto sur les stations Linux/Unix" ajouta Harald Fernengel, membre du projet de longue date.
</P>
<P>
"L'&eacute;quipe de KDevelop a fait un excellent travail sur cette version. Plus de 20 d&eacute;veloppeurs ont contribu&eacute; au projet sur une dur&eacute;e de six mois. Vous remarquerez qu'une attention particuli&egrave;re a &eacute;t&eacute; prise pour la documentation et l'interface utilisateur. Cette version est puissante, et maintenant facile &agrave; utiliser" nota Amilcar do Carmo Lucas, co-coordinateur de version.
</P>

<H4>Am&eacute;liorations majeures</H4>
<P>
KDevelop supporte maintenant plus de 15 langages de programmation et de nombreux syst&egrave;mes de contr&ocirc;le de version, d&eacute;bogueurs, formats de documentation et outils de construction. N'importe quel &eacute;diteur supportant les interfaces KTextEditor peut &ecirc;tre utilis&eacute; comme &eacute;diteur KDevelop natif, y compris kate, QEditor et kvim. Les outils de constructions comme automake, qmake ou ant sont support&eacute;s nativement, ce qui veut dire que KDevelop ne garde pas sa propre collection d'objets. Les changements dans les fichiers du projet natif se r&eacute;fl&eacute;chiront dans KDevelop et vice-versa.
</P><P>
Le support C++ offre une vue de classe montrant tous les symboles sous forme de liste ou sous forme hi&eacute;rarchique par ordre alphab&eacute;tique et permet une navigation ais&eacute;e dans le code source. Un parseur met &agrave; jour les symboles &agrave; la vol&eacute;e et montre aussi les erreurs syntaxiques dans le code source. L'ach&egrave;vement automatique du code g&egrave;re aussi les slots et signaux Qt.
</P><P>
Avec sa nouvelle architecture ouverte, KDevelop peut &ecirc;tre personnalis&eacute; sur tous les points. L'interface utilisateur peut &ecirc;tre chang&eacute;e en temps r&eacute;el du mode classique MDI au mode moderne IDEAl, avec une approche centr&eacute;e sur le code avec des vues-outils sur demande.
</P><P>
KDevelop offre un support &eacute;tendu pour naviguer dans le code source. Les symboles et noms de fichier sont accessibles en ne tapant qu'une partie du nom, les fichiers r&eacute;cemment modifi&eacute;s peuvent &ecirc;tre atteints avec une simple combinaison de touches.
</P><P>
KDevelop offre des g&eacute;n&eacute;rateurs de documentation, des d&eacute;bogueurs de code, des v&eacute;rificateurs de m&eacute;moire, un arrangeur de code, une gestion de signets, et des tonnes d'outils pour rendre le d&eacute;veloppement facile et convivial. Il est traduit dans plus de 16 langues.
</P>

<H4>Installer les paquetages binaires de KDevelop 3.1</H4>
<P>
Les paquetages binaires pour toutes les distributions majeures de Linux se trouvent sur <a href="http://www.kdevelop.org/index.html?filename=3.1/download.html">http://www.kdevelop.org/index.html?filename=3.1/download.html</a>.
</P><P>
Une version alpha d'un binaire natif pour Mac OS X se trouve sur <a href="http://kde.opendarwin.org">http://kde.opendarwin.org</a>.
</P><P>
Le projet kde-cygwin propose KDevelop sur <a href="http://kde-cygwin.sourceforge.net/kde3/installation.php">http://kde-cygwin.sourceforge.net/kde3/installation.php</a>.
</P><P>
Veuillez noter que l'&eacute;quipe de KDevelop ne fournit pas de versions binaires, tous les paquetages sont mis &agrave; disposition par des tiers.
</P>

<H4>Compiler KDevelop 3.1</H4>
<P>
Le code source complet de KDevelop 3.1 peut &ecirc;tre librement t&eacute;l&eacute;charg&eacute; sur <a href="http://www.kdevelop.org/">http://www.kdevelop.org</a>. Les informations d&eacute;taill&eacute;es sur la construction se trouvent sur <a href="http://www.kdevelop.org/index.html?filename=3.1/branches_compiling.html">http://www.kdevelop.org/index.html?filename=3.1/branches_compiling.html</a>.
</P>


<H4>A propos de KDevelop</H4>
<P>
KDevelop est un projet ind&eacute;pendant pour cr&eacute;er un Environnement de d&eacute;veloppement int&eacute;gr&eacute; (EDI) puissant et facile &agrave; utiliser . Faisant partie du projet KDE, KDevelop partage le m&ecirc;me mod&egrave;le de d&eacute;veloppement ouvert et le cadre modulaire. Le r&eacute;sultat est un EDI extr&ecirc;mement personnalisable et ind&eacute;pendant du langage sous licence GPL suivie par des dizaines de d&eacute;veloppeurs et de professionnels dans le monde. Pour en savoir plus sur KDevelop, visitez <a href="http://www.kdevelop.org">http://www.kdevelop.org</a>.
</P>


<H4>A propos de KDE</H4>

<P>
KDE est un projet ind&eacute;pendant de centaines de d&eacute;veloppeurs, traducteurs, artistes et d'autres professionnels collaborant &agrave; travers le monde gr&acirc;ce &agrave; Internet pour cr&eacute;er et distribuer gratuitement une station et un environnement de bureau sophistiqu&eacute;s, personnalisables et stables en employant une architecture flexible, bas&eacute;e sur des composants, transparente pour le r&eacute;seau et offrant une plateforme de d&eacute;veloppement exceptionnelle. KDE propose un bureau stable, m&ucirc;r, une suite bureautique compl&egrave;te, et bas&eacute;e sur des composants (KOffice), un grand choix d'outils et d'utilitaires d'administration et de r&eacute;seau, et un environnement de d&eacute;veloppement efficace et intuitif: l'excellent EDI KDevelop. KDE est la preuve vivante que le mod&egrave;le de d&eacute;veloppement de logiciel open source "style Bazaar" peut &eacute;galer et m&ecirc;me d&eacute;passer les technologies de premier ordre avec les logiciels commerciaux des plus complexes.
</P>
<BR><BR>
<HR NOSHADE SIZE=1 WIDTH="90%" ALIGN="center">
<FONT SIZE=2>
<EM>Communiqu&eacute; de presse:</EM> Ecrit par Harald Fernengel, avec l'inestimable assistance de nombreux volontaires du projet KDE.<BR>
<EM>Coordinateurs de version:</EM> Merci &agrave; Alexander Dymo et Amilcar do Carmo Lucas pour leurs services en tant que coordinateurs de version.<BR>
<EM>Trademarks Notices:</EM>
KDE et K Desktop Environment sont des marques d&eacute;pos&eacute;es de KDE e.V. Linux est une marque d&eacute;pos&eacute;e enregistr&eacute;e de Linus Torvalds. UNIX est une marque d&eacute;pos&eacute;e enregistr&eacute;e de The Open Group aux Etats-Unis et dans d'autres pays. Toutes les autres marques d&eacute;pos&eacute;es et copyrights auxquels se r&eacute;f&egrave;rent ce document sont la propri&eacute;t&eacute; de leurs propri&eacute;taires respectifs.
<BR>
</FONT>
<HR NOSHADE SIZE=1 WIDTH="90%" ALIGN="center">

<H4>Contacts de presse:</H4>

Mondial (Allemans et Anglais): Harald Fernengel, <a href="mailto:harry at kdevelop.org">harry at kdevelop.org</a>, (47) 92043220<BR>
Mondial (Ukrainien, Russe et Anglais): Alexander Dymo, <a href="mailto:cloudtemple at mksat.net">cloudtemple at mksat.net</a>, (38) 0675122801<BR>
Mondial (Su&eacute;dois et Anglais): Jens Dagerbo, <a href="mailto:jens.dagerbo at swipnet.se">jens.dagerbo at swipnet.se</a><BR>
Mondial (Portuguais): Amilcar do Carmo Lucas, <a href="mailto:amilcar at ida.ing.tu-bs.de">amilcar at ida.ing.tu-bs.de</a><BR>

<?php module_tail(); ?>
