<?php include_file("$k_base_version/cvsbranches.ihtml"); // this is a trick to pass a non-existing path to the include_file() ?>

<?php module_head("Instructions pour une version compil&eacute;e de KDevelop 3.1.x"); ?>
<ol>
<li>Avant de continuer, veuillez v&eacute;rifier que votre ordinateur a tous les <a href="index.html?filename=3.1/requirements.html">logiciels requis</a> install&eacute;s.
</li>
<br>
<li>Procurez-vous les sources pour la branche <b>KDE_3_3_BRANCH</b> comme expliqu&eacute; ci-dessus.</li>
<br>
<li>Initialisez le système de construction:
<dl>
<dd class="code">$ cd kdevelop</dd>
<dd class="code">$ make -f admin/Makefile.common cvs-clean</dd>
<dd class="code">$ make -f Makefile.cvs</dd>
</dl>
</li>
</ol>
<?php
  include_file("3.1/compiling.ihtml");
  module_tail();
  module_head("Comment garder votre version &agrave; jour");
?>
Apr&egrave;s avoir r&eacute;ussi &agrave; t&eacute;l&eacute;charger et compiler une des branches CVS
ci-dessus, vous voudrez rester &agrave; jour afin d'avoir tous les patches.
<ol><li>Pour &eacute;viter de taper toutes les instructions pour d&eacute;finir les variables d'environnement n&eacute;cessaires  
&agrave; chaque fois que vous voulez vous mettre &agrave; jour, vous devriez les placer dans votre fichier .bashrc ou .cshrc.
<ul>
<li>Si vous utilisez le shell bash, ajoutez-y les lignes suivantes:
<dl>
<dd class="code">export KDEDIR=/ou/se/trouve/votre/kde3</dd>
<dd class="code">export QTDIR=/ou/se/trouve/votre/qt3</dd>
<dd class="code">export LD_LIBRARY_PATH=$QTDIR/lib:$KDEDIR/lib:$LD_LIBRARY_PATH</dd>
<dd class="code">export LIBRARY_PATH=$QTDIR/lib:$KDEDIR/lib:$LIBRARY_PATH</dd>
<dd class="code">export PATH=$QTDIR/bin:$KDEDIR/bin:$PATH</dd>
</dl></li>
<li>Si vous utilisez tcsh, ajoutez-y les lignes suivantes:
<dl>
<dd class="code">setenv KDEDIR /ou/se/trouve/votre/kde3</dd>
<dd class="code">setenv QTDIR /ou/se/trouve/votre/qt3</dd>
<dd class="code">setenv LD_LIBRARY_PATH $QTDIR/lib:$KDEDIR/lib:$LD_LIBRARY_PATH</dd>
<dd class="code">setenv LIBRARY_PATH $QTDIR/lib:$KDEDIR/lib:$LIBRARY_PATH</dd>
<dd class="code">setenv PATH $QTDIR/bin:$KDEDIR/bin:$PATH</dd>
</dl>
</li></ul>
<b>Note:</b> Pour des raisons &eacute;videntes, vous devez &eacute;diter les deux premi&egrave;res lignes pour qu'elles correspondent &agrave; votre configuration! :)
</li>

<br>
<br>

<li>Allez dans le r&eacute;p&eacute;rtoire o&ugrave; dans lequel vous avez t&eacute;l&eacute;charg&eacute; les fichiers <i>kdevelop du CVS</i> et essayez la commande de mide &agrave; jour:
<dl>
<dd class="code">$ cd kdevelop</dd>
<dd class="code">$ cvs update -dP</dd>
</dl>
</li>

<br>
<br>

<li>L'&eacute;tape suivante d&eacute;pend du r&eacute;sultat de la commande pr&eacute;c&eacute;dente:

<ul>
<li>Si vous obtenez quelque chose comme ceci:
<dl>
<dd class="code">U /un_certain_chemin/Makefile.am</dd>
</dl>
Vous devez faire:
<dl>
<dd class="code">$ make -f Makefile.cvs</dd>
</dl>
suivi par ./configure step
</li>

<br>
<br>

<li>
Si vous avez quelque chose comme ceci:
<dl>
<dd class="code">P /un_certain_chemin/Makefile.am</dd>
</dl>
Vous devez faire:
<dl>
<dd class="code">$ ./configure --enable-debug=full --prefix=$KDEDIR --with-kdelibsdoxy-dir=$KDEDIR/share/doc/HTML/en/kdelibs-apidocs</dd>
</dl>
en utilisant les options ./configure que vous aviez utilis&eacute;es la premi&egrave;re fois que vous l'aviez compil&aacute;e.
</li>
</ul>
</li>

<br>
<br>

<li>Compiler kdevelop et l'installer:
<dl>
<dd class="code">$ make</dd>
<dd class="code">$ make install (en root)</dd>
</dl>
Si pour une raison, la commande make &eacute;choue, vous pouvez la forcer &agrave; ignorer
les erreurs en ajoutant l'option -k comme ceci:
<dl>
<dd class="code">$ make -k</dd>
<dd class="code">$ make -k install (en root)</dd>
</dl>
En fonction de la gravit&eacute; de l'erreur vous pouvez 
terminer avec une version de KDevelop qui fonctionne ou non. Donc, utilisez la commande 
"make -k install" &agrave; vos risques et p&eacute;rils!!!. En tous cas, ces erreurs disparaissent g&eacute;n&eacute;ralement apr&egrave;s 
quelques heures donc vous devriez essayer de mettre &agrave; jour un peu plus tard avant d'essayer 
la dangereuse :) commande make install.
</li></ol>

<br>
<br>

C'est tout! Maintenant vous avez la version la plus &agrave; jour de KDevelop. Pour la lancer, faites juste:
<dl>
<dd class="code">$ kdevelop</dd>
</dl>

<p>Tout ce que vous avez &agrave; faire pour la garder &agrave; jour, c'est de r&eacute;p&eacute;ter ces &eacute;tapes &agrave; 
chaque fois que quelqu'un dans la mailing-list <a href="index.html?filename=mailinglist.html">kdevelop-devel</a> 
corrige un bogue.
Donc, nous vous encourageons fortement &agrave; <a href="index.html?filename=mailinglist.html">joindre cette mailing-list</a>.</p>

<p>Vous pouvez signaler les bogues que vous trouvez avec le <a
href="http://bugs.kde.org/wizard.cgi">formulaire de soumission de bogues</a>. Vous <b>ne</b> devez <b>pas</b> signaler 
des erreurs de compilation dans la base de donn&eacute;es de bogues. Pour les erreurs de compilation, veuillez utiliser la 
<a href="index.html?filename=mailinglist.html">mailing-list</a> &agrave; la place.
</p>

<p>Vous pouvez jeter un oeil aux bogues dans la <a
href="http://bugs.kde.org/buglist.cgi?product=kdevelop&amp;bug_status=UNCONFIRMED&amp;bug_status=NEW&amp;bug_status=ASSIGNED&amp;bug_status=REOPENED&amp;order=map_components.name,bugs.bug_id">base de donn&eacute;es des 
bogues</a>.</p>

<?php module_tail(); ?>