<?php module_head("Caract&eacute;ristiques de KDevelop 3.1.x");?>

Il contient toutes <a href="index.html?filename=3.0/features.html">les caract&eacute;ristiques de KDevelop 3.0.x</a> plus:<br>
<ul>
<li><b>Bouts de code pr&eacute;d&eacute;finis (Code Snippets)</b>
<ul>
<li>SnippetPart ajoute une vue-outil qui s'ancre par d&eacute;faut sur la droite</li>
<li>Ajout, &eacute;dition et suppression de bouts de codes par un menu contextuel</li>
<li>Double-cliquer sur un bout de code &agrave; partir de la liste l'ins&egrave;re dans la vue active et &agrave; la position du curseur</li>
<li>Des info-bulles montrent le contenu d'un bout de code</li>
<li>Les bouts de code sont enregistr&eacute;s dans le r&eacute;pertoire home de l'utilisateur donc, chaque utilisateur peut avoir ses propres bouts de code</li>
<li>Les bouts de code peuvent contenir des variables du genre $VARNAME$. Quand on utilise le bout de code, on demande &agrave; l'utilisateur d'entrer la valeur de remplacement pour les variables</li>
</ul>
</li>

<li><b>Int&eacute;gration Doxygen </b> (g&eacute;n&eacute;rateur de documentation API)
<ul>
<li>Supporte tous les langages de programmation que doxygen supporte (sauf IDL et D)</li>
<li>Pr&eacute;visualisation de la documentation que doxygen g&eacute;n&egrave;re pour le fichier que vous &ecirc;tes en train d'&eacute;diter</li>
<li>Configuration de doxygen</li>
<li>Ex&eacute;cution de doxygen</li>
<li>Affiche les docs. g&eacute;n&eacute;r&eacute;es par doxygen (formats html man ou pdf)</li>
<li>On peut utiliser le XML g&eacute;n&eacute;r&eacute; par doxygen comme info-bulles pour l'ach&egrave;vement automatique du code "lors de la frappe"</li>
</ul>
</li>

<li><b>Visualisateur de documentation bas&eacute; sur des plugins</b>
<ul>
<li>Une interface unique pour afficher la documentation.</li>
<li>Table des mati&egrave;res, index et possibilit&eacute; de recherche compl&egrave;te de texte (avec htdig).</li>
<li>Autod&eacute;tection et inclusion de la documentation Qt, KDE Libs et DevHelp .</li>
<li>Support pour des collections de documentation personnalis&eacute;e (format KDevelopTOC).</li>
<li>Possibilit&eacute; d'ouvrir de la documentation locale, distante et m&ecirc;me compress&eacute;e (en utilisant n'importe que protocole support&eacute; par Konqueror - http, ftp, sftp, tar, zip, etc.).</li>
<li>Supporte les formats de fichiers TXT, HTML, DevHelp, CHM, PDF, Djvu et PDB.</li>
<li>Peut utiliser n'importe quel format de documentation que supporte KDE</li>
</ul>
</li>

<li><b>Assistant d'application flexible (mod&egrave;les de projets)</b>
<ul>
<li>L'assistant d'application g&eacute;n&egrave;re des applications compl&egrave;tes, et pr&ecirc;tes &agrave; l'emploi.</li>
<li>Des mod&egrave;les pour chaque langage support&eacute; et syst&egrave;me de construction existent.</li>
<li>Possibilit&eacute; d'utiliser des mod&egrave;les d'application personnalis&eacute;s non inclus dans la distribution.</li>
<li>Contient tous les mod&egrave;les KDevelop 3.0 plus les mod&egrave;les d'application GTK, GNOME et Bonobo</li>
<li>Supporte des choses que <b>seul Ian</b> conna&icirc;t :)</li>
</ul>
</li>

<li><b>Orient&eacute RAD (D&eacute;veloppement Rapide d'Applications)</b>
<ul>
<li>La nouvelle application kdevdesigner permet le d&eacute;veloppement d'interfaces bas&eacute;es sur QT par l'int&eacute;gration de QTdesigner dans le cadre de KDE.</li>
<li>La nouvelle application kdevassistant permet des aides de documentation <em>style QT</em>.</li>
<li>Ces deux applications peuvent &ecirc;tre utilis&eacute;es d'une mani&egrave;re autonome ou &agrave; partir de KDevelop lui-m&ecirc;me, ce qui permet <b>un</b> programme de d&eacute;veloppement pour tous vos besoins de d&eacute;veloppements.</li>
</ul>
</li>

</ul>
<?php module_tail();?>
