<?php module_head("An&uacute;ncio de lan&ccedil;amento do KDevelop 3.1"); ?>

<P>19 Agosto de 2004</P>
<P>PARA LAN&Ccedil;AMENTO IMEDIATO</P>
<H3 ALIGN="center">An&uacute;ncio de lan&ccedil;amento do KDevelop 3.1</H3>
<P><STRONG>A Equipa KDevelop Lan&ccedil;a Vers&atilde;o com Novas Funcionalidades do Premiado IDE Open Source</STRONG></P>
<P>19 Agosto de 2004 (Na INTERNET).
A Equipa KDevelop encontra-se orgulhosa de lan&ccedil;ar o KDevelop 3.1, o segundo lan&ccedil;amento publico deste premiado Ambiente de Desenvolvimento Integrado (IDE).
</P>
<P>
"O KDevelop &eacute; uma chave para alcan&ccedil;ar novos n&iacute;veis de productividade. &Eacute; um IDE apropriado para qualquer tarefa desde programa&ccedil;&atilde;o de sistemas at&eacute; desenvolvimento GUI RAD. Integrando ferramentas de desenvolvimento UNIX totalmente standard, fornecendo suporte para desenvolvimento em equipa suportando v&aacute;rias ferramentas de controlo de vers&otilde;es e dispondo de uma lista alargada de linguagens suportadas, o KDevelop &eacute; uma excelente escolha para programadores UNIX. Dispon&iacute;vel em plataformas diferentes como por exemplo MAC OS X e Windows/Cygwin, o KDevelop &eacute; uma grande ferramenta para desenvolvimento multiplataforma. O suporte para ferramentas de desenvolvimento comuns permite o desenvolvimento de aplica&ccedil;&otilde;es para um largo n&uacute;mero de plataformas inclu&iacute;ndo sistemas embebidos" afirmou Alexander Dymo, co-coordenador do projecto.
</P>
<P>
"Como a sua nova independ&ecirc;ncia de linguagem, n&uacute;cleo baseado em plugins e vasto suporte para ferramentas de desenvolvimento comuns, o KDevelop j&aacute; &eacute; o IDE standard de-facto em desktops Linux/Unix" adiciona Harald Fernengel, membro do projecto de longa data.
</P>
<P>
"A equipa KDevelop fez um excelente trabalho com esta vers&atilde;o. Mais de 20 programadores/colaboradores contribu&iacute;ram num per&iacute;odo de tempo de seis meses para o projecto. Pode ser notada a aten&ccedil;&atilde;o dada na documenta&ccedil;&atilde;o e na interface do utilizador. Esta vers&atilde;o &eacute; poderosa, mas no entanto f&aacute;cil de utilizar" nota Amilcar do Carmo Lucas, co-coordenador da vers&atilde;o.
</P>

<H4>Principais Melhorias</H4>
<P>
O KDevelop agora suporta mais de 15 linguagens de programa&ccedil;&atilde;o e numerosos sistemas de controlo de vers&otilde;es, debuggers, formatos de documenta&ccedil;&atilde;o e ferramentas de constru&ccedil;&atilde;o. Qualquer Editor que suporte as interfaces KTextEditor pode ser utilizado como editor nativo do KDevelop, inclu&iacute;ndo o Kate, QEditor e kvim. Ferramentas de constru&ccedil;&atilde;o como automake, qmake ou ant t&ecirc;m suporte nativo, o que significa que o KDevelop n&atilde;o mant&ecirc;m o seu pr&oacute;prio reposit&oacute;rio de objectos. Altera&ccedil;&otilde;es nos ficheiros do projecto nativo ser&atilde;o reflectidas no KDevelop e vice-versa.
</P><P>
O suporte C++ oferece a visualiza&ccedil;&atilde;o de classes mostrando todos os s&iacute;mbolos quer numa forma plana quer numa forma hier&aacute;rquica por espa&ccedil;os de nomes e permitindo a navega&ccedil;&atilde;o f&aacute;cil no c&oacute;digo. Um parser a correr em background actualiza os s&iacute;mbolos no instante e mostra tamb&eacute;m erros sint&aacute;cticos no c&oacute;digo fonte. A completa&ccedil;&atilde;o de c&oacute;digo at&eacute; trata com sinais e slots QT.
</P><P>
Com a sua nova arquitectura aberta, o KDevelop pode ser costumizado em qualquer aspecto. A interface do utilizador pode ser comutada no instante do cl&aacute;ssico modo MDI para o moderno modo IDEAl, caracterizado por uma orienta&ccedil;&atilde;o centrada no c&oacute;digo com barras de ferramentas "on-demand".
</P><P>
O KDevelop apresenta um extenso suporte para navega&ccedil;&atilde;o no c&oacute;digo fonte. S&iacute;mbolos e ficheiros podem ser acedidos  bastando escrever parte do nome, e ficheiros modificados recentemente podem ser alcan&ccedil;ados com apenas a press&atilde;o de uma tecla.
</P><P>
O KDevelop oferece gera&ccedil;&atilde;o de documenta&ccedil;&atilde;o, depura&ccedil;&atilde;o de c&oacute;digo, verifica&ccedil;&atilde;o de mem&oacute;ria, "refactoring" de c&oacute;digo, gest&atilde;o de marcadores, e d&uacute;zias de ferramentas para tornar o desenvolvimento f&aacute;cil e conveniente. Encontra-se traduzido em mais de 16 linguagens.
</P>

<H4>Instala&ccedil;&atilde;o dos pacotes bin&aacute;rios do KDevelop 3.1</H4>
<P>
Pacotes bin&aacute;rios para as principais distribui&ccedil;&otilde;es de Linux podem ser encontradas em <a href="http://www.kdevelop.org/index.html?filename=3.1/download.html">http://www.kdevelop.org/index.html?filename=3.1/download.html</a>.
</P><P>
Uma vers&atilde;o alfa de um bin&aacute;rio nativo para Mac OS X pode ser encontrada em <a href="http://kde.opendarwin.org">http://kde.opendarwin.org</a>.
</P><P>
O projecto kde-cygwin fornece o KDevelop em <a href="http://kde-cygwin.sourceforge.net/kde3/installation.php">http://kde-cygwin.sourceforge.net/kde3/installation.php</a>.
</P><P>
Por favor note que a equipa KDevelop n&atilde;o lan&ccedil;a vers&otilde;es bin&aacute;rias, todos os pacotes s&atilde;o fornecidos por terceiros.
</P>

<H4>Compila&ccedil;&atilde;o do KDevelop 3.1</H4>
<P>
O c&oacute;digo completo do KDevelop 3.1 pode ser descarregado gratuitamente de <a href="http://www.kdevelop.org/">http://www.kdevelop.org</a>. Informa&ccedil;&atilde;o detalhada de constru&ccedil;&atilde;o pode ser encontrada em <a href="http://www.kdevelop.org/index.html?filename=3.1/branches_compiling.html">http://www.kdevelop.org/index.html?filename=3.1/branches_compiling.html</a>.
</P>


<H4>Sobre o KDevelop</H4>
<P>
O KDevelop &eacute; um projecto independente para criar um potente mas simples de usar ambiente de desenvolvimento integrado (IDE). Como parte do projecto KDE, o KDevelop partilha o mesmo modelo de desenvolvimento aberto e o mesmo framework modular. O resultado &eacute; um IDE altamente costumizado, independente da linguagem sobre a licen&ccedil;a GPL e conduzido por d&uacute;zias de programadores e profissionais de todo o mundo. Mais informa&ccedil;&atilde;o sobre o KDevelop pode ser encontrada em <a href="http://www.kdevelop.org">http://www.kdevelop.org</a>.
</P>


<H4>Sobre o KDE</H4>

<P>
O KDE &eacute; um projecto independente de centenas de programadores, tradutores, artistas e outros profissionais colaborando a n&iacute;vel mundial atrav&eacute;s da Internet para criar e distribuir gratuitamente um sofisticado, costumiz&aacute;vel e est&aacute;vel ambiente para o desktop e escrit&oacute;rio empregando uma arquictura flex&iacute;vel, baseada em componentes e transparente da rede e oferecendo uma fant&aacute;stica plataforma de desenvolvimento. O KDE proporciona um desktop est&aacute;vel e maduro, um completo pacote de office baseado em componentes (KOffice), uma larga gama de ferramentas e utilit&aacute;rios de rede e administra&ccedil;&atilde;o, e um eficiente, intu&iacute;tivo ambiente de desenvolvimento com o excelente IDE KDevelop. KDE &eacute; a prova viva de que um modelo de desenvolvimento de software de c&oacute;digo aberto em "estilo Bazar" pode produzir tecnologias de alta qualidade ao n&iacute;vel ou mesmo superior ao mais complexo software comercial.
</P>
<BR><BR>
<HR NOSHADE SIZE=1 WIDTH="90%" ALIGN="center">
<FONT SIZE=2>
<EM>Comunicado de Imprensa:</EM> Escrito por Harald Fernengel, com a assist&ecirc;ncia incalcul&aacute;vel de numerosos volunt&aacute;rios do projecto KDE.<BR>
<EM>Coordenadores de lan&ccedil;amento:</EM> Gra&ccedil;as a Alexander Dymo e Amilcar do Carmo Lucas pelos seus servi&ccedil;os como coordenadores de lan&ccedil;amento.<BR>
<EM>Avisos de marcas registadas:</EM>
KDE e K Desktop Environment s&atilde;o marcas registadas da KDE e.V. Linux &eacute; uma marca regista de Linus Torvalds. UNIX &eacute; uma marca registada do The Open Group nos Estados Unidos e outros pa&iacute;ses. Todas as outras marcas registadas e direitos de autor referidos neste an&uacute;ncio s&atilde;o propriedade dos respectivos autores.
<BR>
</FONT>
<HR NOSHADE SIZE=1 WIDTH="90%" ALIGN="center">

<H4>Contactos de Imprensa:</H4>

Mundial (Alem&atilde;o e Ingl&ecirc;s): Harald Fernengel, <a href="mailto:harry at kdevelop.org">harry at kdevelop.org</a>, (47) 92043220<BR>
Mundial (Ucraniano, Russo e Ingl&ecirc;s): Alexander Dymo, <a href="mailto:cloudtemple at mksat.net">cloudtemple at mksat.net</a>, (38) 0675122801<BR>
Mundial (Sueco e Ingl&ecirc;s): Jens Dagerbo, <a href="mailto:jens.dagerbo at swipnet.se">jens.dagerbo at swipnet.se</a><BR>
Mundial (Portugu&ecirc;s): Amilcar do Carmo Lucas, <a href="mailto:amilcar at ida.ing.tu-bs.de">amilcar at ida.ing.tu-bs.de</a><BR>

<?php module_tail(); ?>
