<?php module_head("Comunitatea KDevelop la LinuxTag 2001");?>

<h4>Oameni & KDevelop - LinuxTag 2001 &icirc;n Stuttgart/Germany</h4>
<table width="100%">
<tr>
<td colspan=2>
C&#259;uta&#x163;i mai multe Poze despre Comunitate?<br>
<a href="http://women.kde.org/events/">http://women.kde.org</a> con&#x163;ine o list&#259; aproape complet&#259; a URL-urilor cu galeriile de la LinuxTag.<br><br>
</td>
</tr>
<tr>
<td>
<a href="http://tfromm.com/linuxtag/DSCF0032.JPG">
<img src="http://tfromm.com/linuxtag/DSCF0032.JPG" height=200 width=260 border=0 alt="foto"></a>
</td><td>
LinuxTag este un eveniment foarte interesant &icirc;n Europa. Acolo este posibil s&#259; sta&#x163;i jos pentru
o vreme dac&#259; dori&#x163;i s&#259; citi&#x163;i email-uri &#x15F;i sta&#x163;i l&acirc;ng&#259; oameni cunoscu&#x163;i ca Jon Maddog Hall,
Eric S. Raymond. <br>Pe l&acirc;ng&#259; expozi&#x163;ia &icirc;n sine, unde pute&#x163;i g&#259;si proiecte interesante ca acela
de la Linux Group Japan (Linux pe Dreamcast), LinuxTag ofer&#259; un program bun de conferin&#x163;e 
pentru vizitatori.<br>Mai multe informa&#x163;ii despre LinuxTag pot fi g&#259;site <a href="http://www.linuxtag.org">aici</a>.<br>
</td>
</tr>
<tr>
<td>
Jon Maddog Hall vorbe&#x15F;te despre diferitele aspecte ale utiliz&#259;rii Linux.
</td>
<td>
<a href="http://tfromm.com/linuxtag/DSCF0033.JPG">
<img src="http://tfromm.com/linuxtag/DSCF0033.JPG" height=200 width=260 border=0 alt="foto"></a>
</td>
</tr>
<tr>
<td>
<a href="http://tfromm.com/linuxtag/DSCF0021.JPG">
<img src="http://tfromm.com/linuxtag/DSCF0021.JPG" height=200 width=260 border=0 alt="foto"></a>
</td><td>
Sandy Meier &#x15F;i Bernd Gehrmann vorbind despre tehnologii &#x15F;i viitorul KDevelop3
aka Gideon. Bernd este un tip foarte cool guy cu o cantitate imens&#259; de cuno&#x15F;tiin&#x163;e &#x15F;i experien&#x163;&#259;.
Ve&#x163;i fi de acord cu mine c&acirc;nd o sa vede&#x163;i ce face toat&#259; ziua ;-). 
</td>
</tr>
<tr>
<td>
Stephan a fost din nou acolo, a fost foarte vezel cu tricoul lui cu Kmud. 
(N-am crezut c&#259; <a href="http://www.kmud.de">Kmud</a> va ajunge la 1.0, dar, &icirc;n final el l-a lansat cu 
c&#259;teva zile &icirc;n urm&#259;).<br>
C&#259;nd nu era la vre-o prezentare, el discuta probleme tehnice cu
Echipa Kmud.<br>
Oameni la mas&#259; de la st&acirc;nga la dreapta:<br>
Andre Bell (Kmud)<br>
Sandy Meier (el lucareaz&#259; la un IDE free din c&acirc;te &#x15F;tiu...)<br>
Kevin Krammer (Kmud)<br>
Stephan Uhlmann (tricoul - uit&#259;-te la tricou!)<br>
Persoan&#259; necunoscut&#259;<br>
Sebastian Bergmann (cunoscut &icirc;n comunitatea PHP)<br>
Rasmus Lerdorf (fondatorul proiectului PHP)
</td><td>
<a href="http://tfromm.com/linuxtag/DSCF0012.JPG">
<img src="http://tfromm.com/linuxtag/DSCF0012.JPG" height=200 width=260 border=0 alt="foto"></a>
</td>
</tr>
<tr>
<td>
<a href="http://tfromm.com/linuxtag/DSCF0005.JPG">
<img src="http://tfromm.com/linuxtag/DSCF0005.JPG" height=200 width=260 border=0 alt="foto"></a>
</td><td>
La aceast&#259; discu&#x163;ie ei au f&#259;cut ceva cu DCOP &#x15F;i Python &icirc;n Kmud din c&acirc;te &icirc;mi amintesc.<br>
Nume de la st&acirc;nga la dreapta:<br>
Kevin Krammer, Andre Bell, Sandy Meier (Proiect necunoscut), Stephan Uhlmann (observa&#x163;i tricoul cu Kmud),
&#x15F;i &icirc;n fa&#x163;&#259; Marc Mutz (KMail) &#x15F;i &icirc;n spate Eric S. Raymond. 
(<a href="http://tfromm.com/linuxtag/DSCF0010.JPG">un prim-plan cu Raymond</a>)
</td>
</tr>
<tr>
<td>
Oric&acirc;nd, standul KDE era plin de vizitatori. Nu pot face nici o poza lui Ralf Nolden,
dar pot spunce c&#259;, de fiecare dat&#259; c&acirc;nd l-am v&#259;zut, el d&#259;dea suport de Primul Nivel clien&#x163;ilor ;-).<br>
</td><td>
<a href="http://tfromm.com/linuxtag/DSCF0034.JPG">
<img src="http://tfromm.com/linuxtag/DSCF0034.JPG" height=200 width=260 border=0 alt="foto"></a>
</td>
</tr>
<tr>
<td>
<a href="http://linuxtag.openit.de/2001/pictures/kde/0800x0600/p7061027-623b35.jpg">
<img border=0 alt="foto" src="http://linuxtag.openit.de/2001/pictures/kde/0160x0120/p7061027-623b35.jpg"></a>
</td><td>
Aici e o poz&#259; a tuturor dezvoltatorilor KDE la Stuttgart.<br>
(ah, apropos, st&acirc;nga-jos &icirc;n poz&#259;, omul de afaceri cu fa&#x163;&#259; vesel&#259; este Ralf Nolden ;-)<br>
Dar lipse&#x15F;te cineva... hmhm... cred c&#259; numele era Dl. Leyer, sau maier, nu-mi amintesc. Si, bine&icirc;n&#x163;eles, tuturor ne lipse&#x15F;te Walter Tasin zilele astea :-).
</td></tr>
<tr><td colspan=2>
Gata. Sper ca aceste c&acirc;teva fraze v&#259; vor convinge s&#259; veni&#x163;i la LinuxTag &icirc;n 2002.
Acum trebuie s&#259; spun 'mul&#x163;umesc' unui tip care mi-a dat o minge elastic&#259; transparent&#259; cu
un pingin &icirc;n&#259;untru (era de la compaq) &icirc;n ultima zi a t&acirc;rgului la standul KDE :-).
Un cadou foarte cool.
<br>
Ne vedem la LinuxTag 2002,<br>
toate bune,<br>
<a href="http://tfromm.com">Thomas</a> 
</td></tr>
</table>
<br>

<?php module_tail();?>






