<?php module_head("Comunitatea KDevelop la LinuxTag 2000");?>

<h4>Oameni & KDevelop - Impresii de la LinuxTag 2000 &icirc;n Stuttgart/Germany</h4>
<table width="100%">
<tr>
<td>
<a href="graphics/fotos/linuxtag2000/sitting.jpg">
<img src="graphics/fotos/linuxtag2000/sitting.jpg" height=200 width=260 border=0 alt="sitting"></a>
</td><td>
Aici sunt unele poze de la &icirc;nt&acirc;lnirea KDevelop la LinuxTag Stuttgart (29.6.-2.7.)
&Icirc;n poza din st&acirc;nga puteti vedea &icirc;n ultima linie de la st^nga la dreapta, Walter Tasin de la KDevelop 
core development, Stephan Uhlmann, el ESTE <a href="http://www.kmud.de">Kmud</a> &#x15F;i singura pagin&#259;
tradus&#259; &icirc;n spatele KDevelop KDevelop :-), o linie &icirc;n fa&#x163;&#259; este Mario Keller, 
el a mers cu noi la Stuttgart, nu este chiar implicat &icirc;n proiectul KDevelop, 
dar este un utilizator-K. &#x15E;i ultimul, dar nu cel din urm&#259; Sandy Meier, maintainer-ul nostru.<br>
Pentru cei ce &icirc;n&#x163;eleg germana, pute&#x163;i g&#259;si <a href="http://www.php-center.de/artikel/linuxtag.php3"> 
un raport</a> f&#259;cut de mine (mine &icirc;nseamn&#259; Thomas Fromm) al excursiei noastre la Stuttgart.<br>
At <a href="ftp://fara.cs.uni-potsdam.de/pub/linuxtag/2000/">site-ul nostru de FTP</a> pute&#x163;i g&#259;si
unele poze de la stand-ul <a href="http://www.php.net">PHP</a>. Primele zvonuri spun ca sunt planuri de
cooperare cu stand-ul PHP la LinuxTag 2001. ( Sper ca KDevelop 2 s&#259; suporte PHP
p&acirc;n&#259; atunci :-) ).
</td>
</tr>
<tr>
<td>
Aici pute&#x163;i vedea (de la st&acirc;nga la dreapta) Ralf Nolden cunoscut din lista de email, el erte de asemenea
primul la recit&#259;ri &#x15F;i este tipul cu un calculator dr&#259;gu&#x163; PIII/600 de la SCO :-). 
</td><td>
<td>
<a href="graphics/fotos/linuxtag2000/group.jpg">
<img src="graphics/fotos/linuxtag2000/group.jpg" height=200 width=260 border=0 alt="group"></a>
</td>
</tr>
<tr>
<td>
<a href="graphics/fotos/linuxtag2000/wtasin.jpg">
<img src="graphics/fotos/linuxtag2000/wtasin.jpg" height=200 width=260 border=0 alt="wtasin"></a>
</td><td>
Walter Tasin. To&#x163;i &icirc;l cunoa&#x15F;tem ca omul care schimb&#259; defec&#x163;iuni &icirc;n calit&#259;&#x163;i :-).<bR>
Zvonurile spun c&#259; el scrie parser-ul de PHP. La sec&#x163;iunea Who's'Who Section la care
lucrez acum, el v&#259; va spune ce face.
</td>
</tr>
<tr>
<td>
Stephan Uhlmann, programator faimos &#x15F;i maintainer al <a href="http://www.kmud.de">Kmud</a>
&#x15F;i lucreaz&#259; la alte proiecte interesante. Afla&#x163;i singur(&#259;) la
<a href="http://www.cs.uni-potsdam.de/~uhlmann/">pagina lui</a> de web. El a fost singurul care n-a ob&#x163;inut
un <a href="http://www.guug.de:8080/fotos/linuxtag/images/lk2k025-pUILMLDgy.jpg">pinguin cu piuitoare de la HP</a>,
din to&#x163;i participan&#x163;ii la LinuxTag ! (Daca cineva de la HP cite&#x15F;te asta, poate ei &icirc;i pot trimite unul :-) )
</td><td>
<a href="graphics/fotos/linuxtag2000/uhlmann.jpg">
<img src="graphics/fotos/linuxtag2000/uhlmann.jpg" height=200 width=260 border=0 alt="uhlmann"></a>
</td>
</tr>
<tr>
<td>
<a href="graphics/fotos/linuxtag2000/smeier.jpg">
<img src="graphics/fotos/linuxtag2000/smeier.jpg" height=200 width=260 border=0 alt="smeier"></a>
</td><td>
Sandy Meier. He conduce un mic proiect numit KDevelop. A auzit cineva de a&#x15F;a ceva?<br>
&Icirc;n afar&#259; de KDevelop, &icirc;i place s&#259; programeze &icirc;n PHP, de aceea KDevelop va avea PHP :-).
Stephan, Sandy &#x15F;i cu mine lucr&#259;m &icirc;n Berlin la un start-up <a href="http://www.inubit.com">InUBIT</a>.
Ei au semnalat c&#259; vor s&#259; sponsorizeze stand-ul la LinuxTag 2001.
</td>
</tr>
<tr>
<td>
Ralf d&#259; suport la primul nivel.
</td><td>
<a href="graphics/fotos/linuxtag2000/rnolden.jpg">
<img src="graphics/fotos/linuxtag2000/rnolden.jpg" height=200 width=260 border=0 alt="rnolden"></a>
</td>
</tr>
<tr>
<td colspan=2>

Okay asta a fost. Mentru mai multe informa&#x163;ii despre LinuxTag Stuttgart vede&#x163;i <a href="http://www.linuxtag.de">aici</a>.
Mai multe impresii &#x15F;i poze despre &icirc;ntreaga Petrecere pot fi g&#259;site <a href="http://www.guug.de:8080/fotos/linuxtag/story/">aici</a>.<br>
<br>
Ne vedem la Linuxday 2001,<br>
Cu respect,<br>
<a href="http://tfromm.com">Thomas</a> 
</td></tr>
</table>

<?php module_tail();?>
