<?php module_head("KDevelop 3.0 release Anouncement"); ?>

<P>DATADO DE 03 FEVEREIRO DE 2004</P>
<P>PARA LAN&Ccedil;AMENTO IMEDIATO</P>
<H3 ALIGN="center">An&uacute;ncio de lan&ccedil;amento do KDevelop 3.0</H3>
<P><STRONG>A Equipe do KDevelop faz o Lan&ccedil;amento de Importantes Funcionalidades do Premiado IDE de C&oacute;digo Aberto</STRONG></P>
<P>03 de Fevereiro de 2004 (A INTERNET).
A Equipe do KDevelop est&aacute; orgulhosa em apresentar KDevelop 3.0, o primeiro grande lan&ccedil;amento
do completamente reestcrito, premiado Ambiente de Desenvolvimento Integrado (IDE).
</P>
<P>
"O KDevelop &eacute; a chave para se alcan&ccedil;ar novos n&iacute;veis de produtividade. Ele &eacute; um IDE apropriado
para todas as tarefas desde programa&ccedil;&atilde;o de sistemas at&eacute; desenvolvimento r&aacute;pido de interfaces para
usu&aacute;rio (GUI RAD). Integrando todas as ferramentas convencionais para desenvolvimento no UNIX,
provendo suporte a linguagens, KDevelop &eacute; uma excelente escolha para desenvolvedores UNIX.
Dispon&iacute;vel para diferentes plataformas como Mac OS X e Windows/Cygwin, o KDevelop &eacute; uma
grande ferramenta para desenvolvimento multi-plataforma. Apoio nas ferramentas comuns de
desenvolvimento permite desvolver aplica&ccedil;&otilde;es para um vasto n&uacute;mero de plataformas
incluindo plataformas embutidas" disse Alexander Dymo, co-mantenedor do projeto.
</P>
<P>
"Com um n&uacute;cleo independente de linguagens, baseado em plugins e com vasto suporte &agrave;s
ferramentas comuns de desenvolvimento, o KDevelop j&aacute; &eacute; de fato o IDE padr&atilde;o para desenvolvimento
para desktops Linux/Unix" acrescentou Harald Fernengel, membro antigo do projeto.
</P>
<P>
"A equipe do KDevelop fez um excelente trabalho com este lan&ccedil;amento. Mais de 40 desenvolvedores
contribu&iacute;ram com o projeto num espa&ccedil;o de tempo de 14 meses. Voc&ecirc; notar&aacute; que foi tomado muito cuidado
com a documenta&ccedil;&atilde;o e com a interface com o usu&aacute;rio. Esta ves&atilde;o &eacute; poderosa, al&eacute;m de ser
f&aacute;cil de usar" observou Amilcar do Carmo Lucas, co-coordenador de lan&ccedil;amento.
</P>

<H4>Grandes Melhorias</H4>
<P>
KDevelop agora d&aacute; suporte a mais de 15 linguagens de programa&ccedil;&atilde;o e v&aacute;rios sistemas de controle
de vers&atilde;o, <i>debuggers</i>, formatos de documenta&ccedil;&atilde;o e ferramentas de compila&ccedil;&atilde;o. Qualquer editor que
suporta as interfaces do KTextEditor pode ser utilizado como editor nativo do KDevelop incluindo
kate, QEditor e kvim. Ferramentas de compila&ccedil;&atilde;o como automake, qmake ou ant s&atilde;o suportadas
nativamente, o que significa que o KDevelop n&atilde;o n&atilde;o seu pr&oacute;prio reposit&oacute;rio de objetos.
Modifica&ccedil;&otilde;es nos arquivos nativos do projeto ir&atilde;o refletir no KDevelop e vice-versa.
</P><P>
O suporte a C++ oferece uma vis&atilde;o das classes, mostrando todos os s&iacute;mbolbos de forma simples
ou hierarquica por <i>namespaces</i> e permite f&aacute;cil navega&ccedil;&atilde;o pelo c&oacute;digo. Um interpretador em
background atualiza os s&iacute;mbolos automaticamente e tamb&eacute;m mostra erros sint&aacute;ticos no c&oacute;digo-fonte.
O recurso de <i>code completion</i> tamb&eacute;m lid&aacute; com os recursos de <i>signals</i> e <i>slots</i>
do <i>toolkit</i> Qt.
</P><P>
Com sua nova arquitetura aberta, o KDevelop pode ser personalizado em v&aacute;rios aspectos.
A interface com o usu&aacute;rio pode ser chaveada a qualquer momento do cl&aacute;ssico modo MDI para
o moderno modo IDEAl, oferecendo uma abordagem centrada no c&oacute;digo com vis&otilde;es das
ferramentas por demanda.
</P><P>
O KDevelop oferece um suporte estensivo para navega&ccedil;&atilde;o no c&oacute;digo-fonte. S&iacute;mbolos e
nomes de arquivos podem ser acessados apenas digitando parte do nome. Arquivos modificados
recentemente podem ser recuperados com uma simples combina&ccedil;&atilde;o de teclas.
</P><P>
O KDevelop oferece geradores de documenta&ccedil;&atilde;o, depura&ccedil;&atilde;o de c&oacute;digo, verifica&ccedil;&atilde;o de mem&oacute;ria,
reengenharia de c&oacute;digo, gerenciamento de <i>bookmarks</i>, e d&uacute;zias de ferramentas que tornam o
desenvolvimento f&aacute;cil e conveniente. Al&eacute;m disto, ele &eacute; traduzido em mais de 16 idiomas
do Ingl&ecirc;s ao Tamil.
</P>

<H4>Instalando os pacotes bin&aacute;rios do KDevelop 3.0</H4>
<P>
Pacotes bin&aacute;rios para todas as grandes distribui&ccedil;&otilde;es do Linux podem ser encontrados em <a href="http://www.kdevelop.org/index.html?filename=3.0/download.html">http://www.kdevelop.org/index.html?filename=3.0/download.html</a>.
</P><P>
Uma vers&atilde;o alfa do bin&aacute;rio nativo para o Mac OS X pode ser encontrado em <a href="http://kde.opendarwin.org">http://kde.opendarwin.org</a>.
</P><P>
O projeto kde-cygwin prov&ecirc; o KDevelop em <a href="http://kde-cygwin.sourceforge.net/kde3/installation.php">http://kde-cygwin.sourceforge.net/kde3/installation.php</a>.
</P><P>
Favor observar que a equipe do KDevelop n&atilde;o fornece os bin&aacute;rios - todos os pacotes s&atilde;o
disponibilizados por terceiros.
</P>

<H4>Compilando o KDevelop 3.0</H4>
<P>
O c&oacute;digo-fonte completo do KDevelop 3.0 pode ser baixado gratuitamente no site
 <a href="http://www.kdevelop.org/">http://www.kdevelop.org</a>. Informa&ccedil;&otilde;es detalhadas para compila&ccedil;&atilde;o podem ser encontradas em <a href="http://www.kdevelop.org/index.html?filename=3.0/branches_compiling.html">http://www.kdevelop.org/index.html?filename=3.0/branches_compiling.html</a>.
</P>


<H4>Sobre o KDevelop</H4>
<P>
O KDevelop &eacute; um projeto independente, para se criar um ambiente de desenvolvimento integrado (IDE)
poderoso e de f&aacute;cil utiliza&ccedil;&atilde;o. Como parte do projeto KDE, KDevelop compartilha o mesmo
modelo de desenvolvimento e estrutura modular compartilhada. O resultado &eacute; um IDE altamente
personaliz&aacute;vel, independente de linguagem de programa&ccedil;&atilde;o e licenciado sobre a GPL
por d&uacute;zias de desenvolvedores e profissionais espalhados pelo mundo. Para saber mais
sobre o KDevelop veja <a href="http://www.kdevelop.org">http://www.kdevelop.org</a>.
</P>


<H4>Sobre o KDE</H4>

<P>
KDE &eacute; um projeto independente com centenas de desenvolvedores, tradutores, artistas e outros
profissionais espalhados pelo mundo colaborando pela Interner para se criar e distribuir
gratuitamente um sofisticado, personaliz&aacute;vel e est&aacute;vel ambiente para desktop e escrit&oacute;rios
empregando uma arquitetura flex&iacute;vel, baseada em componentes, transparente a rede e oferecendo
uma excepcional plataforma para desenvolvimento. O KDE prov&ecirc; um est&aacute;vel e maduro desktop,
uma suite de escrit&oacute;rio (KOffice) completo e baseado em coponentes, um vasto conjunto de
ferramentas e utilit&aacute;rios administrativos e de rede e um eficiente e intuitivo ambiente
de desenvolvimento com o IDE KDevelop. KDE &eacute; uma prova funcional de um software de C&oacute;digo
Aberto do "Estilo Bazar" de desenvolvimento, que pode se comparar ou at&eacute; superar tecnologias de
ponta dos sistemas comerciais mais complexos.
</P>
<BR><BR>
<HR NOSHADE SIZE=1 WIDTH="90%" ALIGN="center">
<FONT SIZE=2>
<EM>Lan&ccedil;amento na Imprensa:</EM> Escrito por Harald Fernengel, com a ajuda valiosa de v&aacute;rios volunt&aacute;rios generosos do projeto KDE.<BR>
<EM>Coordenadores de Lan&ccedil;amento:</EM> Agradecimentos a Alexander Dymo e Amilcar do Carmo Lucas pelos seus servi&ccedil;os como coordenadores de lan&ccedil;amento.<BR>
<EM>Observa&ccedil;&otilde;es sobre Marcas Registradas:</EM>
KDE e K Desktop Enviroment s&atilde;o marcas registradas da KDE e.V. Linux &eacute; uma marca registrada
de Linus Torvalds. UNIX &eacute; uma marca registrada do The Open Group nos Estados Unidos da Am&eacute;rica
e em outros pa&iacute;ses. Todas as outras marcas registradas e copyrights referidos neste an&uacute;ncio s&atilde;o
propriedades de seus respectivos donos.
<BR>
</FONT>
<HR NOSHADE SIZE=1 WIDTH="90%" ALIGN="center">

<H4>Contatos Publicit&aacute;rios:</H4>

Mundialmente (Alem&atilde;o e Ingl&ecirc;s): Harald Fernengel, <a href="mailto:harry at kdevelop.org">harry at kdevelop.org</a>, (47) 92043220<BR>
Mundialmente (Ucraniano, Russo e Ingl&ecirc;s): Alexander Dymo, <a href="mailto:cloudtemple at mksat.net">cloudtemple at mksat.net</a>, (38) 0675122801<BR>
Mundialmente (Sueco e Ingl&ecirc;s): Jens Dagerbo, <a href="mailto:jens.dagerbo at swipnet.se">jens.dagerbo at swipnet.se</a><BR>
Mundialmente (Portugu&ecirc;s): Amilcar do Carmo Lucas, <a href="mailto:amilcar at ida.ing.tu-bs.de">amilcar at ida.ing.tu-bs.de</a><BR>
Mundialmente (Italiano): Roberto Raggi, <a href="mailto:roberto at kdevelop.org">roberto at kdevelop.org</a><BR>

<?php module_tail(); ?>
