<?php module_head("KDE_3_2_BRANCH (hoje)");?>
Este &eacute; o ramo <b>est&aacute;vel</b>. Ele corrensponder&aacute; a futura vers&atilde;o 3.0.5 do KDevelop
(ainda n&atilde;o lan&ccedil;ada).<br>
Ele suporta o <b>KDE 3.x</b>.
<ul>
</ul>
<?php module_tail();?>

<?php module_head("3.0.4 (2004-06-09)");?>
Ele suporta o <b>KDE 3.x</b>. Foi marcado em 2004-05-30 e lan&ccedil;ado em 2004-06-09.
<ul>
  <li>MELHORADO - Satisfaz novos compiladores haskel e n&atilde;o retorna dados aleat&oacute;rios.</li>
  <li>MELHORADO - Traduções da GUI: Hindu e Esloveno.</li>
  <li>CORRIGIDO - <a href="http://bugs.kde.org/show_bug.cgi?id=81579">81579: N&atilde;o trava quando usu&aacute;rio tenta  adicionar um m&eacute;todo ("add method") sem selecionar uma classe</a>.</li>
  <li>CORRIGIDO - <a href="http://bugs.kde.org/show_bug.cgi?id=71099">71099: Agora o importador conhece mais ue sufixos de cabe&ccedil;alho al&eacute;m do .h</a></li>
  <li>CORRIGIDO - <a href="http://bugs.kde.org/show_bug.cgi?id=79794">79794: N&atilde;o trava quando n&atilde;o existe nenhum controlador para application/x-designer escolhido</a>.</li>
</ul>
<?php module_tail();?>

<?php module_head("3.0.3 (2004-04-19)");?>
Ele suporta o <b>KDE 3.x</b>. Foi marcado em 2004-04-11 e lan&ccedil;ado em 2004-04-19.
<ul>
  <li>MELHORADO - Bookmarks da documenta&ccedil;&atilde;o.<li>
  <li>MELHORADO - Traduções da GUI: Dinamarquês, Alemão, Inglês Britânico, Espanhol, Estónio,
Francês, Húngaro, Italiano, Polaco, Português, Brasileiro, Sérvio, Sueco, Catalão, Japonês, Holandês, Russo, Tamil e Chinês Simplificado.</li>
  <li>CORRIGIDO    - Um caso onde os itens selecionados que desapareciam devido a eventos sistema de arquivos poderiam travar a FileTree.</li>
  <li>CORRIGIDO    - V&aacute;rios interpretadores de linguagens foram atualizados para utilizar o QRegExp ao inv&eacute;s do depreciado KRegExp. <a href="http://bugs.kde.org/show_bug.cgi?id=73754">#73754</a>, <a href="http://bugs.kde.org/show_bug.cgi?id=63973">#63973</a> </li>
  <li>CORRIGIDO    - <a href="http://bugs.kde.org/show_bug.cgi?id=74570">74570: Makefiles pr&oacute;prios n&atilde;o suportam o arquivo "GNUmakefile"</a> (N&atilde;o tenta adivinhar o make.)</li>
  <li>CORRIGIDO    - <a href="http://bugs.kde.org/show_bug.cgi?id=75172">75172: A troca de projeto com arquivos n&atilde;o salvos</a> (N&atilde;o atualiza o marcador de projetos recente quando o usu&aacute;rio cancela a troca de projeto.)</li>
  <li>CORRIGIDO    - <a href="http://bugs.kde.org/show_bug.cgi?id=75943">75943: Trava durante a varredura de diret&oacute;rios</a> (N&atilde;o trava quando n&atilde;o se tem permiss&atilde;o para ler o diret&oacute;rio.)</li>
  <li>CORRIGIDO    - <a href="http://bugs.kde.org/show_bug.cgi?id=77278">77278: O componente do Grep falha ao procurar quando h&aacute; caracteres de espa&ccedil;o no caminho</a> </li>
  <li>CORRIGIDO    - <a href="http://bugs.kde.org/show_bug.cgi?id=78776">78776: Trava no  CustomProjectPart::populateProject populando um novo projeto</a> </li>
</ul>
<?php module_tail();?>

<?php module_head("3.0.2 (2004-03-09)");?>
Ele suporta o <b>KDE 3.x</b>. Foi marcado em 2004-02-28 e lan&ccedil;ado em 2004-03-09.
<ul>
    <LI>MELHORADO - Melhorou bastante o Manual do Usu&aacute;rio do KDevelop.</LI>
    <LI>MELHORADO - O parser C++ est&aacute; duas vezes mais r&aacute;pido e mais eficiente no uso de mem&oacute;ria.</LI>
    <LI>MELHORADO - O script de configura&ccedil;&atilde;o agora permite desabilitar a compila&ccedil;&atilde;o de certas partes do KDevelop.</LI>
    <LI>MELHORADO - Di&aacute;logos de configura&ccedil;&atilde;o mais r&aacute;pidos e leves - as p&aacute;ginas mais pesadas s&atilde;o agora carregadas sobre demanda.</LI>
    <LI>MELHORADO - O plugin FileGroups &eacute; agora mais esperto ao aplicar as express&otilde;es regulares - muito mais r&aacute;pido para defini&ccedil;&otilde;es comuns aos grupos (<a href="http://bugs.kde.org/show_bug.cgi?id=72831">#72831</a>)</LI>
    <LI>MELHORADO - Removido o gargalo de performance que fazia a interpreta&ccedil;&atilde;o inical de um projeto muito lenta. (veja <a href="http://bugs.kde.org/show_bug.cgi?id=73671">#73671</a>)</LI>
    <li>CORRIGIDO    - Plugin do grep : N&atilde;o trava as vezes quanto interrompe uma busca quando uma compilando est&aacute; acontecendo.</li>
    <li>CORRIGIDO    - Plugin do grep : N&atilde;o se confunde com arquivos com nomes muito similares e evita pontenciais buscas lentas do tipo O(n).</li>
    <li>CORRIGIDO    - Plugin do grep : N&atilde;o mostra lixo - faz uma limpeza ap&oacute;s uma execu&ccedil;&atilde;o pr&eacute;via interrompida.</li>
    <LI>ACRESCENTADO    - Um novo novo modelo "Simple Designer based KDE application" foi adicionado.</LI>
    <LI>CORRIGIDO    - Finalmente o imfame <i>bug</i> "Gentoo-crash" foi encontrado e corrigido. (<a href="http://bugs.kde.org/show_bug.cgi?id=73346">#73346</a>)</LI>
    <li>CORRIGIDO    - Um caso em que na execu&ccedil;&atilde;o de um programa que produz um monte de sa&iacute;das de depura&ccedil;&atilde;o poderia travar o KDevelop (<a href="http://bugs.kde.org/show_bug.cgi?id=67217">#67217</a>, <a href="http://bugs.kde.org/show_bug.cgi?id=71858">#71858</a>) </li>
    <li>CORRIGIDO    - <a href="http://bugs.kde.org/show_bug.cgi?id=73045">#73045</a> : chavear os controles acopl&aacute;veis (<i>docks</i>) quando nenhum arquivo est&aacute; carregado trava o kdevelop.</li>
    <li>CORRIGIDO    - <a href="http://bugs.kde.org/show_bug.cgi?id=73672">#73672</a> : kdevelop parece estranho ap&oacute;s prever alguns formul&aacute;rios no KUIViewer.</li>
    <li>CORRIGIDO    - <a href="http://bugs.kde.org/show_bug.cgi?id=73716">#73716</a> : fechar todos no menu de contexto com dois documentos modificados n&atilde;o parece cancelar corretamente.</li>
    <li>CORRIGIDO    - <a href="http://bugs.kde.org/show_bug.cgi?id=74585">#74585</a> : N&atilde;o &eacute; poss&iacute;vel depurar o programa em C++ Hello World.</li>
    <li>CORRIGIDO    - <a href="http://bugs.kde.org/show_bug.cgi?id=74650">#74650</a> : Listas <i>drop-down</i> das <i>combo views</i> da <i>toolbar</i> n&atilde;o aparecem com efeitos UI ligados.</li>
    <li>CORRIGIDO    - <a href="http://bugs.kde.org/show_bug.cgi?id=74712">#74712</a> : Automake 1.8.x n&atilde;o suportado.</li>
    <li>CORRIGIDO    - <a href="http://bugs.kde.org/show_bug.cgi?id=74955">#74955</a> : Trava quando trabalha com projetos ANT Java.</li>
    <LI>CORRIGIDO    - V&aacute;rias outras coisinhas que esquecemos...</LI>
</ul>
<?php module_tail();?>

<?php module_head("3.0.1 (2004-02-16)");?>
Ele suporta o <b>KDE 3.x</b>.
<ul>
  <li>MELHORADO - Manual do Usu&aacute;rio.
  <li>MELHORADO - V&aacute;rios <i>typos</i> consertados.
  <li>MELHORADO - O arquivo de afazeres foi restruturado e atualizado.
  <li>MELHORADO - Modelo do KCModule Template para usar a API do KDE 3.0 e KGenericFactory.
  <li>MELHORADO - Atualizado para a vers&atilde;o mais recente do Doxygen.
  <li>MELHORADO - Faz os fontes gerados com appwizard honrarem os modelos dos arquivos selecionados.
  <li>MELHORADO - Documenta&ccedil;&atilde;o do Clanlib
  <li>MELHORADO - Pergunta se o usu&aacute;rio tenta recarregar o projeto j&aacute; aberto.
  <li>MELHORADO - Modelos de projeto, ignorando documenta&ccedil;&atilde;o irrelevante e outros pequenos consertos.
  <li>ACRESCENTADO    - Acrescentou a classe ConfigWidgetProxy para configurar suporte a carga por demanda de widgets (reduz uso de mem&oacute;ria).
  <li>ACRESCENTADO    - SearchText no QEditor
  <li>ACRESCENTADO    - Possibilidade de trocar o tamanho da fonte no navegador de documenta&ccedil;&atilde;o.
  <li>CORRIGIDO    - Fez o suporte a linguagem Haskell funcionar novamente
  <li>CORRIGIDO    - Limpar todos os breakpoints
  <li>CORRIGIDO    - Um caso em que arquivos n&atilde;o salvos n&atilde;o eram solicitados para serem salvos quando o KDevelop era fechado.
  <li>CORRIGIDO    - <a href="http://bugs.kde.org/show_bug.cgi?id=58999">Bug 58999</a> : Debugger n&atilde;o ir&aacute; iniciar (problema com a libtool)
  <li>CORRIGIDO    - <a href="http://bugs.kde.org/show_bug.cgi?id=62888">Bug 62888</a> : Bot&otilde;es voltar e avan&ccedil;ar dispon&iacute;veis no menu de contexto.
  <li>CORRIGIDO    - <a href="http://bugs.kde.org/show_bug.cgi?id=69035">Bug 69035</a> : "Run Options" n&atilde;o honradas (makefiles personalizados)
  <li>CORRIGIDO    - <a href="http://bugs.kde.org/show_bug.cgi?id=70175">Bug 70175</a> : Problemas na vers&atilde;o de teste minima do wxWindows.
  <li>CORRIGIDO    - <a href="http://bugs.kde.org/show_bug.cgi?id=70176">Bug 70176</a> : wxWindows apptemplate quebrou a compila&ccedil;&atilde;o com wxWindows compilado com Unicode
  <li>CORRIGIDO    - <a href="http://bugs.kde.org/show_bug.cgi?id=71003">Bug 71003</a> : N&atilde;o &eacute; poss&iacute;vel traduzir projeto, pois srcdir != builddir.
  <li>CORRIGIDO    - <a href="http://bugs.kde.org/show_bug.cgi?id=72502">Bug 72502</a> : Kdevelop trava quando varios arquivos s&atilde;o fechados atrav&eacute;s do teclado.
  <li>CORRIGIDO    - <a href="http://bugs.kde.org/show_bug.cgi?id=72523">Bug 72523</a> : Di&aacute;logo do Grep n&atilde;o &eacute; pr&eacute;-populado com texto selecionado.
  <li>CORRIGIDO    - <a href="http://bugs.kde.org/show_bug.cgi?id=72552">Bug 72552</a> : O &iacute;cone de mudan&ccedil;as n&atilde;o salvas desaparece mesmo quando a opera&ccedil;&atilde;o de grava&ccedil;&atilde;o n&atilde;o foi realizada.
  <li>CORRIGIDO    - <a href="http://bugs.kde.org/show_bug.cgi?id=72582">Bug 72582</a> : Travamento enquanto carrega plugins depois de descarregar plugins.
  <li>CORRIGIDO    - <a href="http://bugs.kde.org/show_bug.cgi?id=73025">Bug 73025</a> : expandir o texto (ctrl+J) trava o kdevelop.
  <li>CORRIGIDO    - <a href="http://bugs.kde.org/show_bug.cgi?id=73039">Bug 73039</a> : ferramentas cvs tools podem travar o kdevelop.
  <li>CORRIGIDO    - <a href="http://bugs.kde.org/show_bug.cgi?id=73116">Bug 73116</a> : Kdevelop trava quando digita um ponto no fim de um coment&aacute;rio.
  <li>CORRIGIDO    - <a href="http://bugs.kde.org/show_bug.cgi?id=73467">Bug 73467</a> : make clean incompleto para parts/appwizard/common.
  <li>CORRIGIDO    - <a href="http://bugs.kde.org/show_bug.cgi?id=73567">Bug 73567</a> : Utiliza&ccedil;&atilde;o de -u ao inv&eacute;s de -u3 desde que este &eacute; obsoleto.
  <li>CORRIGIDO    - <a href="http://bugs.kde.org/show_bug.cgi?id=74955">Bug 74955</a> : Trava quando trabalhando com projeto ANT Java.
</ul>
<?php module_tail();?>

<?php module_head("3.0.0 (2004-02-03)");?>
Release Candidate 1 (marcado em 2004-01-19) foi lan&ccedil;ado como 3.0.0 sem modifica&ccedil;&otilde;es.
<ul>
  <li>NOVO      - Deve compilar direito no Mac OS X.
  <li>NOVO      - Deve compilar direito no cygwin.
  <li>MELHORADO - Splashscreen.
  <li>MELHORADO - Suporte a Doxygen.
  <li>ACRESCENTADO    - Links no navegador de documenta&ccedil;&atilde;o para o banco de dados de registro de bugs de toda linguagem de programa&ccedil;&atilde;o suportada (except SQL).
  <li>ACRESCENTADO    - Links no navegador de documenta&ccedil;&atilde;o para o banco de dados de registro de bugs dos toolkits de desenvolvimento Gtk e wxWindows.
  <li>CORRIGIDO    - Novamente a compila&ccedil;&atilde;o no KDE 3.0.x.
  <li>CORRIGIDO    - alguns bugs na GUI.
  <li>CORRIGIDO    - 3 bugs do KDevelop2.x e vers&otilde;es de s&eacute;ries de lan&ccedil;amento anteriores.
  <li>CORRIGIDO    - 49 bugs espec&iacute;ficos do KDevelop3.0.
</ul>
Eis uma <a href="http://bugs.kde.org/buglist.cgi?product=kdevelop&amp;resolution=CORRIGIDO&amp;resolution=WORKSFORME&amp;bugidtype=include&amp;chfield=resolution&amp;chfieldfrom=2003-12-02&amp;chfieldto=2004-01-19&amp;order=Bug+Number&amp;cmdtype=doit">vers&atilde;o interativa</a> dos <i>bugs</i> corrigidos.<br>
Para uma lista mais detalhada das modifica&ccedil;&otilde;es visite o <a href="http://webcvs.kde.org/cgi-bin/cvsweb.cgi/kdevelop/ChangeLog?r1=1.1101&amp;r2=1.1099">Registro de mudan&ccedil;as do CVS</a>.
<?php module_tail();?>

<?php module_head("3.0.0 beta 2 (2003-12-01)");?>
<ul>
  <li>NOVO      - KDE-accels Ctrl+Shift+Alt+L/R/B/T para IDEAl-docks e Ctrl+Alt+CursorLeft/CursorRight para  IDEAl-toolviews c&iacute;clicos.
  <li>NOVO      - Feedback de cor do controle de vers&atilde;o para a vista de arquivos (atualmente implementado apenas por plugin vcs/cvsservice).
  <li>MELHORADO - parser do pascal, n&atilde;o mais &eacute; restrito ao pascal-78.
  <li>MELHORADO - A maior parte das estens&otilde;es de object pascal/delphi s&atilde;o suportadas
  <li>MELHORADO - pode chavear todos os modos UI do KDevelop UI ao vivo.
  <li>MELHORADO - salva o estado dos acoplamentos para ma outra sess&atilde;o do kdeveloprc (para permitir que pessoas (que tentaram as vers&otilde;es alpha do KMdi) fugir de um c&iacute;rculo vicioso).
  <li>ACRESCENTADO    - um arquivo kdevelop.kdevelop mais limpo.
  <li>CORRIGIDO    - 7  bugs do KDevelop2.x e de vers&otilde;es anteriores.
  <li>CORRIGIDO    - 88 bugs espec&iacute;ficos do KDevelop3.0.
</ul>
Eis uma <a href="http://bugs.kde.org/buglist.cgi?product=kdevelop&amp;resolution=CORRIGIDO&amp;resolution=WORKSFORME&amp;bugidtype=include&amp;chfield=resolution&amp;chfieldfrom=2003-10-26&amp;chfieldto=2003-12-02&amp;order=Bug+Number&amp;cmdtype=doit">vers&atilde;o interativa</a> dos <i>bugs</i> corrigidos.<br>
Para uma lista mais detalhada das modifica&ccedil;&otilde;es visite o <a href="http://webcvs.kde.org/cgi-bin/cvsweb.cgi/kdevelop/ChangeLog?r1=1.1099&amp;r2=1.1092">Registro de mudan&ccedil;as do CVS</a>.
<?php module_tail();?>

<?php module_head("3.0.0 beta 1 (2003-10-26)");?>
<ul>
  <li>NOVO      - NOVOS modelos de aplica&ccedil;&atilde;o em cpp: kateplugin2, noatunvisual, noatunui, kbearimportfilter, kbearplugin, kfileplugin
  <li>NOVO      - Documenta&ccedil;&atilde;o da API do KDevelop On-line, automaticamente atualizada a cada 24h, pode ser vista com o doctreeview.
  <li>MELHORADO - mudou a documenta&ccedil;&atilde;o espec&iacute;fica de linguagens para os diret&oacute;rios languages/xxx/doc
  <li>MELHORADO - NOVA parte subversion adicionada para substituir a antiga svn
  <li>MELHORADO - Interface com usu&aacute;rio MDI
  <li>MELHORADO - Suporte a linguagem Ada (portou para o modelo de c&oacute;digo e reabilitou parsing em plano de fundo).
  <li>MELHORADO - Renomeou o execut&aacute;vel do KDevelop de gideon para kdevelop. Isto faz o KDevelop3 SOBRESCREVER as instala&ccedil;&otilde;es do KDevelop 2.x.
  <li>MELHORADO - Restruturou os diret&oacute;rios de acordo com a documenta&ccedil;&atilde;o da API
  <li>ACRESCENTADO    - argumentos de execu&ccedil;&atilde;o por alvo ao gerenciador do automake.
  <li>CORRIGIDO    - 4  bugs do KDevelop2.x e vers&otilde;es ateriores.
  <li>CORRIGIDO    - 23 bugs espec&iacute;ficos do KDevelop3.0.
</ul>
Eis uma <a href="http://bugs.kde.org/buglist.cgi?product=kdevelop&amp;resolution=CORRIGIDO&amp;resolution=WORKSFORME&amp;bugidtype=include&amp;chfield=resolution&amp;chfieldfrom=2003-09-24&amp;chfieldto=2003-10-26&amp;order=Bug+Number&amp;cmdtype=doit">vers&atilde;o interativa</a> dos <i>bugs</i> corrigidos.<br>
Para uma lista mais detalhada das modifica&ccedil;&otilde;es visite o <a href="http://webcvs.kde.org/cgi-bin/cvsweb.cgi/kdevelop/ChangeLog?r1=1.1092&amp;r2=1.1082">Registro de mudan&ccedil;as do CVS</a>.
<?php module_tail();?>

<?php module_head("3.0.0 alpha 7 (2003-09-24)");?>
<ul>
  <li>NOVO      - diret&oacute;rio de mimetypes na &aacute;rvore de fontes do KDevelop
  <li>MELHORADO - GUI para habulitar e desabilitar os t&oacute;picos da documenta&ccedil;&atilde;o no di&aacute;logo de configura&ccedil;&atilde;o de projeto
  <li>MELHORADO - dicas de UI, accels e ordena&ccedil;&atilde;o tab
  <li>MELHORADO - Manual do Usu&aacute;rio
  <li>MELHORADO - Documenta&ccedil;&atilde;o da API
  <li>ACRESCENTADO    - popup menu para o visualizado de documenta&ccedil;&atilde;o
  <li>ACRESCENTADO    - mime types de x-fortran, x-pascal e chm (HTML Help)
  <li>CORRIGIDO    - v&aacute;rios erros de ortografia foram corrigidos! :)
  <li>CORRIGIDO    - compila&ccedil;&atilde;o enable-final
  <li>CORRIGIDO    - 4  bugs do KDevelop2.x vers&otilde;es anteriores.
  <li>CORRIGIDO    - 13 bugs espec&iacute;ficos do KDevelop3.0.
</ul>
Eis uma <a href="http://bugs.kde.org/buglist.cgi?product=kdevelop&amp;resolution=CORRIGIDO&amp;resolution=WORKSFORME&amp;bugidtype=include&amp;chfield=resolution&amp;chfieldfrom=2003-09-11&amp;chfieldto=2003-09-24&amp;order=Bug+Number&amp;cmdtype=doit">vers&atilde;o interativa</a> dos <i>bugs</i> corrigidos.<br>
Para uma lista mais detalhada das modifica&ccedil;&otilde;es visite o <a href="http://webcvs.kde.org/cgi-bin/cvsweb.cgi/kdevelop/ChangeLog?r1=1.1082&amp;r2=1.1080">Registro de mudan&ccedil;as do CVS</a>.
<?php module_tail();?>

<?php module_head("3.0.0 alpha 6 (2003-09-10)");?>
<ul>
  <li>NOVO      - Class store
  <li>NOVO      - Plugin compilador de Delphi
  <li>NOVO      - Informa&ccedil;&atilde;o de vers&atilde;o para os plugins para previnir abrir vers&otilde;es bin&aacute;rias incompat&iacute;veis  antigas de plugins.
  <li>NOVO      - a linguagem de programa&ccedil;&atilde;o ativa pode ser chaveada ao vivo
  <li>NOVO      - gerenciador de projetos gen&eacute;rico
  <li>NOVO      - Importou a biblioteca de edi&ccedil;&atilde;o de propriedades do Kugar
  <li>MELHORADO - reconhece as mensagens de aviso do libtool
  <li>MELHORADO - modelos GBA
  <li>MELHORADO - Run Options
  <li>MELHORADO - Visualizador de classes
  <li>MELHORADO - Depurador
  <li>MELHORADO - Toolbars
  <li>MELHORADO - Interpretador C++ est&aacute; mais r&aacute;pido
  <li>MELHORADO - codecompletion podem manipular completa&ccedil;&atilde;o para os mecanismos do Qt de SIGNAL e SLOT
  <li>MELHORADO - interface com usu&aacute;rio (NOVO modo IDEAl  baseado no QextMDI)
  <li>MELHORADO - manual do usu&aacute;rio
  <li>ACRESCENTADO    - configura&ccedil;&otilde;es de constru&ccedil;&atilde;o "debug" e "optimized" para todos os modelos em C e C++ baseados em autoproject
  <li>ACRESCENTADO    - Integra&ccedil;&atilde;o com o cvsservice do cervisia
  <li>ACRESCENTADO    - As a&ccedil;&otilde;es "Force Reedit", "Install" w "Install (como root)" para o gerenciador de projetos automake
  <li>ACRESCENTADO    - possibilidade depura&ccedil;&atilde;o remota
  <li>ACRESCENTADO    - suporte a class-view para SQL
  <li>ACRESCENTADO    - GUI para criar banco de dados para code completion (PCS) para bibliotecas Qt e KDE
  <li>ACRESCENTADO    - menu popup do tipo emacs "vai para declara&ccedil;&atilde;o/defini&ccedil;&atilde;o" em arquivos c++
  <li>CORRIGIDO    - 9  bugs do KDevelop2.x e vers&otilde;es anteriores.
  <li>CORRIGIDO    - 81 bugs n&atilde;o especificados ou bugs espec&iacute;ficos do KDevelop3.0.
</ul>
Eis uma <a href="http://bugs.kde.org/buglist.cgi?product=kdevelop&amp;resolution=CORRIGIDO&amp;resolution=WORKSFORME&amp;bugidtype=include&amp;chfield=resolution&amp;chfieldfrom=2003-07-01&amp;chfieldto=2003-09-11&amp;order=Bug+Number&amp;cmdtype=doit">vers&atilde;o interativa</a> dos <i>bugs</i> corrigidos.<br>
Para uma lista mais detalhada das modifica&ccedil;&otilde;es visite o <a href="http://webcvs.kde.org/cgi-bin/cvsweb.cgi/kdevelop/ChangeLog?r1=1.1080&amp;r2=1.1054">Registro de mudan&ccedil;as do CVS</a>.
<?php module_tail();?>

<?php module_head("3.0.0 alpha 5 (2003-07-01)");?>
<ul>
  <li>NOVO      - Suporte a linguagem Pascal
  <li>NOVO      - Suporte a gerenciamento de projeto com ClearCase
  <li>NOVO      - Modulo SQL para conectar e testar express&otilde;es SQL
  <li>NOVO      - Suporte a linguagem Ada
  <li>MELHORADO - Armazenamento de Classe Persistente (agora usa berkeley db)
  <li>MELHORADO - Bot&atilde;o parar agora para v&aacute;rias partes diferentes
  <li>MELHORADO - Prefer&ecirc;ncias do Editor - persiste atrav&eacute;s de todos os arquivos abertos
  <li>MELHORADO - Made the Working Directory of the debugged executable configurable
  <li>MELHORADO - acrescenta e remove subprojetos do autoproject
  <li>MELHORADO - integra&ccedil;&atilde;o com CVS
  <li>MELHORADO - Suporte a Java
  <li>MELHORADO - Gerenciador de projetos baseado no QMake
  <li>ACRESCENTADO    - Modelos da linguagem Pascal
  <li>ACRESCENTADO    - Bookmarks Persistentes
  <li>ACRESCENTADO    - sistema de &iacute;ndice para doctreeview
  <li>ACRESCENTADO    - modo tela cheia
  <li>CORRIGIDO    - 22 bugs do KDevelop2.x vers&otilde;es anteriores.
  <li>CORRIGIDO    - 86 bugs n&atilde;o especificados ou bugs espec&iacute;ficos do KDevelop3.0.
</ul>
Eis uma <a href="http://bugs.kde.org/buglist.cgi?product=kdevelop&amp;resolution=CORRIGIDO&amp;resolution=WORKSFORME&amp;bugidtype=include&amp;chfield=resolution&amp;chfieldfrom=2003-04-18&amp;chfieldto=2003-07-02&amp;order=Bug+Number&amp;cmdtype=doit">vers&atilde;o interativa</a> dos <i>bugs</i> corrigidos.<br>
Para uma lista mais detalhada das modifica&ccedil;&otilde;es visite o <a href="http://webcvs.kde.org/cgi-bin/cvsweb.cgi/kdevelop/ChangeLog?r1=1.1053&amp;r2=1.1006">Registro de mudan&ccedil;as do CVS</a>.
<?php module_tail();?>

<?php module_head("3.0.0 alpha 4 (2003-04-18)");?>
<ul>
  <li>NOVO   - NOVA interface de cria&ccedil;&atilde;o de arquivos
  <li>NOVO   - Parte Procura/Substitui para v&aacute;rios arquivos
  <li>NOVO   - Modelo de Aplica&ccedil;&atilde;o - kdehello, javahello, qtopia, fortran, pyqt
  <li>NOVO   - Make Output View Verbosity Configuration
  <li>NOVO   - Suporte a Fortran, Ruby, e projetos tmake
  <li>ACRESCENTADO - NOVO Assistente Adicionou Funcionalidades (inc. suporte Make Member)
  <li>ACRESCENTADO - Melhor navega&ccedil;&atilde;o na documenta&ccedil;&atilde;o, suporte xml
  <li>ACRESCENTADO - C&oacute;digo Classparser rescrito
  <li>ACRESCENTADO - Interface DCOP para FilterParts e CppParts
  <li>MELHORADO - Suporte a Projeto Perl
  <li>MELHORADO - Suporte integrado ao Doxygen
  <li>CORRIGIDO    - 51  do KDevelop2.x vers&otilde;es anteriores.
  <li>CORRIGIDO    - 124  bugs n&atilde;o especificados ou bugs espec&iacute;ficos do KDevelop3.0.
</ul>
Eis uma <a href="http://bugs.kde.org/buglist.cgi?product=kdevelop&amp;resolution=CORRIGIDO&amp;resolution=WORKSFORME&amp;bugidtype=include&amp;chfield=resolution&amp;chfieldfrom=2002-11-12&amp;chfieldto=2003-04-18&amp;order=Bug+Number&amp;cmdtype=doit">vers&atilde;o interativa</a> dos <i>bugs</i> corrigidos.<br>
Para uma lista mais detalhada das modifica&ccedil;&otilde;es visite o <a href="http://webcvs.kde.org/cgi-bin/cvsweb.cgi/kdevelop/ChangeLog?r1=1.1005&amp;r2=1.905">Registro de mudan&ccedil;as do CVS</a>.
<?php module_tail();?>

<?php module_head("3.0.0 alpha 3 (2003-01-08)");?>
<ul>
  <li>C&oacute;digo base completamente rescrito utilizando partes plugin
  <li>Adicionou suporte a para projetos n&atilde;o C++ (Java, C, etc)
  <li>NOVO modo de interface com usu&aacute;rio - IDEAl
  <li>Suporte a projeto Automake/Makefile.am foi rescrito est&aacute; melhor
  <li>NOVO Suporte a projetos qmake
  <li>Auto-completa&ccedil;&atilde;o de c&oacute;digo C++
  <li>Integra&ccedil;&atilde;o de Controle de Fontes (CVS, Perforce, Subversion)
  <li>V&aacute;rias melhorias adicionais
</ul>
<?php module_tail();?>
