<?php module_head("Press Release KDevelop 1.1"); ?>
<pre><small>
   KDevelop 1.1 - El Ambiente de Desarrollo Unix/Linux - ya est&aacute; disponible
   CeBIT 2000--Hannover, Germany, February 28, 2000
 
   1. Introducci&oacute;n

   KDevelop 1.1 (http://www.kdevelop.org) es la versi&oacute;n oficial m&aacute;s reciente para los sistemas KDE 1.x. 
   Se han a&ntilde;adido muchos <i>features</i> nuevos, tales como un  <i>debugger</i> interno, adem&aacute;s de haber 
   mejorado el c&oacute;digo base actual. Adem&aacute;s, ahora se provee mejor apoyo a los distintos sistemas 
   Unix. El IDE ha demostrado ser estable en pruebas reales por parte de programadores, 
   quienes han creado muchas aplicaciones nuevas con versiones previas de KDevelop. 

   Esta versi&oacute;n pretende ser la &uacute;ltima para KDE 1.1.2. Deseamos concentrar nuestros 
   esfuerzos en KDevelop 2.x (el cual funcionar&aacute; con KDE 2.x).

   2. Intenciones

   La raz&oacute;n principal para la creaci&oacute;n de KDevelop fue la falta de una soluci&oacute;n moderna y 
   competitiva para el desarrollo de aplicaciones.  A pesar de que los sistemas Unix proveen al
   usuario de un ambiente bueno y estable, incluyendo el Sistema de X Windows, hacen falta 
   herramientas modernas que est&aacute;n disponibles en otros sistemas operativos. 

   Mientras que los desarrolladores <i>hardcore</i> de Unix aseguran que Emacs y vi son la soluci&oacute;n
   &uacute;ltima, KDE provee a los programadores un marco completo de creaci&oacute;n de aplicaciones,
   junto con la biblioteca Qt. El hecho de que Qt est&eacute; disponible a nivel comercial, aumenta
   el inter&eacute;s de programadores y entidades comerciales. Por lo tanto, el Proyecto KDevelop
   pretende 

      a.proveer un ambiente gratuito para escribir c&oacute;digo,
      b.facilitar el uso de herramientas est&aacute;ndares de programaci&oacute;n, tales como autoconf y
        automake; 
      c.ofrecer un editor de di&aacute;logos gratuito que reduzca los ciclos de dise&ntilde;o de GUI,
      d.permitir a los desarrolladores el acceso directo y sencillo a documentaci&oacute;n escrita por su equipo
        o por terceros. Esto incluye documentaci&oacute;n para los API de KDE y QT.

   3. Resumen 

   El IDE KDevelop provee las herramientas siguientes para el desarrollo de aplicaciones en C/C++: 

      a.un generador de proyectos basado en <i>wizards</i> que crea <i>frameworks</i> configurables para
        varios tipos de aplicaciones (KDE1,KDE2,OpenGL(tm),aplicaciones basadas en terminales...)
      b.un ambiente de codificaci&oacute;n que incluye 
            un editor con <i>syntax highlighting</i>,  
            un lector y un navegador de clases,
            varios lectores de archivos,
            un <i>debugger</i> interno.
      c.un sistema de documentaci&oacute;n con acceso directo a documentaci&oacute;n HTML en l&iacute;nea,
        incluyendo 5 manuales para el desarrollo para KDE/Qt y b&uacute;squeda r&aacute;pida,
      d.un editor de di&aacute;logos que facilita la construcci&oacute;n r&aacute;pida de interfaces de usuarios (UIs),
        el cual est&aacute; empotrado completamente en el ambiente de desarrollo,
      e.un ambiente que trabaja con los <i>mime-types</i> de los archivos para as&iacute; poder ejecutar <i>autom&aacute;gicamente</i> 
        la aplicaci&oacute;n apropiada en KDevelop, como KIconEdit para bitmaps o KDbg para ejecutables,
      f.apoyo a CVS para desarrollo de proyectos, 
      g.apoyo a localizaci&oacute;n sencilla de proyectos,
      h.traducciones a 17 idiomas, 
      i.muchos otros <i>features</i>, tales como <i>autosaving</i>, <i>commandline-passing</i>, etc. 

   Esto permite al programador reducir al m&iacute;nimo los ciclos de desarrollo, mientras le ofrece
   la flexibilidad de poder trabajar a gusto. 

   Nos gustar&iacute;a mencionar que, aunque KDevelop requiere KDE y Qt para funcionar, es posible
   utilizarlo para cualquier proyecto en C/C++. KDevelop se ha dise&ntilde;ado primordialmente como un ambiente de 
   desarrollo de C/C++. 

   4. Por qu&eacute; usar KDevelop 

   Cualquier programador se preguntar&iacute;a si KDevelop ser&aacute; mejor que Emacs, mejor que MS
   Visual Studio o mejor que Borland. Sin embargo, el hecho de que KDevelop provee una interfaz completa y
   <i>user friendly</i> pasa casi desapercibido. 

   Sin embargo, consideramos innecesario mantenernos rezagados ante el veterano desarrollo de, por ejemplo,
   Emacs. La verdad es que KDevelop est&aacute; siendo desarrollado con versiones beta del mismo KDevelop. Para 
   nosotros, la estabilidad fue y ser&aacute; nuestra meta principal. Usted debe esperar que KDevelop haga lo 
   que usted desea que &eacute;ste haga, KDevelop seguir&aacute; estable, seg&uacute;n sabemos de lo que han informado los usuarios 
   de versiones anteriores. 

   Los <i>features</i> fueron dise&ntilde;ados seg&uacute;n se necesitaban en nuestros prop&oacute;sitos. El programador
   puede esperar que este ambiente interact&uacute;e con &eacute;l intuitivamente y de manera r&aacute;pida y amigable. 

   Todos los <i>features</i> se han documentado y, tambi&eacute;n, se provee una colecci&oacute;n completa de manuales
   que pueden ayudar a los novatos en KDE sin importar cu&aacute;l sea su trasfondo de programaci&oacute;n. 


   5. El Futuro

   Mientras KDE comienza a implantar tecnolog&iacute;as nuevas, el Proyecto KDevelop keeps up
   with the time. Adem&aacute;s de hacer lo &uacute;ltimo de KDevelop 1.1, ya estamos trabajando con 
   la versi&oacute;n 2.0, la cual apoyar&aacute; KDE 2 y versiones futuras de la biblioteca Qt.
   As&iacute; que, &iexcl;mant&eacute;ngase al tanto! 

   6. Acerca del Equipo KDevelop

   El Proyecto KDevelop, comenzado en el verano de 1998, propone proveer al programador
   un ambiente bueno, estable y &uacute;til que compita con IDE modernos.  Desde el comienzo de su
   desarrollo, el equipo ha aumentado de tres miembros del equipo <i>core</i> a ocho codificadores
   y un equipo de traducci&oacute;n con m&aacute;s de 50 personas. Mientras tanto, muchos han probado las versiones
   beta y han compartido sus experiencias para mejorar la estabilidad y la funcionalidad de KDevelop.
</small></pre>

<?php module_tail(); ?>
