<?php module_head("Func&#x163;iuni KDevelop 3.1.x");?>

Con&#x163;ine toate <a href="index.html?filename=3.0/features.html">func&#x163;iunile KDevelop 3.0.x</a> plus:<br>
<ul>
<li><b>Fragmente de Cod (Snippets)</b>
<ul>
<li>SnippetPart adauga_ un utilitar-vizualizare care implicit se &icirc;ncorporeaz&#259; &icirc;n partea dreapt&#259;</li>
<li>Ad&#259;ugarea, editarea &#x15F;i stergerea de fragmente este diaponibil&#259; printrun meniu popup</li>
<li>Dublu-click pe un fragment din list&#259; rezult&#259; &icirc;n inserarea lui la pozi&#x163;ia cursorului</li>
<li>Tooltip-uri arat&#259; con&#x163;inutul fragmentului</li>
<li>Fragmentele sunt salvate &icirc;n directorul utilizatorului, deci fircare utilizator poate avea propriile fragmente</li>
<li>Fragmentele pot con&#x163;ine variabile &icirc;n stilul $VARNAME$. Utilizatorul este &icirc;ntrebat de valorile variabilelor c&acirc;nd fragmentul este folosit</li>
</ul>
</li>

<li><b>Integrare cu Doxygen</b> (generatorul de documenta&#x163;ie API)
<ul>
<li>Suport&#259; toate limbajele de programare pe care doxygen le suport&#259; (cu excep&#x163;ia IDL &#x15F;i D)</li>
<li>Vizualizare preliminar&#259; a documenta&#x163;iei generate de doxygen pentru fi&#x15F;ierul aflat &icirc;n editare</li>
<li>Configureaz&#259; doxygen</li>
<li>Execut&#259; doxygen</li>
<li>vizualizeaz&#259; documentele generate de doxygen(format html man sau pdf)</li>
<li>Poate folosi XML generat de doxygen ca tooltip-uri pentru comple&#x163;ie de cod &icirc;n timp real ("as you type")</li>
</ul>
</li>

<li><b>Vizualizare de documenta&#x163;ie bazat&#259; pe plugin-uri</b>
<ul>
<li>O interfa&#x163;&#259; unificat&#259; pentru navigarea documentatiei.</li>
<li>Cuprins (TOC), capabilit&#259;&#x163;i de c&#259;utare tip index &#x15F;i text complet (cu htdig).</li>
<li>Autodetectie &#x15F;i includere documenta&#x163;ii pentru Qt, Libr&#259;riile KDE  &#x15F;i DevHelp.</li>
<li>Support for custom documentation collections (KDevelopTOC format).</li>
<li>Abilitatea de a utiliza documenta&#x163;ie stocat&#259; local, la distan&#x163;&#259; &#x15F;i chiar compresat&#259; (utiliz&acirc;nd orice protocol valabil &icirc;n Konqueror - http, ftp, sftp, tar, zip, etc.).</li>
<li>Poate procesa formate TXT, HTML, DevHelp, CHM, PDF, Djvu &#x15F;i PDB.</li>
<li>Poate utiliza orice format de documenta&#x163;ie suportat de KDE.</li>
</ul>
</li>

<li><b>Ghid flexibil pentru crearea de aplica&#x163;ii (template-uri de proiecte)</b>
<ul>
<li>Ghidul pentru crearea plica&#x163;iilor genereaz&#259; programe simple complete, gata de execu&#x163;ie.</li>
<li>Template-uri pentru toate limbajele &#x15F;i sistemele de construc&#x163;ie valabile sunt prezente.</li>
<li>Abilitatea de a utiliza remplate-uri customizate nu este inclus&#259; &icirc;n distribu&#x163;ie.</li>
<li>Con&#x163;ine toate tepmplate-utrile prezente &icirc;n KDevelop 3.0 plus template-uri pentru crearea de aplica&#x163;ii GTK, GNOME &#x15F;i Bonobo</li>
<li>Suport&#259; lucruri de care <b>numai Ian</b> &#x15F;tie :)</li>
</ul>
</li>

<li><b>Orientare RAD (Dezvoltare rapid&#259; de aplica&#x163;ii)</b>
<ul>
<li>Noua aplica&#x163;ie kdevdesigner permite dezvoltarea nediferen&#x163;iat&#259; de interfe&#x163;e utilizator bazate pe Qt prin integrarea QTdesigner &icirc;n cadrul KDE.</li>
<li>Noua aplica&#x163;ie kdevassistant permites folosirea documenta&#x163;iei &icirc;n <em>stil QT</em>.</li>
<li>Ambele aplica&#x163;ii pot fi utilizate de sine sta_ta_tor sau &icirc;n KDevelop, astfel <b>un</b> program de dezvoltare pentru toate nevoile dvs. de dezvoltare.</li>
</ul>
</li>

</ul>
<?php module_tail();?>
