<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "/loose.dtd">
<HTML>
<HEAD>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="text/html; charset=utf-8">
	<TITLE>KDevelop TechNotes: RAD with KDevelop using C++/Qt/KDE</TITLE>
	<META NAME="GENERATOR" CONTENT="OpenOffice.org 1.1.1  (Linux)">
	<META NAME="CREATED" CONTENT="20041130;12141100">
	<META NAME="CHANGED" CONTENT="20041130;23495300">
	<STYLE>
	<!--
		@page { size: 209.99mm 296.99mm; margin-left: 31.75mm; margin-right: 31.75mm; margin-top: 25.4mm; margin-bottom: 25.4mm }
		P { margin-bottom: 2.12mm }
		H1 { margin-bottom: 2.12mm }
		H1.western { font-family: "Arial", sans-serif; font-size: 16pt }
		H1.cjk { font-family: "Mincho"; font-size: 16pt }
		H1.ctl { font-family: "Tahoma"; font-size: 16pt }
		H3 { margin-bottom: 2.12mm }
		H3.western { font-family: "Arial", sans-serif }
		H3.cjk { font-family: "Mincho" }
	-->
	</STYLE>
</HEAD>
<BODY LANG="en-US" DIR="LTR">
<TABLE WIDTH=100% BORDER=1 BORDERCOLOR="#000000" CELLPADDING=4 CELLSPACING=0>
	<COL WIDTH=125*>
	<COL WIDTH=131*>
	<THEAD>
		<TR>
			<TD WIDTH=49% VALIGN=TOP>
				<P ALIGN=CENTER><A HREF="http://www.kdevelop.org/"><IMG SRC="../../../../graphics/theme3/KDevelopBanner.png" NAME="HTTP://WWW.KDEVELOP.ORG/" ALIGN=LEFT WIDTH=450 HEIGHT=100 BORDER=0></A><BR>
				</P>
			</TD>
			<TD WIDTH=51%>
				<H1 CLASS="western">Notes techniques pour KDevelop</H1>
				<H1 CLASS="western">Num&eacute;ro 2 : d&eacute;veloppement rapide avec KDevelop en utilisant C++/Qt/KDE</H1>
			</TD>
		</TR>
	</THEAD>
</TABLE>
<P STYLE="margin-bottom: 0mm">Dans ce num&eacute;ro nous allons couvrir rapidement
le d&eacute;veloppement d'applications avec des interfaces utilisateurs graphiques.
D&eacute;velopper des interfaces graphiques avec le language C++ est habituellement consid&eacute;r&eacute; comme une t&acirc;che difficile.
Mais, par chance, la biblioth&egrave;que Qt la simplifie beaucoup mais jusqu'&agrave; r&eacute;cemment, il n'existait aucun outil pour associer le d&eacute;veloppement de l'interface graphique et le code. Les d&eacute;veloppeurs Pascal et
Java profitent de tels outils depuis des ann&eacute;es (Delphi, Kylix, Forte me viennent &agrave; l'esprit). KDevelop 3.1 a maintenant les m&ecirc;mes possibilit&eacute;s.</P>
<H3 CLASS="western">Cr&eacute;er une simple application Qt avec une interface graphique</H3>
<OL>
	<LI><P>Ouvrez KDevelop, choisissez Projet-&gt;Nouveau Projet dans le menu
	et cr&eacute;ez un projet C++ / QMake  / programme Hello word.</P>
	<LI><P>Ouvrez la fen&ecirc;tre d'outil de gestion de QMake (sur la droite dans la fen&ecirc;tre de KDevelop).</P>
	<LI><P>S&eacute;lectionnez le sous-projet 'src'.</P>
	<LI><P>Cliquez avec le bouton droit de la souris sur FORMS et s&eacute;lectionnez 'Cr&eacute;er un nouveau fichier'.</P>
	  <LI><P>Cr&eacute;ez le fichier 'mainbase.ui' avec le squelette Widget (.ui).</P>
	<LI><P>Double cliquez sur <SPAN STYLE="font-weight: medium">'mainbase.ui'
	dans le gestionnaire QMake pour ouvrir designer int&eacute;gr&eacute;. Vous devez voir maintenant
	le designer int&eacute;gr&eacute; ouvert avec une forme vide.<BR>Capture d'&eacute;cran&nbsp;: </SPAN><A HREF="../../../../doc/technotes/cpprad1.png"><SPAN STYLE="font-weight: medium">cpprad1.png</SPAN></A></P>
	<LI><P STYLE="font-weight: medium">Changez le nom de la forme pour 'MainBase'.</P>
	<LI><P STYLE="font-weight: medium">Ajoutez un PushButton sur la forme et allez dans la vue 'Signal Handlers'.</P>
	<LI><P STYLE="font-weight: medium">Ajoutez un gestionnaire de signal (en cliquant avec le bouton droit de la souris) au signal 'clicked()'. Apr&egrave;s cela, un dialogue 'Create or Select Implementation Class for: MainBase' devrait appara&icirc;tre vous demandant d'entrer le nom de la subclass. Entrez, par exemple, MainImpl comme nom de classe et appuyez sur OK.</P>
	<P STYLE="font-weight: medium"><IMG SRC="../../../../doc/technotes/cpprad_html_m6e6cd29a.png" NAME="Graphic1" ALIGN=LEFT WIDTH=522 HEIGHT=379 BORDER=0><BR CLEAR=LEFT></P>
	<LI><P><SPAN STYLE="font-weight: medium">Deux fichiers avec une forme de subclass seront cr&eacute;&eacute;s et ouverts&nbsp;: mainimpl.h</SPAN> et mainimpl.cpp. Le curseur se positionnera sur la premi&egrave;re ligne de la d&eacute;finition de la m&eacute;thode	MainImpl::pushButton1_clicked(). Vous pouvez &eacute;crire votre code ici (essayez quelque chose comme <I>qWarning(<FONT FACE="Times New Roman">&quot;</FONT>Hello<FONT FACE="Times New Roman">&quot;</FONT>);</I>
	    pour d&eacute;buter).<BR>Capture d'&eacute;cran&nbsp;: <A HREF="../../../../doc/technotes/cpprad2.png">cpprad2.png</A></P>
	<LI><P>Ouvrez un fichier avec la fonction main() et changez son contenu pour&nbsp;:</P>
	<PRE>#include &lt;qapplication.h&gt;
#include &quot;mainimpl.h&quot;

int main(int argc, char *argv[])
{
    QApplication app(argc, argv);
    
    MainImpl widget;
    app.setMainWidget(&amp;widget);
    widget.show();
    
    return app.exec();
}</PRE>
	<LI><P STYLE="font-weight: medium">Sauvegardez tous les fichiers (n'oubliez pas de sauvegarder explicitement aussi la forme mainbase.ui).</P>
	<LI><P STYLE="font-weight: medium">Compilez et lancez le projet. Vous devriez avoir une fen&ecirc;tre avec un bouton. </P>
</OL>
<P><B>Note&nbsp;: vous pouvez d&eacute;finir autant de slots que vous voulez. L'int&eacute;gration de designer
va ajouter les impl&eacute;mentations des slots &agrave; la subclass et ne va pas &eacute;crire sur votre code.</B></P>
<H3 CLASS="western"><B>Cr&eacute;er une simple application KDE avec une interface graphique</B></H3>
<P STYLE="font-weight: medium">La cr&eacute;ation d'une application KDE est un processus similaire&nbsp;:</P>
<OL>
  <LI><P STYLE="font-weight: medium">Cr&eacute;ez une simple application C++ / KDE bas&eacute;e sur designer.</P>
	<LI><P STYLE="font-weight: medium">Ouvrez le gestionnaire Automake et s&eacute;lectionnez le sous-projet 'src'. Dans la vue des d&eacute;tails, vous devriez voir la forme existante
	(&lt;appname&gt;widgetbase.ui file) qui a d&eacute;j&agrave; &eacute;t&eacute; cr&eacute;&eacute;e par l'assistant d'application.</P>
	<LI><P STYLE="font-weight: medium">Ouvrez la forme dans le designer int&eacute;gr&eacute;.</P>
	<LI><P STYLE="font-weight: medium">S&eacute;lectionnez le bouton 'Click Me!', allez dans la vue
	'Signal Handlers' et ajoutez un autre slot &agrave; un signal 'clicked()'.</P>
	<LI><P STYLE="font-weight: medium">Dans le dialogue 'Create or Select
	Implementation' ne cr&eacute;ez pas une nouvelle subclass, choisissez plut&ocirc;t le radio-bouton
	'Use existing class' et s&eacute;lectionnez la classe &lt;appname&gt;Widget
	class. Choisissez OK et regardez les fichiers &lt;appname&gt;Widget.cpp (h) -
	le nouveau slot est ajout&eacute; l&agrave;.</P>
	<LI><P STYLE="font-weight: medium">Ajoutez du code &agrave; une d&eacute;finition de slot
	puis compilez et lancez l'application. Vous devez obtenir une application KDE
	avec une fen&ecirc;tre et un bouton &agrave; l'int&eacute;rieur de cette fen&ecirc;tre.</P>
</OL>
<H3 CLASS="western">Notes</H3>
<P>Les utilisateurs de Delphi et Kylix vont trouver que ce proc&eacute;d&eacute; est similaire &agrave; ce qu'ils utilisent d&eacute;j&agrave;. KDevelop offre maintenant la m&ecirc;me chose pour les d&eacute;veloppeurs C++/Qt/KDE. Comme vous pouvez le noter, KDevelop utilise l'approche de subclassing pour cr&eacute;er les impl&eacute;mentations des formes. Cela signifie que vous devrez cr&eacute;er une forme et impl&eacute;menter tous les slots dans une subclass de cette forme. Ceci est consid&eacute;r&eacute; comme &eacute;tant pr&eacute;f&#233;rable plut&ocirc;t que d'avoir des fichiers ui.h avec les impl&eacute;mentations des slots.</P>
<H3 CLASS="western">Informations techniques</H3>
<P>La version &gt;= 3.1 de KDevelop contient une version personnalis&eacute;e (fourche
;)) de Qt Designer. Elle est appel&eacute;e KDevelop Designer (KDevDesigner,
kdevdesigner depuis la ligne de commande). KDevDesigner comprend des
diff&eacute;rences importantes&nbsp;:</P>
<UL>
	<LI><P>KDevDesigner fournit une KPart lire/&eacute;crire qui peut &ecirc;tre incorpor&eacute;e dans
	toute application voulant &eacute;diter  des fichiers .ui.
	L'interface de d&eacute;veloppement KDevelop int&egrave;gre KDevDesigner de cette fa&ccedil;on.</P>
	<LI><P>KDevDesigner utilise les icones et les dialogues de KDE et donc fournit une meilleure int&eacute;gration dans le syst&egrave;me.</P>
	<LI><P>Il est s&eacute;curitaire de visualiser des formes avec des widgets KDE des biblioth&egrave;ques kdeui et kio - la part KDevDesigner est li&eacute;e &agrave; ces biblioth&egrave;ques et ne va pas crasher.</P>
	<LI><P>KDevDesigner ne va pas cr&eacute;er des fichiers .ui.h files - cette caract&eacute;ristique est enti&egrave;rement supprim&eacute;e. Le KDevDesigner int&eacute;gr&eacute; va utiliser l'approche de subclasse.</P>
</UL>
<P>Lorsque KDevDesigner est int&eacute;gr&eacute; dans KDevelop, ses signals
(d&eacute;finis dans l'interface KInterfaceDesigner, le fichier inclu kinterfacedesigner/designer.h,
kdevelop/lib/interfaces/external dans les sources)&nbsp;:</P>
<PRE>    void addedFunction(DesignerType type, const QString &amp;formName, Function function)
    void removedFunction(DesignerType type, const QString &amp;formName, Function function)
    void editedFunction(DesignerType type, const QString &amp;formName, Function oldFunction, Function function)
    void editFunction(DesignerType type, const QString &amp;formName, const QString &amp;functionName)<BR></PRE><P>
sont connect&eacutes; aux slots correspondants de l'int&eacute;gration designer de KDevelop qui peut &ecirc;tre impl&eacute;ment&eacute; dans le module de support de languages de KDevelop.
Chaque support de language qui veut utiliser le designer int&eacute;gr&eacute; doit le r&eacute;impl&eacute;menter 
</P>
<PRE>virtual KDevDesignerIntegration *KDevLanguageSupport::designer(KInterfaceDesigner::DesignerType type)</PRE><P>
m&eacute;thode et retourne un objet d'int&eacute;gration de designer. Une biblioth&egrave;que d'int&eacute;gration est disponible pour les d&eacute;veloppeurs voulant programmer un support de language. Elle est localis&eacute;e dans le r&eacute;pertoire
kdevelop/languages/lib/designer_integration dans l'arborescence source de kdevelop. Gr&acuirc;ce &agrave; la biblioth&egrave;que, &eacute;crire des int&eacute;grations Qt designerpour les language est une t&acirc;che triviale.</P>
<P>Il est int&eacute;ressant de mentionner qu'il est techniquement possible d'int&eacute;grer non seulement Qt Designer, mais aussi, par exemple, Glade. Glade-3
peut &ecirc;tre compil&eacute; comme une biblioth&egrave;que et probablement aussi &ecirc;tre int&eacute;gr&eacute; via la technologie XParts.</P>
<P>Les personnes int&eacute;ress&eacute;es devraient regarder cette page&nbsp;:
<A HREF="http://www.kdevelop.org/HEAD/doc/api/html/">http://www.kdevelop.org/HEAD/doc/api/html/</A>
pour une description d&eacute;taill&eacute;e de l'API KDevelop.</P>
<P>Actuellement l'int&eacute;gration de Qt Designer est impl&eacute;ment&eacute;e dans KDevelop
version 3.1 pour C++ et dans les r&eacute;centes versions de d&eacute;veloppement (CVS HEAD, dans le futur - 3.2) aussi pour le language Ruby.</P>
<P>L'&eacute;quipe KDevelop recherche des volontaires pour impl&eacute;menter l'int&eacute;gration pour Python, Java et KJS dans to Qt Designer.</P>
<H3 CLASS="western">Installation</H3>
<P>KDevelop version &gt;= 3.1 a toutes les caract&eacute;ristiques discut&eacute;es dans cet article. Mais vous voulez peut-&ecirc;tre utiliser les versions les plus r&eacute;centes pour avoir les derni&egrave;res fonctionalit&eacute;s ou mises &agrave; jour.</P>
<P>T&eacute;l&eacute;chargement de KDevelop&nbsp;:<BR>Version r&eacute;cente&nbsp;:
<A HREF="http://www.kdevelop.org/index.html?filename=HEAD/download.html">http://www.kdevelop.org/index.html?filename=HEAD/download.html</A><BR>Version stable&nbsp;:
<A HREF="http://www.kdevelop.org/index.html?filename=download.html">http://www.kdevelop.org/index.html?filename=download.html</A></P>
<P STYLE="border-top: none; border-bottom: 1px solid #000000; border-left: none; border-right: none; padding-top: 0mm; padding-bottom: 0.74mm; padding-left: 0mm; padding-right: 0mm">
<BR><BR>
</P>
<P><B>&Agrave; propos de cet article&nbsp;:
<A HREF="http://www.kdevelop.org/phorum5/read.php?2,26442">http://www.kdevelop.org/phorum5/read.php?2,26442</A></B></P>
<P>&copy; 2004 par Alexander Dymo <A HREF="mailto:adymo@kdevelop.org">mailto:adymo@kdevelop.org</A>.</P>
<P>Permission est donn&eacute;e de copier, publier et modifier ce document sans restrictions.</P>
<P>Tout le monde est invit&eacute; &agrave; partager ses connaissances et son exp&eacute;rience avec KDevelop.
Nous acceptons toutes les propositions pour les futurs num&eacute;ros des notes techniques de KDevelop.</P>
<P>Versions :</P>
<P>30.11.2004 - premi&egrave;re version.</P>
<P>01.12.2004 - correction des liens.</P>
</BODY>
</HTML>
