<?php if (empty($filename))
echo "<HTML><HEAD><META http-equiv=\"refresh\" content=\"0;URL=../../index.html?filename=doc/technotes/index.html&amp;set_lang=fr\"></HEAD></HTML>";
?>

<?php module_head('Num&eacute;ros');?>
<h3><a href="doc/technotes/navigation.html">Num&eacute;ro 4 : Navigation efficace dans le code</a></h3>
<p><b>24 D&eacute;cembre 2004</b><br>
Cette note d&eacute;crit les outils de navigation dans le code disponibles dans KDevelop et examine plusieurs cas
o&ugrave; ces outils peuvent &ecirc;tre utilis&eacute;s. Les questions d'une navigation efficace dans le code
avec les outils disponibles sont mises en &eacute;vidence.</p><br>

<h3><a href="doc/technotes/rubyrad.html">Num&eacute;ro 3 : D&eacute;veloppement rapide avec KDevelop en utilisant Ruby/Qt/KDE</a></h3>
<p><b>05 D&eacute;cembre 2004</b><br>
Cette note discute des questions de d&eacute;veloppement rapide d'applications avec interfaces graphiques utilisant Qt et/ou les biblioth&egrave;ques KDE avec le langage de programmation Ruby.
L'installation de l'environnement Ruby et l'utilisation du support Ruby dans KDevelop sont abord&eacute;es.</p><br>

<h3><a href="lang/fr/doc/technotes/cpprad.html">Num&eacute;ro 2 : D&eacute;veloppement rapide avec KDevelop en utilisant C++/Qt/KDE</a></h3>
<p><b>30 Novembre 2004</b><br>
Cette note discute des questions de d&eacute;veloppement rapide d'applications avec interfaces graphiques utilisant Qt et/ou les biblioth&egrave;ques KDE avec le language de programmation C++.
KDevelop Designer : un designer int&eacute;gr&eacute; dans l'interface de KDevelop est d&eacute;crit,
les cas d'utilisation les plus courants sont expliqu&eacute;s. Certains d&eacute;tails techniques de l'int&eacute;gration de l'interfcae de designer
dans KDevelop sont aussi donn&eacute;s.</p><br>

<h3><a href="doc/technotes/kdevassistant.html">Num&eacute;ro 1 : Naviguer dans la documentation avec KDevAssistant</a></h3>
<p><b>30 Novembre 2004</b><br>
Cette note discute des probl&egrave;mes d'acc&egrave;s &agrave; la documentation API et &agrave; toute autre forme de documentation pour le d&eacute;veloppeur sur les plates formes UNIX et pr&eacute;sente une solution : le programme KDevelop Assistant qui est le premier visualiseur de documentation supportant plusieurs formats de documentation comme Doxygen, DevHelp, Qt DCF, CHM et d'autres.</p><br>

<?php module_tail();?>
