<?php module_head("KDevelop-<?php echo $k_base_version; ?>-Pressemitteilung"); ?>

<H3 ALIGN="center">KDevelop-<?php echo $k_base_version; ?>-Pressemitteilung</H3>
<P><STRONG>Das KDevelop-Team gibt ein neues Haupt-Release der mehrfach ausgezeichneten Open-Source-Entwicklungsumgebung frei</STRONG></P>
<P>25. Januar 2007 (Das INTERNET).
Das
<a href="index.html?filename=<?php echo $k_base_version; ?>/authors.html">
KDevelop-Entwicklerteam</a> ist stolz,
<a href="index.html?filename=<?php echo $k_base_version; ?>/kdevelop.html">KDevelop <?php echo $k_base_version; ?></a>,
das
<a href="index.html?filename=versions.html">
f&uuml;nfte Hauptrelease</a> der 
<a href="index.html?filename=awards.html">
mehrfach ausgezeichneten</a> integrierten Entwicklungsumgebung (IDE) freizugeben.
</P>
<P>
Diese Version bietet viele
<a href="index.html?filename=<?php echo $k_base_version; ?>/features.html">
neue Eigenschaften</a> und 
<a href="http://bugs.kde.org/buglist.cgi?product=kdevelop&resolution=FIXED&resolution=WORKSFORME&bugidtype=include&chfield=resolution&chfieldfrom=2005-10-21&chfieldto=2007-01-25&order=Bug+Number&cmdtype=doit">
behebt &uuml;ber 500 Fehler</a>.
<P>
"Ein kleines Team von 27 Entwicklern hat &uuml;ber einen Zeitraum von f&uuml;nfzehn Monaten zu diesem Release beigetragen. Die Benuterbasis ist stetig gewachsen, was die Downloadzahlen von 25 pro Stunde beweisen, und was uns sehr viele R&uuml;ckmeldungen und Verbesserungsvorschl&auml;ge erbrachte.", merke der Releasekoordinator Amilcar do Carmo Lucas an.
</P>

<H4>&Uuml;ber KDevelop</H4>
<P>
KDevelop unterst&uuml;tzt eine vielzahl Programmiersprachen, Revisionskontrollsysteme, Debugger, Dokumentationsformate und Build-Werkzeuge. Kate ist der bevorzugte Editor, wobei aber jeder Editor in KDevelop integriert werden kann, der die KTextEditor-Schnittstelle unterst&uuml;tzt. Build-Werkzeuge wie automake und qmake werden direkt unterst&uuml;tzt, was bedeutet, dass KDevelop nicht sein eigenes Objektarchiv verwaltet. &Auml;nderungen im nativen Projekt spiegeln sich in KDevelop wider und umgekehrt.
</P><P>
KDevelop bietet zudem eine Klassenansicht, die alle Symbole entweder in einer Ebene oder hierarchisch, nach Namensr&auml;umen sortiert, anzeigt und einfache Navigation im Quelltext erlaubt. Ein Hintergrundparser aktualisiert die Symbole "on-the-fly" und zeigt Syntaxfehler im Quelltext an. Die Autovervollst&auml;ndigung bew&auml;ltigt sogar externe Bibliotheken und die Signals und Slots von Qt.
</P><P>
Die offene Architektur von KDevelop erlaubt Anpassungen und Erweiterungen in jeder Hinsicht. Die Benutzeroberfl&auml;che ist Quelltextzentriert mit bei Bedarf angezeigten Werkzeugansichten.
</P><P>
KDevelop hat erweiterte Unterst&uuml;tzung zur Navigation im Quelltext. Der Zugriff auf Symbole und Dateinamen ist durch teilweise Eingabe der Namen m&ouml;glich, zuletzt ge&auml;nderte Dateien sind &uuml;ber einen Tastenanschlag erreichbar.
</P><P>
KDevelop bietet Dokumentationsgeneratoren, Debugger, Speicher&uuml;berpr&uuml;fung, Quelltextrefaktorisierung, Lesezeichenverwaltung, sowie viele weitere Werkzeuge, die die Entwicklung einfach und angenehm gestalten.
</P>

<H4>KDevelop-<?php echo $k_base_version; ?>-Bin&auml;r-Pakete installieren</H4>
<P>
Bin&auml;rpakete f&uuml;r alle gro&szlig;en Linux-Distributionen k&ouml;nnen von
<a href="index.html?filename=<?php echo $k_base_version; ?>/download.html">http://www.kdevelop.org/index.html?filename=<?php echo $k_base_version; ?>/download.html</a> heruntergeladen werden.
</P>

<H4>KDevelop <?php echo $k_base_version; ?> kompilieren</H4>
<P>
Der gesamte Quelltext von KDevelop <?php echo $k_base_version; ?> kann von
<a href="index.html?filename=<?php echo $k_base_version; ?>/download.html">http://www.kdevelop.org/index.html?filename=<?php echo $k_base_version; ?>/download.html</a> heruntergeladen werden.
Weitere Informationen. wie Sie auf das Quelltextarchiv der Entwickler zugreifen, und wie Sie KDevelop kompilieren kp&ouml;nnen, finden Sie auf
<a href="index.html?filename=<?php echo $k_base_version; ?>/branches_compiling.html">http://www.kdevelop.org/index.html?filename=<?php echo $k_base_version; ?>/branches_compiling.html</a>.
</P>


<H4>&Uuml;ber KDevelop</H4>
<P>
KDevelop ist ein unabh&auml;ngiges Projekt, um eine leistungsf&auml;hige und einfach zu bedienende Integrierte Entwicklungsumgebung (IDE - Integrated Development Environment) zu schaffen. Als Teil des KDE-Projekts bedient sich KDevelop des gleichen offenen Entwicklungsmodells und modularen Rahmens. Das Ergebnis ist eine hochgradig anpassbare, sprachunabh&auml;ngige Entwicklungsumgebung, die unter der GPL lizensiert ist und von dutzenden Entwicklern und Experten weltweit vorangebracht wird. Mehr &uuml;ber KDevelop erfahren Sie auf <a href="http://www.kdevelop.org/">http://www.kdevelop.org</a>.
</P>


<H4>&Uuml;ber KDE</H4>

<P>
KDE ist ein unabh&auml;ngiges Projekt hunderter Entwickler, &Uuml;bersetzer, Designer und anderer Mitarbeiter, die weltweit &uuml;ber das Internet zusammen arbeiten, um eine fortschrittliche, anpassbare und stabile, auf einer flexiblen, komponentenbasierten, netzwerktrasparenten Architektur basierende Arbeits- und B&uuml;roumgebung, sowie eine hervorragende Entwicklungsplattform zu erstellen und frei zu verteilen. KDE bietet einen stabilen, ausgereiften Arbeitsplatz, eine vollst&auml;ndige B&uuml;rosuite (KOffice), eine gro&szlig;e Sammlung Netzwerk- und Administrationswerkzeuge, sowie eine effiziente, intuitive Entwicklungsumgebung, zu der das ausgezeichnete KDevelop z&auml;hlt. KDE ist "der lebende Beweis", dass das "basar-artige" Entwicklungsmodell Freier Software erstklassige Technologien hervorbringen kann, welche kommerzieller Software gleichwertig, wenn nicht sogar &uuml;berlegen sind.
</P>
<BR><BR>
<FONT SIZE=2>
<EM>Pressemitteilung:</EM> Geschrieben von Harald Fernengel, mithilfe der unsch&auml;tzbaren Unterst&uuml;tzung einer Vielzahl bereitwilliger Helfer aus dem KDE-Projekt.<BR>
<EM>Release-Koordinator:</EM> Danke geht an Matt Rogers f&uuml;r seine Dienste als Release-Koordinator.<BR>
</FONT>
<hr />

<p align="justify">
  <font size="2">
  <em>Markenrechtshinweise.</em>
  KDE<sup>&#174;</sup> und das Logo der K Desktop Environment<sup>&#174;</sup> sind 
  eingetragene Warenzeichen des KDE e.V.

  Linux ist ein eingetragenes Warenzeichen von Linus Torvalds.

  UNIX ist in den Vereinigten Staaten und anderen L&auml;ndern ein eingetragenes
  Warenzeichnen der Open Group.

  Alle anderen in dieser Pressemitteilungen erw&auml;hnten Warenzeichen und
  Copyright-Hinweise sind Eigentum der jeweiligen Besitzer.
  </font>
</p>

<hr />

<H4>Presskontakt:</H4>

Weltweit (deutsch und englisch):
Harald Fernengel, <a href="mailto:harry at kdevelop.org">harry at kdevelop.org</a>, (47) 92043220<BR>
Weltweit (ukrainisch, russisch und englisch):
Alexander Dymo, <a href="mailto:adymo at kdevelop.org">adymo at kdevelop.org</a>, (38) 0675122801<BR>
Weltweit (schwedisch und english):
Jens Dagerbo, <a href="mailto:jens.dagerbo at swipnet.se">jens.dagerbo at swipnet.se</a><BR>
Weltweit (portugiesisch):
Amilcar do Carmo Lucas, <a href="mailto:amilcar at kdevelop.org">amilcar at kdevelop.org</a><BR>

<?php module_tail(); ?>
