<?php module_head("Premios de KDevelop");?>

<ul>

<li>
<H4>Premios 2004 LinuxQuestions.org Members' Choice</H4>
Los miembros de
<a href="http://www.linuxquestions.org/">
LinuxQuestions.org</a> escogieron a KDevelop el
<a href="http://www.linuxquestions.org/questions/t272124.html">
IDE del año 2004</a>.
<br><br>
<img src="graphics/awards/lq_2004mca.png" alt="2004 LinuxQuestions.org Member's Choice Awards  KDevelop - IDE of the year 2004">
<br><br>
</li>

<li>
<H4><a href="http://www.linuxworldexpo.com/">Conferencia &amp; Expo de Linuxworld New York 2004</a>:
Primer premio por "Mejor herramienta de desarrollo"</H4>
Presentado en conjunci&oacute;n con la Asociación UniForum, un seguido de jueces y
expertos de la industria, reconocieron la innovaci&oacute;n de productos/servicios y
soluciones en inform&aacute;tica abierta que fueron ofrecidas por los exibidores.
Es un gran honor recibir un Premio a la Excelencia del Producto. Agradecemos
sinceramente a la comunidad Open Source por su continuo apoyo.
<br><br>
<img src="graphics/awards/lwce_award_logo_2004.gif" alt="Logo de LinuxWord Conference &amp; Expo Award" width="25%">
<br><br>
</li>

<li>
<H4>Premio Linux New Media 2003: Primer puesto por "IDE Development
System" (sistema IDE de desarrollo)</H4>
Un jurado de autores, l&iacute;deres de la industria, y miembros de la Comunidad Open
Source, as&iacute; como editores de Linux Magazine, votaron KDevelop el mejor en la
categor&iacute;a "IDE Development System". KDevelop gan&oacute; con el 29.4% del total de los
votos, segundo y tercer puesto fueron para Eclipse y Anjuta. El art&iacute;culo
completo
<a href="http://www.linux-magazine.com/issue/38/Linux_New_Media_Awards.pdf">
en ingl&eacute;s</a> o <a
href="http://www.linux-magazin.de/Artikel/ausgabe/2003/12/award/award.html">
en alem&aacute;n</a>.
<br><br>
<img src="graphics/awards/lnm_award_logo_2003.jpg" alt="Logo del Premio Linux New Media">
<br><br>
</li>

<li>
<H4>Premio Linux New Media 2002: Segundo puesto por "Best
Development Software" (mejor software de desarrollo)</H4>
En cada una de las 10 categor&iacute;as, el primer, segundo, y tercer puesto fueron
determinados por la votaci&oacute;n de un jurado de 35 personas. El jurado estaba
compuesto de profesionales de Linux incluyendo los equipos editoriales y
contribuidores habituales de Linux Magazine, Linux-Magazin, LinuxUser, y
LInux-Community.de. Otros miembros del jurado eran VIPs de la escena Open Source
y negocios Linux como el coordinador del Kernel Alan Cox, el presidente de Linux
International, Jon "maddog" Hall, Georg Greeve presidente de la Free Software
Foundation Europa, el IBM Linux Evangelist Tom Schwaller, y Kalle Dalheimer.
<br><br>
<img SRC="graphics/awards/lnm_award_logo.jpg" ALT="Logo del premio Linux New Media">
<br><br>
</li>

<li>
<H4>Premo a la mejor herramienta de desarrollo del Open Choice 2002</H4>
Timothy R. Butler (Editor en jefe, Open for Business) escribi?:<br>
"...Me siento contento de anunciar que Open for Busines ha escogido KDevelop
2.1.2 para el premio a la mejor herramienta de desarrollo de Open Choice 2002.
El art&iacute;culo mencionando la entrega del premio de OfB.biz Open Choice 2002 se
encuentra en
<a
href="http://www.ofb.biz/modules.php?name=News&amp;file=article&amp;sid=146">
http://www.ofb.biz/modules.php?name=News&amp;file=article&amp;sid=146</a>...<br>
...Open for Business est&aacute; establecido en los EEUU, de todas formas, somos
exclusivamente una publicaci?n en l&iacute;nea"
<br><br>
<img SRC="graphics/awards/open-choice_awardlogo.jpg" ALT="Logo del premio Open Choice">
<br><br>
</li>

<li>
<H4>Premio Linux Format 2001</H4>
Richard Smedley (editor en producci&oacute;n, Linux Format) dijo:<br>
"Linux Format es la mejor (m&aacute; vieja, mejores ventas, etc... [;-)]) revista
GNU/Linux del Reino Unido, con considerables ventas a lo largo de Escandinavia,
el Benelux, Australia y los EEUU. Al inicio del a&ntilde;o los lectores votaron sobre
que nominaciones poner para cada categor&iacute;a en el sitio (<a
href="http://www.linuxformat.co.uk">www.linuxformat.co.uk</a>),
despu&eacute;s de que las nominaciones fueran decididas, se anunciaron en la revista y
en el sitio, y los votos fueron enviados.

La historia no est&aacute; en la portada del sitio, pero a su debido tiempo el art&iacute;culo
de la revista aparecer&aacute; en nuestros archivos en l&iacute;nea ...
Lo he enviado (el premio) a Mirko Boehm en KDE e.V"
<br><br>
<img SRC="graphics/awards/linux-format_awardlogo.jpg" ALT="Logo del premio Linux Format">
<br><br>
</li>

<li>
<H4>Premio Linux New Media 2001 por la "Mejor herramienta de desarrollo Linux"</H4>
Ralf Nolden acept&oacute; el premio del <a href="http://www.linux-events.de/">Linux New Media AG</a> en la Feria de Sistemas en Munich, Alemania.
 Hemos donado el dinero (1500 Euros) a la <a href="http://www.kde.org/support/">cuenta de la organizaci&oacute;n KDE</a>.<br><br>
<br><br>
</li>

</ul>

<?php module_tail(); ?>
