<?php module_head("Awards for KDevelop");?>

<ul>

<li>
<H4>2004 LinuxQuestions.org Members' Choice Awards</H4>
Os membros de
<a href="http://www.linuxquestions.org/">
LinuxQuestions.org</a> escolheram KDevelop como o
<a href="http://www.linuxquestions.org/questions/t272124.html">
IDE do ano 2004</a>.
<br><br>
<img src="graphics/awards/lq_2004mca.png" alt="2004 LinuxQuestions.org Member's Choice Awards  KDevelop - IDE of the year 2004">
<br><br>
</li>

<li>
<H4><a href="http://www.linuxworldexpo.com">Linuxworld New York 2004 conference &amp; Expo</a>:
Primeiro lugar como "Melhor ferramenta de desenvolvimento"</H4>
Atribu&iacute;do em conjun&ccedil;&atilde;o com a UniForum
Association, um painel de j&uacute;ris e especialistas da industria<br>
avaliaram produtos e servi&ccedil;os inovadores e
solu&ccedil;&otilde;es
"Open Source" oferecidas pelos expositores.<br>
&Eacute; uma grande honra receber um Pr&eacute;mio de Excel&ecirc;ncia
de Produto. Os mais sinceros agradecimentos &aacute;<br>
comunidade Open Source pelo continuado apoio.<br>
<br><br>
<img src="graphics/awards/lwce_award_logo_2004.gif" alt="Logotipo do prémio LinuxWord Conference &amp; Expo Award" width="25%">
<br><br>
</li>

<li>
<H4>Linux New Media Award 2003: Primeiro Lugar para "Sistema de Desenvolvimento IDE"</H4>
Um j&uacute;ri de autores, lideres da industria e membros da
Comunidade Open Source tal como os editores da Linux Magazine votaram o KDevelop como o melhor produto
para a categoria de&nbsp; "Sistemas de Desenvolvimento IDE". O KDevelop venceu com 29.4% dos votos, sendo o segundo e terceiro lugar ocupados respectivamente pelo Eclipse e Anjuta. O artigo completo em
<a href="http://www.linux-magazine.com/issue/38/Linux_New_Media_Awards.pdf">Ingl&ecirc;s</a> ou em
<a href="http://www.linux-magazin.de/Artikel/ausgabe/2003/12/award/award.html">Alem&atilde;o</a>.
<br><br>
<img src="graphics/awards/lnm_award_logo_2003.jpg" alt="Logotipo do premio Linux New Media Award">
<br><br>
</li>

<li>
<H4>Linux New Media Award 2002: Segundo Lugar para "Sistema de Desenvolvimento IDE"</H4>
Nas 10 categorias, o primeiro, segundo e terceiro lugares foram
determinados pelo voto de um j&uacute;ri de 35 pessoas. O j&uacute;ri foi formado por
profissionais de Linux incluindo as equipas editoriais e os principais contribuidores da Linux Magazine,
Linux-Magazin, LinuxUser, e Linux-Community.de. Do j&uacute;ri faziam ainda parte VIPs da
comunidade Open Source e do Linux tais como o Coordenador do Kernel Alan Cox, Jon "maddog" Hall Presidente da Linux International, President Georg Greve Presidente da FreeSoftwareFoundation Europa, o
evangelista IBM Linux Tom Schwaller, e Kalle Dalheimer.
<br><br>
<img SRC="graphics/awards/lnm_award_logo.jpg" ALT="Logotipo do premio Linux New Media Award">
<br><br>
</li>

<li>
<H4>Prémio Open Choice 2002 Best Development Tool</H4>
Timothy R. Butler (Editor Chefe da Open for Business) escreve:<br>
"... Estou contente por anunciar que a Open for Business atribuiu ao KDevelop 2.1.2 ~
o prémio Open Choice 2002 Best Development Tool. O artigo que menciona a atribui&ccedil;&atilde;o 
deste pr&eacute;mio pode ser encontrado em 
 <a href="http://www.ofb.biz/modules.php?name=News&amp;file=article&amp;sid=146">http://www.ofb.biz/modules.php?name=News&amp;file=article&amp;sid=146</a>...<br>
...a Open for Business &eacute; uma publica&ccedil;&atilde;o americana apenas digital ..."<br><br>
<img SRC="graphics/awards/open-choice_awardlogo.jpg" ALT="Logotipo do premio Open Choice Award">
<br><br>
</li>

<li>
<H4>Linux Format Award 2001</H4>
Richard Smedley (Produtor Editor da Linux Format) disse:<br>
"A Linux Format &eacute; a maior (mais antiga, mais vendida, etc...
[;-)] revista sobre GNU/Linux do Reino Unido, com um n&uacute;mero
consider&aacute;vel de vendas na Escandin&aacute;via, Benelux,
Austr&aacute;lia e Estados Unidos. No principio do ano os leitores
votaram nas nomea&ccedil;&otilde;es para as v&aacute;rias categorias no
sitio
(<a href="http://www.linuxformat.co.uk">www.linuxformat.co.uk</a>), 
ap&oacute;s as nomea&ccedil;&otilde;es terem sido anunciadas na revista
e no sitio foi iniciada a vota&ccedil;&atilde;o. O artigo n&atilde;o se
encontra na primeira p&aacute;gina do sitio, mas no seu devido tempo
estar&aacute; disponivel nos arquivos online... Eu irei enviar o
pr&eacute;mio para Mirko Boehm da KDE e.V"<br><br>
<img SRC="graphics/awards/linux-format_awardlogo.jpg" ALT="Logotipo do prémio Linux Format">
<br><br>
</li>

<li>
<H4>Linux New Media Award 2001 para  "Melhor Ferramenta de Desenvolvimento para Linux"</H4>
Ralf Nolden aceitou o pr&eacute;mio da <a href="http://www.linux-events.de">Linux New Media AG</a> 
na feira Systems em Munique, Alemanha. 
N&oacute;s do&aacute;mos o dinheiro (1500 Euro) para a <a href="http://www.kde.org/support/">conta da organiza&ccedil;&atilde;o KDE</a>.<br><br>
<br><br>
</li>

</ul>

<?php module_tail(); ?>
