<?php module_head("Na imprensa");?>

<H4>software.newsforge.com (Maio/2004):</H4>
Newsforge (uma parte do sourceforge) declarou o KDevelop como sendo uma
<a href="http://software.newsforge.com/software/04/04/19/1837246.shtml">aplicação grátis fenomenal</a>
<br><br>
<H4>www.linuxformat.co.uk (Dezembro/2002):</H4>
"N&atilde;o existem d&uacute;vidas que esta &eacute; uma aplica&ccedil;&atilde;o de alta qualidade. As mais recentes vers&otilde;es suportam o novo KDE3 e os colaboradores fizeram um trabalho fant&aacute;stico mantendo-se lado a lado com o desenvolvimento do KDE. Existem numerosas possibilidades tanto para o programador novato como para o mais experiente. Tem algo para praticamente qualquer um exceptuando talvez apenas o
utilizador mais exigente, mas quando toda esta funcionalidade  &eacute; de gra&ccedil;a &eacute; muito dif&iacute;cil apresentar queixas"
<a href="http://www.linuxformat.co.uk/modules.php?op=modload&amp;name=Archives&amp;file=request&amp;arc_request=LXF35.roundup.pdf"> mais...(em formato PDF)</a>
<br><br>
<H4>linux-mag.com (Junho/2001):</H4>
"O KDevelop apresenta um n&uacute;mero de funcionalidades que seriam de esperar na generalidade dos IDEs que test&aacute;mos, mas que no entanto n&atilde;o s&atilde;o encontradas","&Eacute; realmente espantoso como pe&ccedil;a de software open source e como IDE com um grande n&uacute;mero de acess&oacute;rios e funcionalidades" 
<a href="http://www.linux-mag.com/2001-04/IDE_01.html"> more...</a>
<br><br>
<H4>Borders.com (Dezembro/1999):</H4>
"O facto &eacute;, este software vai impulsionar o desenvolvimento de aplica&ccedil;&otilde;es KDE para um outro n&iacute;vel de magnitude porque torna muito f&aacute;cil escrever boas aplica&ccedil;&otilde;es KDE" ... "Eu aconselho vivamente os leitores a experimentarem-no."

<br><br>
<H4>Linuxworld (Novembro/1999):</H4>
"Eu tenho de admitir que estou impressionado com o n&iacute;vel de qualidade oferecida. " ... " Uma coisa &eacute; certa: eu vou utilizar o KDevelop para arrancar com as minhas primeiras aplica&ccedil;&otilde;es de janelas em Linux."<a href="http://linuxworld.com/linuxworld/lw-1999-09/lw-09-vcontrol_2.html"> mais...</a>
<br><br>
<H4>Visual Developer (Novembro/1999):</H4>
"Vai mudar fortemente a forma como programa em Linux. " ... " Pode utiliz&aacute;-lo para editar, gerir projectos, ler documenta&ccedil;&atilde;o, depurar, desenhar interfaces gr&aacute;ficas, utilizar controlo de c&oacute;digo, e visualizar rela&ccedil;&otilde;es de classes numa s&oacute; aplica&ccedil;&atilde;o..."

<?php module_tail(); ?>

<?php module_head("Entrevistas a membros da equipa KDevelop");?>

<H4>www.freehackers.org, Philippe Fremy (Agosto/2002):</H4>
<a href="http://www.freehackers.org/interviews/kdevelop-2002-08/">http://www.freehackers.org/interviews/kdevelop-2002-08/</a>
<br><br>
<?php module_tail(); ?>