<?php module_head("How To Join The KDevelop Team"); ?>
N&atilde;o existem raz&otilde;es para queixas sobre bugs e inexist&ecirc;ncia de funcionalidades. O KDevelop pode apenas ser t&atilde;o bom tanto quanto o que contribu&iacute;res  para o melhorares.<br>
Logo <b>precisamos de ti!</b> A nossa equipa procura sempre bons programadores de QT ou KDE.<br>
<br><br>
Ent&atilde;o o que &eacute; preciso para me tornar um membro da equipa?:
<ul>
<li>ter uma ideia do que &eacute; aborrecido, mau ou em falta no KDevelop e ter a for&ccedil;a de vontade para o implementar.</li>
<li><a href="index.html?filename=HEAD/branches_compiling.html">obter o c&oacute;digo fonte do KDevelop do SVN</a></li>
<li>compilar tudo como vers&atilde;o de debug para localizar os crashes</li>
<li>estudar o c&oacute;digo do KDevelop, efectuar o debug do pr&oacute;prio KDevelop e analizar os backtraces para perceber os v&aacute;rios mecanismos; reconhecer as classes importantes e menos importantes do projecto</li>
<li>corrigir as fontes actuais</li>
<li>criar um ficheiro patch (*.diff) relativo &aacute; vers&atilde;o actual de cvs</li>
<li>envi&aacute;-lo para <a href="index.html?filename=mailinglist.html">kdevelop-devel at kdevelop.org</a></li>
<li>obter resposta, criticas  e amor</li>
<li>escrever muitas mais corre&ccedil;&otilde;es porreiras e chatear a mailing-list com estas</li>
<li>aprender as <a href="http://developer.kde.org/policies/commitpolicy.html">regras de commit do SVN</a></li>
<li>obter a tua pr&oacute;pria conta kdevelop-cvs, e talvez mesmo obter o teu pr&oacute;prio endere&ccedil;o em  kdevelop.org para te permitir adicionar o teu c&oacute;digo por ti mesmo</li>
<li>...</li>
<li>*tornar-se num membro antigo da equipa* ( vendo as pessoas, corre&ccedil;&otilde;es e vers&otilde;es aparecendo e desaparecendo)</li>
<li>...</li>
<li>tornar-se num guru de KDevelop</li>
<li>...</li>
<li>tornar-se rico gra&ccedil;as &aacute;s milhares de ofertas dos f&atilde;s e das coisas doadas... ;-)</li>
<li>...</li>
<li>lan&ccedil;amento do KDevelop-20.5.134</li>
<li>...</li>
<li>Fim.</li>
</ul>

<?php module_tail(); ?>
