<?php module_head("KDevelop 3.0.x Features");?>


<ul>

<li><b>Arquitectura baseada em plugins</b>
<ul>
<li>Novas funcionalidades pode ser adicionadas, substitu&iacute;das ou removidas sem alterar o c&oacute;digo fonte principal.</li>
<li>Licen&ccedil;a de bibliotecas (LGPL) permite a cria&ccedil;&atilde;o de plugins para o IDE comerciais e gr&aacute;tis IDE.</li>
<li>Suporte para perfis que determinam um conjunto de plugins a serem carregados. Isto &eacute; especialmente &uacute;til para ambientes restritos  ou configura&ccedil;&otilde;es personalizadas.</li>
</ul>
</li>

<li><b>Gest&atilde;o de Projectos</b>
<ul>
<li>Suporte nativo n&atilde;o intrusivo para <b>automake</b> e <b>qmake</b>. Modifica&ccedil;&otilde;es manuais s&atilde;o permitidas e reconhecidas pelo IDE, projectos e sub-projectos existentes podem ser facilmente importados.</li>
<li>Habilidade para usar makefiles customizados para construir o projecto.</li>
<li>Suporte para <b>ant</b> - ferramenta de constru&ccedil;&atilde;o para projectos java.</li>
<li>Suporte para tipos de projecto extra como pascal, haskell, ada e projectos de script.</li>
<li>Uma estrutura para adicionar suporte para qualquer sistema de constru&ccedil;&atilde;o criando plugins de constru&ccedil;&atilde;o para o gestor de projectos gen&eacute;ricos.</li>
<li>Assistente de Novo ficheiro para gerir modelos de ficheiro e criar novos ficheiros no projecto a partir de modelos.</li>
<li>Plugins de compilador para definirem op&ccedil;&otilde;es de compila&ccedil;&atilde;o em di&aacute;logos convenientes.</li>
<li>Perfis de configura&ccedil;&atilde;o com a habilidade de especificar diferentes compiladores, flags de compila&ccedil;&atilde;o, directorias de constru&ccedil;&atilde;o, arquitectura alvo, etc.</li>
<li>Funcionalidades para documenta&ccedil;&atilde;o do projecto tais como suporte para a cria&ccedil;&atilde;o autom&aacute;tica de documenta&ccedil;&atilde;o API utilizando <b>doxygen</b> (em formato html, tex ou man) com refer&ecirc;ncias cruzadas para as bibliotecas usadas.</li>
<li>Suporte para internacionaliza&ccedil;&atilde;o, permitindo aos tradutores adicionarem uma linguagem facilmente ao projecto, incluindo suporte para <a href="http://l10n.kde.org/tools/kbabel/" target="main">KBabel</a>.</li>
<li>Suporte para projectos Qt/Embedded (para as plataformas <a href="http://developer.sharpsec.com/" target="_top">Zaurus</a> e <a href="http://www.compaq.com/products/iPAQ/" target="_top">iPAQ</a>).</li>
</ul>
</li>

<li><b>Suporte de Linguagens</b>
<ul>
<li>15 linguagens suportadas incluindo Ada, C, C++, Objective-C (atr&aacute;ves de suporte C), SQL, Fortran, Haskell, Java, PHP, Pascal, Perl, Python, Ruby, Bash, XUL (n&atilde;o oficial).</li>
<li>Relat&oacute;rio de problemas que anuncia v&aacute;rios "problemas" com o c&oacute;digo fonte &aacute; medida que se escreve. Estes problemas incluem erros de sintaxe, TODO's e FIXME's.</li>
<li>Explorador de classes que mostra a hierarquia de classes e outros s&iacute;mbolos no projecto.</li>
<li>Parsers de linguagens utilizados pelo explorador de classes e relat&oacute;rio de problemas.</li>
<li>Assistente de classes, m&eacute;todos e atributos para linguagens orientadas por objectos.</li>
<li>Completa&ccedil;&atilde;o autom&aacute;tica de c&oacute;digo e dicas de c&oacute;digo para vari&aacute;veis de classe, m&eacute;todos, argumentos de fun&ccedil;&otilde;es e outros.</li>
<li>Formata&ccedil;&atilde;o de c&oacute;digo, highlight sint&aacute;ctico e "dobragem" de c&oacute;digo.</li>
<li>Funcionalidades especificas de C++, tais como
<ul>
<li>"criar membro" - cria&ccedil;&atilde;o da defini&ccedil;&atilde;o de m&eacute;todos no ficheiro fonte baseado na declara&ccedil;&atilde;o do m&eacute;todo no ficheiro de cabe&ccedil;alho;</li>
<li>"extrair interface"- extrac&ccedil;&atilde;o de interface (m&eacute;todos declarados) e cria&ccedil;&atilde;o de classes bases abstractas com essa interface;</li>
<li>"sub-classes" - cria&ccedil;&atilde;o autom&aacute;tica de sub-classes e implementa&ccedil;&atilde;o de slots para formul&aacute;rios QT Designer.</li>
</ul>
</li>
</ul>
</li>

<li><b>Debugger Integrado</b>
<ul>
<li>Frontends para GDB e debugger Java.</li>
<li>Consola GDB integrada.</li>
<li>Watchpoints e breakpoints em linhas, endere&ccedil;os e m&eacute;todos.</li>
<li>Breakpoints condicionais.</li>
<li>Desassemblador e visualizador da pilha de chamadas.</li>
<li>&Aacute;rvore de visualiza&ccedil;&atilde;o de vari&aacute;veis.</li>
<li>Visualizadores de mem&oacute;ria, registos e bibliotecas.</li>
<li>Suporte para shell de debug (libtool).</li>
<li>Debugging remoto.</li>
</ul>
</li>

<li><b>Edi&ccedil;&atilde;o de c&oacute;digo</b>
<ul>
<li>Qualquer editor que implemente a interface KDE KTextEditor pode ser utilizado com o KDevelop.</li>
<li>Actualmente os editores dispon&iacute;veis s&atilde;o o <a href="http://kate.kde.org/" target="main">Kate</a>, QEditor (baseado no editor do Qt Designer) e KVim.</li>
<li>Marcadores abrangendo todo o projecto que s&atilde;o armazenados no ficheiro de projecto.</li>
<li>Visualizador de diferen&ccedil;as entre o texto em edi&ccedil;&atilde;o e o texto no disco.</li>
<li>Visualizador de diferen&ccedil;as para ficheiros de correc&ccedil;&atilde;o.</li>
<li>Integra&ccedil;&atilde;o com o Grep - pesquisas no projecto utilizando express&otilde;es regulares.</li>
<li>Pesquisa e substitui&ccedil;&atilde;o abrangendo todo o projecto.</li>
</ul>
</li>

<li><b>Sistema de Controlo de Vers&otilde;es</b>
<ul>
<li>Uma API comum para incluir suporte para controlo de vers&otilde;es no KDevelop.</li>
<li>Sistemas de controlo de vers&otilde;es suportados: CVS, Perforce, Subversion e Clearcase.</li>
</ul>
</li>

<li><b>Assistente de Aplica&ccedil;&atilde;o</b>
<ul>
<li>O assistente de aplica&ccedil;&atilde;o gera aplica&ccedil;&otilde;es de exemplo completas, prontas a serem utilizadas.</li>
<li>Existem modelos para cada uma linguagens suportadas e diferentes sistemas de constru&ccedil;&atilde;o.</li>
<li>Possibilidade de utilizar modelos de aplica&ccedil;&atilde;o personalizados n&atilde;o inclu&iacute;dos na distribui&ccedil;&atilde;o.</li>
<li>Um punhado de modelos de projectos para KDE (aplica&ccedil;&otilde;es KPart,aplica&ccedil;&otilde;es KDE simples, m&oacute;dulos KControl, applets Kicker (painel), parts KOffice, KIOSlaves, plugins <a href="http://www.konqueror.org/" target="main">Konqueror</a>, Noatun e Kate e estilos de ambiente de trabalho).</li>
</ul>
</li>

<li><b>Visualiza&ccedil;&atilde;o de Documenta&ccedil;&atilde;o</b>
<ul>
<li>Uma interface unificada para explora&ccedil;&atilde;o da documenta&ccedil;&atilde;o.</li>
<li>Capacidade para tabela de conte&uacute;dos, indicies e pesquisa total de texto (usando htdig).</li>
<li>Autodetec&ccedil;&atilde;o e inclus&atilde;o de documenta&ccedil;&atilde;o Qt, KDE Libs e DevHelp.</li>
<li>Suporte para colec&ccedil;&otilde;es de documenta&ccedil;&atilde;o costumizada (formato KDevelopTOC).</li>
<li>Capacidade para abrir documenta&ccedil;&atilde;o local, remota ou mesmo comprimida (utilizando qualquer protocolo suportado pelo Konqueror - http, ftp, sftp, tar, zip, etc.).</li>
<li>Capacidade para abrir documenta&ccedil;&atilde;o em v&aacute;rios formatos (html, text, ps, pdf, chm, etc.).</li>
</ul>
</li>

<li><b>Outras Caracter&iacute;sticas</b>
<ul>
<li>A interface de utilizador &eacute; completamente configur&aacute;vel, permitindo a mudan&ccedil;a no momento do modo entre os modos cl&aacute;ssicos MDI como o toplevel, janela filha e o novo modo IDEAl que disponibiliza barras de ferramentas deslizantes.</li>
<li>Consola embebida.</li>
<li>Selector de ficheiros, &aacute;rvore de ficheiros e grupo de ficheiros, funcionalidades que eliminam a necessidade de um gestor de ficheiros externo.</li>
<li>Inclus&atilde;o de um qualquer programa que necessite para desenvolvimento pela sua adi&ccedil;&atilde;o ao menu de "Ferramentas" de acordo com as suas necessidades particulares.</li>
<li>Testador de express&otilde;es regulares.</li>
<li>Integra&ccedil;&atilde;o do Valgrind permite a detec&ccedil;&atilde;o de fugas de mem&oacute;ria.</li>
<li>Ferramenta para distribui&ccedil;&atilde;o e empacotamento do projecto para cria&ccedil;&atilde;o autom&aacute;tica de pacotes de c&oacute;digo fonte e bin&aacute;rios.</li>
<li>Integra&ccedil;&atilde;o CTags.</li>
<li>Explorador de Part's para pesquisar os diversos servi&ccedil;os KDE.</li>
</ul>
</li>
</ul>

<?php module_tail();?>
