<?php module_head("Not&iacute;cias de 2000");?>
<b>20 December 2000</b> - KDevelop1.3 for KDE2.1? Many users have asked for it, so <a href="mailto:jbb at kdevelop.org">John Birch</a> and some others started to porting it some days ago. It contains some bugs, has no new feature (new features will be in KDevelop 2.0), but the first <a href="graphics/kdevelop_1_4.jpg">screenshot</a> looks very promising. The first beta version will be released together with KDE2.1.
<br>
<br>

<b>11 December 2000</b> - The KDevelop Team is proud to announce the release of <b>KDevelop 1.3</b>. This version is a major update release that follows the successful versions 1.1 and 1.2 to enable developers for rapid application development for the new KDE 2.0 Desktop. Please see the official <a href="1.3/announce-kdevelop-1.3.html">Press Release</a> for more details. You can download a precompiled <a href="ftp://ftp.kdevelop.org/pub/kdevelop/kdevelop-1.3-linux-i386.tar.bz2">version</a> which runs on every Linux/i386 desktop or the full source code <a href="ftp://ftp.kdevelop.org/pub/kdevelop/kdevelop-1.3.tar.bz2">version</a>. Please use the <a href="index.html?filename=1.3/kdevelop.html#Downloads">mirrors</a> in case the server is blocked.
<br>
<br>

<b>27 November 2000</b> - <b>KDevelop1.3beta1</b> released. This versions contains updated KDE2 templates (XML-framework,KAction), support for Qt Designer,Qt Linguist and doxygen. There are also 3 new tools (kimport, kdevdlg2ui, one2two), some new configuration options and as always some bugfixes.<br>KDevelop1.3 needs Qt1/KDE1 libs to compile, but we have also build a precompiled <a href="ftp://ftp.kdevelop.org/pub/kdevelop/kdevelop-1.3beta1-1-linux-i386.tar.bz2">package</a> for i386/Linux, which runs without an installed KDE1. Have fun!
<br>
<br>

<b>26 October 2000</b> - Another tourdate is posted from <a href="mailto:rnolden at kdevelop.de">Ralf Nolden</a> to show KDevelop: first, there
is the Systems expo in Munich, Germany, where KDevelop will be shown at the KDE booth from Nov. 7th to Nov. 10th and right after that, he?ll be available
for your questions at the Comdex expo in Las Vegas, USA from Nov. 13th to Nov. 17th, also at the KDE booth. Meet you there !
<br>
<br>
<b>20 October 2000</b> - KDE 2.0 is coming up and with it a new version of KDevelop. Although it still will depend on KDE 1.x libraries and is
an updated KDevelop 1.2, the new version will contain support for the latest API in KDE 2 as well as for creating dialogs with the Qt desinger.
Further, a new tourdate: <a href="mailto:rnolden at kdevelop.de">Ralf Nolden</a> will be present at the Systems expo in Munich, Germany from November 7th
to November 10th at the KDE booth. If you have questions regarding KDE 2 development with KDevelop, please drop in and ask, he?s eager to make you
a new KDE developer !
<br>
<br>
<b>03 October 2000</b> - The KDevelop Team on Tour again ! Ralf Nolden and Bernd Gehrmann, KDevelop Developers, will be present at the KDE and TrollTech booth during the Linux World Expo &amp; Conference in Frankfurt,
Germany from Oct. 5th to Oct. 7th.  Ralf can also be met at the Oldenburger Linuxtage on Oct. 14th in Oldenburg, Germany.<br>
<br>
<b>29 August 2000</b> - Florent Pillet released the 1.0 version of <a href="http://kprof.sourceforge.net/">KProf</a>. It is a nice KDE2 application that displays the execution profiling output generated by <a href="http://www.gnu.org/manual/gprof-2.9.1/gprof.html">gprof</a>.<br>
<br>
<b>3 August 2000</b> - There is a new developer portal for all KDE/Qt programmers. <a href="http://www.ksourcerer.org">KSourcerer</a> contains a class repository where you can browse and download useful classes for your applications. Please support this interesting project!<br>
<br>
<b>29 Juli 2000</b> - Thomas Fromm has added a small <a href="index.html?filename=events/linuxtag2000.html">LinuxTag report</a>.
There you can see pictures of the first KDevelop Meeting at the <a href="http://www.linuxtag.org">LinuxTag 2000</a>.<br>
<br>
<b>19 June 2000</b> - <a href="http://www.sco.com">The Santa Cruz Operation (SCO)</a> has sponsored KDevelop-Developer
<a href="mailto:rnolden at kdevelop.de">Ralf Nolden</a> a new PIII/600 machine  (512 MB RAM, 2x 15GB HDD) for programming
on KDevelop and helping to make KDE 2.0 and KDevelop available on SCO?s UnixWare7 Operating System.
Thanks to SCO, good hardware is always needed by the KDevelop Team. If you?d like to follow SCO`s example and sponsor us, please feel
free to contact us ! For more information have a look at our new <a href="index.html?filename=sponsors.html">Sponsors</a> page.
<br><br>

<b>19 June 2000</b> - <a href="http://www.siemens.de">Siemens Germany</a>, supports us with sponsoring <a href="mailto:Ingo.Zevenbergen at post.rwth-aachen.de">
Ingo Zevenbergen</a> to write a new C/C++ reference for the upcoming KDevelop 2.0. The reference will be written in docbook style and integrate seamlessly into
KDevelop and fully KDevelop-copyrighted. Thanks to Siemens !
<br><br>

<b>7 de Junho de 2000</b> - <a href="mailto:rnolden at kdevelop.de">Ralf Nolden</a> apresentar&aacute; o KDevelop 1.2 e uma t&iacute;mida pr&eacute;via na exibi&ccedil;&atilde;o
 <a href="http://www.linuxtag.org">LinuxTag 2000</a>  em Stuttgart, Alemanha na sexta-feira, 30 de Junho entre &aacute;s 16:30 e 17:30 no stand da
 <a href="http://www.id-pro.de">ID-PRO</a>. Ele tamb&eacute;m estar&aacute; dispon&iacute;vel no stand da KDE por toda exibi&ccedil;&atilde;o desde a quinta-feira at&eacute; domingo
para falar sobre o KDE e KDevelop-so encontre-o se voc&ecirc; estiver por l&aacute; !<br><br>

<b>5 de Junho de 2000</b> - <a href="mailto:Richard_Dale at tipitina.demon.co.uk">Richard Dale</a> disponibilizou sua <a href="ftp://fara.cs.uni-potsdam.de/incoming/kdkobjc-0.2.tar.gz">atualiza&ccedil;&atilde;o do Objective C </a> para KDevelop 1.2.
Ela inclui uma atualiza&ccedil;&atilde;o para o editor de di&aacute;logo, criando c&oacute;digo Objective C para Kangoroo (
This one includes a patch for the dialog editor to create Objective C code for Kangaroo (uma tentativa de encapsular Qt classes em Objective C). <br><br>

<b>23 de Maio de 2000</b> - <a href="mailto:RFunken at kdevelop.de">Ralf Funken</a>
da equipe do KDevelop fez um livro dos manuais do KDevelop 1.2.
O livro est&aacute; dispon&iacute;vel no formato postscript (tamanho carta e DIN A4) ou como pacote de fonte (contendo todos os arquivos necess&aacute;rios para construir o livro + README).
Voc&ecirc; pode baixar os pacotes <a href="ftp://129.187.206.68/pub/unix/ide/KDevelop/documentation/kdevelop_book" target=_top>daqui</a>.<br>
OpenDocs, que j&aacute; forneceu a vers&atilde;o 1.0 do livro, publicar&aacute; uma vers&atilde;o impressa em breve.  Novamente, cerca de 40% do lucro bruto ser&aacute; reinvestido
no projeto KDevelop para ajudar na continua&ccedil;&atilde;o do desenvolvimento.<br><br>

<b>16 de Maio de 2000</b> - Cosource publicou uma <a href="http://www.cosource.com/digest/lineo.html" target=_top>entrevista</a> com Lineo CTO Tim Bird sobre o patroc&iacute;nio de projetos de c&oacute;digo aberto. Algum tempo atr&aacute;s Lineo patrocinou a integra&ccedil;&atilde;o do htdig ao KDevelop. <br><br>

<b>4 de Maio de 2000</b> -<b>KDevelop 1.2 vers&atilde;o final</b>. adiciona &agrave; vers&atilde;o 1.1 muitas novas tradu&ccedil;&ograve;es, suporte ao desenvolvimento de aplica&ccedil;&ograve;es GNOME, v&aacute;rios melhoramentos do doc browser e do debugador integrado e ainda muitas corre&ccedil;&otilde;es.
H&aacute; tamb&eacute;m uma atualiza&ccedil;&atilde;o do <b>KDE Development Kit</b>, que cont&eacute;m quase tudo para um bem sucedido desenvolvimento de aplica&ccedil;&otilde;es C/C++  para KDE.<br><br>

<b>8 de Abril de 2000</b> - <a href="mailto:Ralf.Nolden at post.rwth-aachen.de">Ralf Nolden</a>
da equipe KDevelop dar&aacute; uma apresemta&ccedil;&atilde;o sobre o KDevelop <a href="http://Braunschweiger.LinuxTage.de/programm/index.html.en" target=_top> (veja o sal&atilde;o A &agrave;s 15.00)</a> na <a href="http://Braunschweiger.LinuxTage.de/index.html.en" target=_top>Segunda Braunschweig Linux-Days</a> no domingo 14 de Maio de 2000. se ocorrer de voc&ecirc; estar por perto nesta hora, apare&ccedil;a! <br><br>

<b>6 de Abril 2000</b> - KDevelop na Imprensa ! Veja na p&aacute;gina 88 da edi&ccedil;&atilde;o de 4/3/2000 de <a href="http://www.infoworld.com" target=_top>InfoWorld</a> um <a href="http://www.infoworld.com/cgi-bin/deleteframe.pl?story=/articles/op/xml/00/04/03/000403oppetreley.xml" target=_top>artigo</a> sobre Qt e KDevelop. Nicholas Petreley diz "... Eu recomendo a voc&ecirc;s dar uma olhada num programa chamado KDevelop, dispon&iacute;vel em www.kdevelop.org. Ele &eacute; uma beleza de ambiente integrado de programa&ccedil;&atilde;o gr&aacute;tis para KDE e Qt, e ainda inclui documenta&ccedil;&agrave;o e tutorial do Qt..." <br><br>

<b>30 de Mar&ccedil;o de 2000</b> - Algumas novidades da homepage: Novas se&ccedil;&otilde;es como <a href="index.html?filename=1.3/kdevelop.html#Tutorials">Tutoriais</a> do KDevelop e <a href="index.html?filename=splashscreens.html">telas de splash</a>, adicionado o 40a
<a href="index.html?filename=users.html">app</a> criada usando KDevelop. Os <a href="index.html?filename=in_the_press.html">press releases</a> para KDevelop1.0 e 1.1 est&atilde;o on-line agora.<br><br>

<b>21 de Mar&ccedil;o de 2000</b> - <a href="mailto:geiseri at msoe.edu">Ian Reinhart Geiser</a> atualizou seu "projeto de desenvolvimento para conversor de arquivo spec "<a href="http://www.msoe.edu/~geiseri/projects.phtml?project=Kpp" target=_top> Kpp</a> para KDevelop.
Esta vers&atilde;o cont&eacute;m novos recursos e trabalha com a nova vers&atilde;o do KDevelop. <br><br>

<b>7 de Mar&ccedil;o de 2000</b> - Agora um novo diret&oacute;rio (chamado "kdk_updates") nos espelhos de ftp foi aberto. Nele voc&ecirc; pode pegar atualiza&ccedil;&otilde;es de pacotes do KDK,
se eles n&atilde;o tiverem seus pr&oacute;prios homesites. Neste caso h&aacute; outro kdesgmltools-package (novo snapshot CVS com uma pequena atualiza&ccedil;&atilde;o).
Clique <a href="ftp://129.187.206.68/pub/unix/ide/KDevelop/kdk_updates" target=_top>aqui</a> para ir para este diret&oacute;rio.<br><br>

<b>3 de Mar&ccedil;o de 2000</b> - Os <b>Manuais completos do KDevelop 1.1</b> est&atilde;o disponiveis nos seguintes formatos: dvi, PostScript, PDF, todos em carta e A4: <a href="ftp://fara.cs.uni-potsdam.de/incoming" target=_top>Download</a><br><br>

<b>3 de Mar&ccedil;o de 2000</b> - H&aacute; pacotes bin&aacute;rios do KDevelop 1.1 e/ou KDE Development Kit 1.1 dispon&iacute;veis para as seguintes plataformas: Linux (SuSE 6.x, RedHat 6.1, Mandrake 7, Debian 2.1), FreeBSD 4.0 and Unixware 7. Agradecimentos a todos os colaboradores!<br><br>

<b>2 de Mar&ccedil;o de 2000</b> - <a href="http://www.linuxports.com" target="_top">Linuxports.com</a> est&aacute; <b>comercializando</b> Developing Linux Applications: KDE Edition.<br>
Este livro &eacute; uma vers&atilde;o impressa de toda a documenta&ccedil;&atilde;o on-line do KDevelop.  Tamb&eacute;m at&eacute; 30% do lucro bruto &eacute; reinvestindo no projeto KDevelop, ajudando a manter o desenvolvimento.<br><br>

<b>29 Februar 2000</b> - <a href="mailto:Richard_Dale at tipitina.demon.co.uk">Richard Dale</a> updated his Objective C <a href="ftp://129.187.206.68/pub/unix/ide/KDevelop/patches/KDKOBJC-0.1.tar.gz">patch</a> for the KDE Development Kit. With this patch installed you can develop for GNUstep with KDevelop. Thanks to Richard!<br><br>

<b>28 Februar 2000</b> -<b>KDevelop 1.1 final</b> released. In addition to the 1.0 release this version contains many new <a href="index.html?filename=1.3/changes.html">features</a> and important bugfixes. There is also an updated <b>KDE Development Kit</b>, which contains nearly everything you need for a successful C/C++ and KDE development.<br><br>

<b>21 Februar 2000</b> -Petr Sorfa (petrs at sco.com) wrote a <a href="http://www.sco.com/skunkware/kde/kdevelop_tutorial/" target=_top>tutorial</a> for absolute beginners of KDevelop. It can be
viewed at <a href="http://www.sco.com" target=_top> www.sco.com</a>. Thank you very much!<br><br>

<table><tr><td>
 <center><a href="phorum5/read.php?2,1">
 <img src="graphics/forum.gif" alt="forum pic" border=0></a></center>
</td> <td valign=top> <b>11 February 2000</b> - The KDevelop team is proud to present their own <b>KDevelop forum</b>.
It is intended to start discussion concerning KDevelop, KDE and QT related topics. Feel free to post in it for these
subjects. Another feature: You will be automatically mailed, if someone replies on your posting.<br>
To have a look at it click either the picture or <a href="phorum5/read.php?2,1">here</a>.
<br></td></tr></table>

<b>4 February 2000</b> - Release of the pregenerated <b>KDE library documentation 1.1Beta2</b> for usage with KDevelop. This version fixes the bug with the cross-links to the QT library documentation and some other minors.
After installing it rerun "kdevelop --setup" and the documentation should be automatically found...<br>
This package can be found in the "documentation" directory of the mirrors.
Click <a href="index.html?filename=1.3/kdevelop.html#Downloads">here</a> for the download section.<br>

<table><tr><td>
 <center><img src="graphics/small_1_1_logo.jpg" alt="kdevelop logo" border=0>
            </center>
</td> <td valign=top> <b>31 January 2000</b> - Release of <b>KDevelop 1.1Beta2</b>. This version contains 7 new base applications, an improved internal debugger and several other features and bugfixes. Click <a href="index.html?filename=1.3/changes.html">here</a> for more information.<br></td></tr></table>


<table><tr><td>
 <center><a href="http://www.linuxports.com" target="_top">
              <img src="graphics/coversmall.jpg" alt="book picture" border=0></a></center>
</td> <td valign=top> <b>26 January 2000</b> - <a href="http://www.linuxports.com" target="_top">Linuxports.com</a> are now accepting preorders for "Developing Linux Applications: KDE Edition".<br>This book comes with all of the KDevelop Documentation in printed format plus Unofficial Redhat 6.1 and KDevelop 1.0. Also up to 40% of the gross profits go back to the KDevelop project to help continue development.</td></tr></table>

<b>20 January 2000</b> - <a href="mailto:Richard_Dale at tipitina.demon.co.uk">Richard Dale</a> updated his Objectiv C <a href="ftp://fara.cs.uni-potsdam.de/incoming/kdevelop-1.1-beta1.0objc.patch.gz">patch</a> for KDevelop 1.1beta1.<br><br>

<b>17 January 2000</b> - Release of <b>KDevelop 1.1Beta1</b>. This version contains many new features and several bugfixes.Thanks to all who contributed to this release. Click <a href="index.html?filename=1.3/changes.html">here</a> for more information.<br><br>

<b>13 January 2000</b> - <a href="mailto:Nils.Ulltveit-Moe at hia.no">Nils Ulltveit-Moe</a> made a  <a href="ftp://fara.cs.uni-potsdam.de/incoming/nfs.patch">patch</a> that fix several problems if you use KDevelop 1.0 in NFS (Network File System) environments.<br><br>

<b>10 January 2000</b> - <a href="mailto:belran at worldnet.att.net">Robert.M.Wheat</a> made a patch to add an OpenGL(tm) project to the application wizard. This <a href="ftp://fara.cs.uni-potsdam.de/incoming/kdevelop-1.0beta4.1_ogl_diff.tar.gz">patch</a> works with 1.0Beta4 and 1.0final.<br>
<br>
<b>7 January 2000</b> - <a href="http://www.linuxports.com/" target=_top>Linuxports.com </a> will be selling "Developing Applications for Linux: KDE Edition". The book contains the complete KDevelop online documentation and comes with Unofficial Redhat 6.1 and a KDevelop 1.0.<br>
<br>

<b>3 Januar 2000</b> - <a href="mailto:a2h8fu at bg.bib.de">Ralf Funken</a> made a binary package of the KDE Development Kit for Redhat 6.1 (x86) . Download <a href="ftp://129.187.206.68/pub/unix/ide/KDevelop/binaries/RedHat-6.1/kdk-1.0a-1.i386.rpm"> here.</a> The package was linked against the libstdc++ 2.95, which you can get <a href="ftp://ftp.redhat.com/pub/contrib/libc6/i386/libstdc++-2.95.1_2.10.0-3.i386.rpm">here</a> .<br>
<br>

<?php module_tail();?>
