<?php module_head("Not&iacute;cias de 2004");?>
<b>23 de Dezembro de 2004</b> - O quarto fasciculo das notas técnicas KDevelop está pronto.
<br><a href="doc/technotes/navigation.html">Fasciculo 4: Effective code navigation</a><br>
<br>
<b>08 de Dezembro de 2004</b> - A versão <em>bugfix</em> KDevelop 3.1.2 foi lan&#231;ada ao publico.
As altera&#231;ãoes estão no <a href="index.html?filename=3.1/changes.html">Changelog</a>.
Pode fazer o <em>download</em> na <a href="index.html?filename=3.1/download.html">página de downloads </a>.
Todos os utilizadores são <b>seriamente recomendados a fazer o update</b> para esta versão pois ela corrige muitas regressões.<br>
Nós também corrigimos <b>todos</b> os <em>broken links</em> das 18000 páginas deste website :) Disfrute<br>
<br>
<b>05 de Dezembro de 2004</b> - Um outro fasciculo das notas técnicas KDevelop está pronto.
<br><a href="doc/technotes/rubyrad.html">Fasciculo 3: RAD with KDevelop using Ruby/Qt/KDE</a><br>
<br>
<b>30 de Novembro de 2004</b> - Os dois primeiros fasciculos das notas técnicas KDevelop estão publicados no nosso site.
<br><a href="doc/technotes/kdevassistant.html">Fasciculo 1: Browsing documentation with KDevAssistant</a>
<br><a href="doc/technotes/cpprad.html">Fasciculo 2: RAD with KDevelop using C++/Qt/KDE</a><br>
<br>
<b>04 de Novembro de 2004</b> 
- O wiki est&aacute; novamente no ar e cont&eacute;m documentos de pol&iacute;ticas de desenvolvimento e informa&ccedil;&otilde;es
sobre a vindoura Plataforma do KDevelop.<br>
<br>
<b>18 de Outubro de 2004</b> 
- Nosso servidor apache com PHP5 est&aacute; de volta ao ar, logo o chat on-line e o f&oacute;rum
est&atilde;o <a href="phorum5/read.php?2,26159">funcionando novamente</a>.
O wiki ser&aacute; consertado na pr&oacute;xima semana.<br>
<br>
<b>12 de Outubro de 2004</b> - A vers&atilde;o do KDevelop 3.1.1 (bugfix) foi lan&ccedil;ada.
As altera&ccedil;&otilde;es est&atilde;o no <a href="index.html?filename=3.1/changes.html">Changelog</a>.
Voc&ecirc; pode baix&aacute;-la na <a href="index.html?filename=3.1/download.html">p&aacute;gina de download</a>.<br>
<br>
<b>27 de Setembro de 2004</b> - Estamos novamente <em>on-line</em> ap&oacute;s um per&iacute;odo de tr&ecirc;s dias
devido a um HD quebrado. N&oacute;s perdemos tr&ecirc;s semanas de dados no nossos bancos de dados do f&oacute;rum e 
wiki e algumas partes do website ainda n&atilde;o foram recuperadas. Solicitamos paci&ecirc;ncia, pois iremos
relatar a medida que os problemas forem resolvidos.<br>
<br>
<b>14 de Setembro de 2004</b> - Algumas fotos da equipe do KDevelop (tiradas durante o evento aKademy KDE World Summit) est&atilde;o dispon&iacute;veis na nossa <a href="index.html?filename=events/akademy2004.html">p&aacute;gina do evento akademy2004</a>.<br>
Voc&ecirc; tamb&eacute;m pode baixar uma <a href="3.1/doc/promo/presentation.kpr">apresenta&ccedil;&atilde;o</a> que foi exibida na <em>confer&ecirc;ncia de Usu&aacute;rios e Administradores do KDE</em>.<br>
<br>
<b>19 de Agusto de 2004</b> - KDevelop 3.1 lan&ccedil;ado em conjunto com o KDE 3.3.
Veja o <a href="3.1/announce-kdevelop-3.1.html">comunicado de imprensa oficial</a>,
as altera&ccedil;&otilde;es encontram-se no <a href="index.html?filename=3.1/changes.html">Changelog</a>
 e descarregue os <a href="index.html?filename=3.1/download.html">pacotes</a>!<br>
<br>
<b>22 de Julho de 2004</b> - O KDevelop 3.1 beta 2 foi lan&ccedil;ado em conjunto com o KDE 3.3 beta 2.
Voc&ecirc; pode descarrega-lo na p&aacute;gina de <a href="index.html?filename=3.1/download.html">download</a>.<br>
<br>
<b>16 de Julho de 2004</b> - Haver&aacute; um <a href="http://conference2004.kde.org/tut-kdevelop.php">Workshop sobre o KDevelop</a>
durante a <a href="http://conference2004.kde.org">Confer&ecirc;ncia Mundial da Comunidade KDE no dia 26 de agosto </a>em Ludwigsburg/Alemanha.<br>
A tradu&ccedil;&atilde;o para chin&ecirc;s simplificado do website foi completada por Kun Xi.<br>
<br>
<b>07 de Julho 2004</b> - O KDevelop 3.1 beta 1 foi lan&ccedil;ado juntamente com o KDE 3.3 beta 1.
Pode ser baixado na <a href="index.html?filename=3.1/download.html">p&aacute;gina de download</a>.<br>
<br>
<b>17 de Junho 2004</b> - O website agora est&aacute; completamente traduzido para o
Alem&atilde;o, Espanhol, Fran&ccedil;&ecirc;s, Polaco, Portugu&ecirc;s e Portugu&ecirc;s do Brasil. O nosso agradecimento aos tradutores:
Christian Weickhmann, Philipp Wagner, Miguel &Aacute;ngel De Blas B&uacute;rdalo, Alejandro Exojo, Anne-Marie Mahfouf, Marcin Mikolajczyk,
Jo&atilde;o Luis Silva Assun&ccedil;&atilde;o, Amilcar do Carmo Lucas, Eric Jardim e Helio Roberto Santana.<br>
<br>
<b>09 de Junho 2004</b> - O KDevelop 3.0.4 foi lan&ccedil;ado juntamente com o KDE 3.2.3.
As altera&ccedil;&otilde;es encontram-se no <a href="index.html?filename=3.0/changes.html"><i>Changelog</i></a>.
Pode ser baixado na <a href="index.html?filename=3.0/download.html">p&aacute;gina de download</a>.
Cont&eacute;m tradu&ccedil;&otilde;es para Hindu e Esloveno.<br>
<br>
<b>02 de Maio 2004</b> - O website est&aacute; funcionando novamente.
Um ataque ao nosso servidor apache resultou em 8 dias de inatividade.
Mas agora estamos com novo um hardware, 3 vezes mais r&aacute;pido do que
o antigo, rodando SuSE 9.0. N&oacute;s tamb&eacute;m temos muitos novos bin&aacute;rios na
p&aacute;gina de download e mais inform&ccedil;&otilde;es para os tradutores.<br>
<br>
<b>19 de Abril de 2004</b> - O KDevelop 3.0.3 foi lan&ccedil;ado junto com o KDE 3.2.2.
As modifica&ccedil;&otilde;es est&atilde;o no <a href="index.html?filename=3.0/changes.html">Changelog</a>.
&Eacute; poss&iacute;vel fazer o download <a href="index.html?filename=3.0/download.html">nesta p&aacute;gina</a>.
Esta vers&atilde;o est&aacute; completamente traduzida para: Dinamarqu&ecirc;s, Alem&atilde;o, Ingl&ecirc;s da Inglaterra, Espanhol, Estoniano,
Fran&ccedil;&ecirc;s, Hungaro, Italiano, Polaco, Portugu&ecirc;s, Portugu&ecirc;s do Brasil, Servio e Sueco.
E est&aacute; mais de 87% traduzido para: Catal&atilde;o, Japon&ecirc;s, Holand&ecirc;s, Russo, Tamil e Chin&ecirc;s simplificado.<br>
<br>
<b>22 de Mar&ccedil;o de 2004</b> - N&oacute;s temos um novo tradutor espanhol. Miguel &Aacute;ngel De Blas B&uacute;rdalo - seja bem-vindo ao time!<br>
<br>
<b>13 de Mar&ccedil;o de 2004</b> - Temos um novo tradutor de Alem&atilde;o, Philipp Wagner, bem-vindo ao time!
Ressucitamos uma antiga tradu&ccedil;&atilde;o de Portugu&ecirc;s do Brasil que n&oacute;s tinhamos mas ainda nos faltam todos os arquivos da
vers&atilde;o 3.0. Por isso continuamos procurando um tradutor brasileiro.<br>
<br>
<b>10 de Mar&ccedil;o de 2004</b> - J&aacute; que terminamos o novo design do Website estamos procurando por tradutores para
Portugu&ecirc;s do Brasil, Espanhol e Alem&atilde;o. Se voc&ecirc; desejar colaborar contacte o webmaster. O endere&ccedil;o est&aacute; no final desta p&aacute;gina.<br>
<br>
<b>09 de Mar&ccedil;o de 2004</b> - Lan&ccedil;amento do KDevelop 3.0.2 em conjunto com o KDE 3.2.1.
As mudan&ccedil;as est&atilde;o em <a href="index.html?filename=3.0/changes.html">Changelog</a>.
Voc&ecirc; pode baix&aacute;-lo na <a href="index.html?filename=3.0/download.html">p&aacute;gina de download</a>.<br>
<br>
<b>06 de Mar&ccedil;o de 2004</b> - Nova identidade visual de nosso site.
O nosso site &eacute; muito importante na <a href="HEAD/doc/api/html/architecture.html#devteammodel">Infra-estrutura de desenvolvimento do KDevelop</a>.
O principal objetivo foi permitir p&aacute;ginas web dependentes da vers&atilde;o.
Isto posibilita apresentar informa&ccedil;&otilde;es sobre a vers&atilde;o <a href="index.html?filename=3.0/kdevelop.html">est&aacute;vel</a>
(3.0.x) bem como sobre vers&otilde;es de desenvolvimento (HEAD).<br>
Isto teve muitos <i>efeitos colaterais</i>:
resurgiram informa&ccedil;&otilde;es do velho <a href="index.html?filename=1.3/kdevelop.html">KDevelop-1.x</a>,
<a href="http://www.w3.org/">W3C</a> padroniza&ccedil;&atilde;o HTML, remo&ccedil;&atilde;o de links quebrados, maior utiliza&ccedil;&atilde;o de CSS,
usu&aacute;rios podem escolher entre 4 CSS diferentes, utiliza&ccedil;&atilde;o do mecanismo de procura do google e por &uacute;ltimo, por&eacute;m n&atilde;o menos importante, um novo design.
Esparamos que voc&ecirc; goste - Amilcar Lucas.<br>
<br>
<b>16 de Fevereiro de 2004</b> - Lan&ccedil;amento do KDevelop 3.0.1.
As mudan&ccedil;as est&atilde;o no <a href="index.html?filename=3.0/changes.html">Changelog</a>.
Voc&ecirc; pode baix&aacute;-lo na <a href="index.html?filename=3.0/download.html">p&aacute;gina de download</a>.<br>
<br>
<b>03 de Fevereiro de 2004</b> - Lan&ccedil;amento do KDevelop 3.0 juntamente com o KDE 3.2.
Veja o <a href="3.0/announce-kdevelop-3.0.html">lan&ccedil;amento oficial</a>
e baixe os <a href="index.html?filename=3.0/download.html">pacotes</a>!<br>
<br>
<b>28 de Janeiro de 2004</b> - <a href="index.html?filename=3.0/changes.html">O desenvolvimento continua </a>!
E n&oacute;s temos um <a href="3.0/doc/promo/kdevelop.pdf">flyer do KDevelop 3.0</a> novinho gra&ccedil;as a <a href="http://www.sourcextreme.com/">SourceXtreme</a>.<br>
<br>
<b>21 de Janeiro de 2004</b> - O KDevelop recebeu o <i>Pr&ecirc;mio de Excel&ecirc;ncia de Produto</i> como <a href="http://www.linuxworldexpo.com/linuxworldny/V40/index.cvn?ID=10240">Melhor Ferramenta de Desenvolvimento</a>
na <a href="http://www.linuxworldexpo.com">expo-confer&ecirc;ncia Linuxworld New York 2004</a>.<br>
<br>
<b>19 de Janeiro de 2004</b> - Lan&ccedil;amento do KDevelop-3.0.0 Release Candidate 1.
As mudan&ccedil;as est&atilde;o no <a href="index.html?filename=3.0/changes.html">Changelog</a>.
Voc&ecirc; pode baix&aacute;-lo na <a href="index.html?filename=3.0/download.html">p&aacute;gina de download </a>.<br>
<br>
<b>14 de Janeiro de 2004</b> - O KDevelop foi anunciado como um dos <a href="http://www.linuxworldexpo.com/linuxworldny/V40/">finalistas para o pr&ecirc;mio de Melhor Ferramenta de Desenvolvimento</a>
na Expo-confer&ecirc;ncia LinuxWorld New York 2004.<br>
<br>
<b>13 de Janeiro de 2004</b> - <a href="http://docs.kde.org/kde3/en/kdevelop/kde_app_devel/">Mais</a> <a href="http://docs.kde.org/kde3/en/kdevelop/kdearch/">documenta&ccedil;&atilde;o</a>
&eacute; agora automaticamente construida gra&ccedil;as ao cvs do KDevelop. Muito obrigado ao Lauri Watts da equipe de internacionaliza&ccedil;&atilde;o.<br>
<br>
<b>09 de Janeiro 2004</b> - O problema com a API de documenta&ccedil;&atilde;o On-line est&aacute; resolvido.<br>
<br>
<b>07 de Janeiro 2004</b> - Problemas na API de documenta&ccedil;&atilde;o On-line. Esperamos resolv&ecirc;-los nos pr&oacute;ximos dias.<br>
<br>
<b>03 de Janeiro 2004</b> - O website foi totalmente atualizado por Alexander Dymo.<br>
<br>
<?php module_tail();?>
