<?php module_head("Communiqu&eacute; de presse KDevelop 1.0"); ?>

Cette version 1.0 est la version finale officielle pour les syst&egrave;mes KDE 1.x.<P>KDevelop 1.0 - L'environnement de d&eacute;veloppement de KDE

<P>
1. Introduction

<P>
Cette version 1.0 est la version finale officielle pour les syst&egrave;mes KDE 1.x.
Depuis que KDevelop (<a
href="http://www.kdevelop.org">http://www.kdevelop.org</a>
) est pass&eacute;e en version beta en ao&ucirc;t 1999, 
nous avons pass&eacute; 4 mois de d&eacute;veloppement rien qu'en tests, corrections et am&eacute;liorations 
de la base de code actuelle. Apr&egrave;s &ccedil;a, nous pouvons maintenant fournir un meilleur support pour 
diff&eacute;rents syst&egrave;mes Unix. L'EDI a d&eacute;montr&eacute; sa stabilit&eacute; en tests r&eacute;els par 
des programmeurs, qui ont cr&eacute;&eacute; plus d'une douzaine d'applications avec des versions beta de 
KDevelop. Maintenant, tous les bogues sont corrig&eacute;s et KDevelop a montr&eacute; qu'il &eacute;tait utilisable 
et a combl&eacute; les esp&eacute;rances des auteurs. Nous esp&eacute;rons que notre travail est une bonne 
contribution au d&eacute;veloppement du logiciel libre.

<P>
2. Intention

<P>
La raison principale de la cr&eacute;ation de KDevelop &eacute;tait l'abscence d'une solution moderne et 
comp&eacute;titive pour le d&eacute;veloppement d'applications. 
Bien que les syst&egrave;mes Unix 
offrent &agrave; l'utilisateur un bon environnement stable, avec le 
syst&egrave;me X Window, des outils modernes disponibles sous d'autres syst&egrave;mes d'exploitation 
manquent.

<P>
Alors que les d&eacute;veloppeurs Unix purs et durs consid&egrave;rent Emacs et vi comme
la solution ultime, KDE offre aux d&eacute;veloppeurs un cadre complet d'application avec 
la librairie Qt. La disponibilit&eacute; commerciale de Qt attire aussi l'attention des 
firmes de d&eacute;veloppement commerciales. 
Par cons&eacute;quent, le projet KDevelop veut

<P><ol type="a">
<li>offrir un environnement d'&eacute;criture de code gratuit
<li>faciliter l'utilisatiion d'outils de d&eacute;veloppement standards comme autoconf et automake
<li>offrir un &eacute;diteur de bo&icirc;te de dialogue graphique qui r&eacute;duit les cycles de conception d'interface
<li>fournir aux d&eacute;veloppeurs un acc&egrave;s direct et facile &agrave; la documentation
&eacute;crite pas l'&eacute;quipe ou par des tierces parties. Ceci inclut la documentation sur les API KDE et QT.
</ol>

<P>
3. Vue d'ensemble

<P>
L'EDI KDevelop fournit les outils suivants pour le d&eacute;veloppement C/C++:

<P><ol type ="a">
<li>un g&eacute;n&eacute;rateur de projet bas&eacute; sur un assistant qui construit des cadres configurables pour de nombreux types d'application
<li>un environnement pour coder incluant:

<ul>
<li>un &eacute;diteur avec accentuation syntaxique
<li>une navigateur et afficheur de classes
<li>de nombreux visualisateurs de fichiers
</ul>
<li>un syst&egrave;me de documentation pour un acc&egrave;s direct &agrave; la documentation HTML en ligne, 
   incluant 5 manuels pour le d&eacute;veloppement KDE/Qt et des recherches rapides
<li>un &eacute;diteur de bo&icirc;tes de dialogue qui comble le besoin de construction rapide d'interfaces utilisateur, 
   imbriqu&eacute; compl&egrave;tement dans l'environnement de d&eacute;veloppement
<li>fonctionne avec le type mime des fichiers pour lancer automagiquement l'application 
   appropri&eacute;e dans KDevelop, comme KIconEdit pour les bitmaps
   ou KDbg pour les ex&eacute;cutables
<li>support CVS pour le d&eacute;veloppement de projets
<li>support pour localisation non-compliqu&eacute;e de projets
<li>traduction en 17 langues
<li>beaucoup de fonctionnalit&eacute;s suppl&eacute;mentaires comme l'enregistrement automatique, commandline-passing etc.
</ol>

<P>
Ceci permet aux programmeurs de r&eacute;duire les cycles de d&eacute;veloppement au minimum,
tout en offrant la flexibilit&eacute; de travailler comme ils veulent en m&ecirc;me temps.

<P>
Nous voudrions mentionner que m&ecirc;me si KDevelop a besoin de KDE et Qt pour fonctionner,
vous pouvez aussi bien l'utiliser pour n'importe quel autre projet C++. Il a &eacute;t&eacute; con&ccedil;u 
avant tout comme un environnement de d&eacute;veloppement C/C++.

<P>
4. Pourquoi utiliser KDevelop

<P>
Tous les d&eacute;veloppeurs demanderons si KDevelop peut &ecirc;tre meilleur que Emacs, 
MS Visual Studio, ou Borland. Le fait que KDevelop fournisse une interface compl&egrave;te et 
user-friendly n'est pas souvent consid&eacute;r&eacute;. 

<P>
Mais nous ne pensons pas que nous devons revenir &agrave; un environnement &agrave; long terme 
comme par exemple Emacs. En fait, KDevelop est d&eacute;velopp&eacute; avec des versions beta de 
KDevelop. Dans notre propre int&eacute;r&ecirc;t, la stabilit&eacute; &eacute;tait et est le but principal.
Vous pouvez exiger de KDevelop de faire ce que vous voulez qu'il fasse, il restera 
sable, comme nous avons pu le remarquer avec les rapports d'utilisateurs de versions ant&eacute;rieures. 

<P>
Les caract&eacute;ristiques ont &eacute;t&eacute; con&ccedil;ues pour r&eacute;pondre &agrave; nos propres besoins.
Le programmeur peut esp&eacute;rer que son environnement interagisse avec lui intuitivement et d'une mani&egrave;re 
rapide et agr&eacute;able.

<P>
Toutes les caract&eacute;ristiques sont bien document&eacute;es, &eacute;tant donn&eacute; que nous fournissons 
un ensemble complet de manuels pour donner les bases de KDE &agrave; tous les utilisateurs.

<P>
Nous esp&eacute;rons que notre contribution au march&eacute; du logiciel libre 
fera r&eacute;aliser aux utilisateurs et programmeurs qu'ils ont un choix.

<P>
5. Le futur

<P>
Comme KDE avance avec les nouvelles technologies, KDevelop le suit avec le temps.
En plus du travail final sur KDevelop 1.0, nous avons d&eacute;j&agrave; &eacute;volu&eacute; 
vers la version 2.0 qui supportera KDE 2 et les versions futures de la librairie Qt. 
Alors restez au courant!

<P>
6. A propos de l'&eacute;quipe

<P>
Le projet KDevelop, d&eacute;marr&eacute; pendant l'&eacute;t&eacute; 1998, vise &agrave; 
fournir aux d&eacute;veloppeurs un bon environnement stable et utile qui peut concurrencer 
les EDI modernes. Depuis le d&eacute;but du d&eacute;veloppement, l'&eacute;quipe s'est agrandie des 
trois membres du noyau de l'&eacute;quipe &agrave; sept codeurs et une &eacute;quipe de traduction de plus de 
50 personnes.
En m&ecirc;me temps, beaucoup de beta-testeurs nous ont rejoint et ont partag&eacute; leur exp&eacute;rience 
pour am&eacute;liorer la stabilit&eacute; et la fonctionnalit&eacute; de KDevelop.

<?php module_tail(); ?>
