<?php module_head("Annonce de la sortie de KDevelop 3.0"); ?>

<P>DATE: 03 FEVRIER 2004</P>
<P>POUR SORTIE IMMINENTE</P>
<H3 ALIGN="center">Annonce de la sortie de KDevelop 3.0</H3>
<P><STRONG>L'&eacute;quipe de KDevelop lance une r&eacute;vision majeure de leur IDE Open Source r&eacute;compens&eacute;</STRONG></P>
<P>03 F&eacute;vrier 2004 (INTERNET).
L'&eacute;quipe de KDevelop est fi&egrave;re de livrer KDevelop 3.0, la premi&egrave;re r&eacute;vision majeure de leur Environnement de D&eacute;veloppement Int&eacute;gr&eacute; (IDE) r&eacute;compens&eacute;, compl&eacute;tement r&eacute;&eacute;crit.
</P>
<P>
"KDevelop est une clef pour atteindre de tout nouveaux niveaux de productivit&eacute;. C'est un IDE qui convient pour toutes les t&acirc;ches, de la programmation syst&egrave;me au d&eacute;veloppement GUI (Inteface Utilisateur Graphique) RAD (D&eacute;veloppement Rapide d'Applications). Integrant tous les outils de d&eacute;veloppement UNIX, fournissant un support le d&eacute;veloppement en &eacute;quipe avec diff&eacute;rents syst&egrave;mes d'outils de contr&ocirc;le de version et avec une longue liste de langages support&eacute;s, KDevelop est un excellent choix pour les d&eacute;veloppeurs UNIX. Disponible sur diff&eacute;rentes plateformes comme Mac OS X et Windows/Cygwin, KDevelop est un bon outil pour le d&eacute;veloppement multi-plateformes. Le support d'outils de d&eacute;veloppement communs vous permet de d&eacute;velopper des applications pour un grand nombre de plateformes incluant les plateformes embarqu&eacute;es." dixit Alexander Dymo, co-mainteneur du projet.
</P>
<P>
"Avec son nouveau noyau, ind&eacute;pendant du langage et bas&eacute; sur des plug-in, et le large support pour les outils de d&eacute;veloppement communs, KDevelop est d&eacute;j&agrave; de-facto le standard IDE sur les bureaux Linux/Unix" ajouta Harald Fernengel, membre du projet depuis longtemps.
</P>
<P>
"L'&eacute;quipe KDevelop a fait un excellent travail avec cette version. Plus de 40 d&eacute;veloppeurs ont apport&eacute; leur contribution au projet pendant une dur&eacute;e de 14 mois. Vous remarquerez qu'il a &eacute;t&eacute; pris soin dans la documentation et dans l'interface utilisateur. Cette version est puissante, et maintenant facile &agrave; utiliser." nota Amilcar do Carmo Lucas, coordinateur de version.
</P>

<H4>Am&eacute;liorations majeures</H4>
<P>
KDevelop supporte maintenant plus de 15 langages de programmation et de nombreux syst&egrave;mes de contr&ocirc;les de version, des d&eacute;bogueurs, des formats de documentation et des outils de construction. Tout &eacute;diteur supportant les interfaces KTextEditor peut &ecirc;tre utilis&eacute; comme &eacute;diteur natif de KDevelop, comme kate, QEditor et kvim. Les outils de construction comme automake ou ant sont support&eacute;s nativement, ce qui veut dire que KDevelop ne maintient plus son propre r&eacute;pertoire d'objet. Des changements dans les fichiers natifs du projet se refl&egrave;teront dans KDevelop et vice-versa.
</P><P>
Le support C++ offre une vue des classes qui montre tous les symboles aussi bien en liste ou par hi&eacute;rarchie par ordre alphab&eacute;tique et permet une navigation ais&eacute;e dans le code. Un parseur met &agrave; jour les symboles en temps r&eacute;el et montre aussi les erreurs syntaxiques dans le code source. L'ach&egrave;vement automatique du code r&eacute;agit m&ecirc;me aux signaux et slots QT.
</P><P>
Avec sa nouvelle architecture ouverte, KDevelop peut &ecirc;tre personnalis&eacute;e en tous points. L'interface utilisateur peut passer en temps r&eacute;el du mode classique MDI au mode IDEAl moderne, caract&eacute;ris&eacute; par une approche centr&eacute;e sur le code avec des vues-outils sur demande.
</P><P>
KDevelop offre un support &eacute;tendu pour naviguer dans le code. Les symboles et les noms de fichiers sont accessibles en tapent juste une partie du nom, les fichiers r&eacute;cemments modifi&eacute;s sont accessibles avec une simple combinaison de touches.
</P><P>
KDevelop offre des g&eacute;n&eacute;rateurs de documentation, des debogueurs de code, des v&eacute;rificateurs de m&eacute;moire, des arrangeurs de code, une gestion de signets, et des tonnes d'outils pour rendre le d&eacute;veloppement facile et agr&eacute;able. Il est traduit en plus de 16 langues, allant de l'anglais au Tamil.
</P>

<H4>Installer les paquetages binaires de KDevelop 3.0</H4>
<P>
Les paquetages binaires pour toutes les distributions majeures de Linux se trouvent sur <a href="http://www.kdevelop.org/index.html?filename=3.0/download.html">http://www.kdevelop.org/index.html?filename=3.0/download.html</a>.
</P><P>
Une version alpha d'un binaire natif pour Mac OS X se trouve sur <a href="http://kde.opendarwin.org">http://kde.opendarwin.org</a>.
</P><P>
Le projet kde-cygwin propose KDeveleop sur <a href="http://kde-cygwin.sourceforge.net/kde3/installation.php">http://kde-cygwin.sourceforge.net/kde3/installation.php</a>.
</P><P>
Veuillez noter que l'&eacute;quipe KDevelop ne propose pas de versions binaires, tous les paquetages sont propos&eacute;s par des tiers.
</P>

<H4>Compiler KDevelop 3.0</H4>
<P>
Le code source complet de KDevelop 3.0 peut &ecirc;tre librement t&eacute;l&eacute;charg&eacute; sur <a href="http://www.kdevelop.org/">http://www.kdevelop.org</a>. L'information d&eacute;taill&eacute;e pour la construction se trouve sur <a href="http://www.kdevelop.org/index.html?filename=3.0/branches_compiling.html">http://www.kdevelop.org/index.html?filename=3.0/branches_compiling.html</a>.
</P>


<H4>A propos de KDevelop</H4>
<P>
KDevelop est un projet ind&eacute;pendant pour cr&eacute;er un environnement de d&eacute;veloppement int&eacute;gr&eacute; (IDE) puissant et facile &agrave; utiliser. Faisant partie du projet KDE, KDevelop partage le m&ecirc;me mod&egrave;le de d&eacute;veloppement ouvert et le cadre modulaire. Le r&eacute;sultat est un IDE extr&ecirc;mement personnalisable et ind&eacute;pendant du langage, sous licence GPL adopt&eacute;e par plein de d&eacute;veloppeurs et de professionnels dans le monde. Pour en savoir plus sur KDevelop, visitez <a href="http://www.kdevelop.org">http://www.kdevelop.org</a>.
</P>


<H4>A propos de KDE</H4>

<P>
KDE est un projet ind&eacute;pendant de centaines de d&eacute;veloppeurs, traducteurs, artistes et autres professionnels dans le monde, qui collaborent &agrave; travers Internet pour cr&eacute;er et distribuer librement un environnement de bureau sophistiqu&eacute;, stable et personnalisable, utilisant une architecture flexible, bas&eacute; sur des composants et transparent pour le r&eacute;seau, et offrant une plateforme de d&eacute;veloppement exceptionnelle. KDE propose un bureau stable et mature, une suite bureautique bas&eacute;e sur des composants (KOffice), un grand choix d'outils et d'utilitaires d'administration et de r&eacute;seau, et un envirennement de d&eacute;veloppement efficace et intuitif avec l'excellent IDE KDevelop. KDE est la preuve vivante que le mod&egrave;le de d&eacute;veloppement de logiciel Open Source "Bazaar-style" peut allier des technologies de haut niveau pour &eacute;galer et m&ecirc;me d&eacute;passer les logiciels commerciaux les plus complexes.
</P>
<BR><BR>
<HR NOSHADE SIZE=1 WIDTH="90%" ALIGN="center">
<FONT SIZE=2>
<EM>Communiqu&eacute; de presse:</EM> Ecrit pas Harald Fernengel, avec l'assistance inestimable de nombreux volontaires g&eacute;n&eacute;reux du projet KDE.<BR>
<EM>Coordinateurs de version:</EM> Merci &agrave; Alexander Dymo et Amilcar do Carmo Lucas pour leurs services en tant que coordinateuts de version.<BR>
<EM>Notices de marques d&eacute;pos&eacute;es:</EM>
KDE et K Desktop Environment sont des marques d&eacute;pos&eacute;es de KDE e.V. Linux est une marque d&eacute;pos&eacute;e de Linus Torvalds. UNIX est une marque d&eacute;pos&eacute;e de The Open Group aux Etats-Unis et dans d'autres pays. Toutes les autres marques d&eacute;pos&eacute;es et copyrights mentionn&eacute;s dans cette annonce sont la propri&eacute;t&eacute; de leurs propri&eacute;taires respectifs.
<BR>
</FONT>
<HR NOSHADE SIZE=1 WIDTH="90%" ALIGN="center">

<H4>Contacts presse:</H4>

Mondial (Allemand et Anglais): Harald Fernengel, <a href="mailto:harry at kdevelop.org">harry at kdevelop.org</a>, (47) 92043220<BR>
Mondial (Ukrainien, Russe et Anlais): Alexander Dymo, <a href="mailto:cloudtemple at mksat.net">cloudtemple at mksat.net</a>, (38) 0675122801<BR>
Mondial (Su&eacute;dois et Anglais): Jens Dagerbo, <a href="mailto:jens.dagerbo at swipnet.se">jens.dagerbo at swipnet.se</a><BR>
Mondial (Portuguais): Amilcar do Carmo Lucas, <a href="mailto:amilcar at ida.ing.tu-bs.de">amilcar at ida.ing.tu-bs.de</a><BR>
Mondial (Italien): Roberto Raggi, <a href="mailto:roberto at kdevelop.org">roberto at kdevelop.org</a><BR>

<?php module_tail(); ?>
