<?php include_file("$k_base_version/cvsbranches.ihtml"); // this is a trick to pass a non-existing path to the include_file() ?>

<?php module_head("Instructions pour une version compil&eacute;e de KDevelop 3.0.x"); ?>
Veuillez d'abord obtenir les sources pour <b>KDE_3_2_BRANCH</b> comme il est expliqu&eacute; ci-dessous.
<br>
Avant de continuer, veuillez v&eacute;rifier que votre ordinateur a tous les <a href="index.html?filename=3.0/requirements.html">logiciels requis</a> instal&eacute;s.
<br>
<br>
Initia;iser le syst&egrave;me de compilation&nbsp;:
<pre>
       $ cd kdevelop
       $ make -f admin/Makefile.common cvs-clean
       $ make -f Makefile.cvs
</pre>
<?php
  include_file("3.0/compiling.ihtml");
  module_tail();
  module_head("Comment garder votre version &agrave; jour");
?>

<br>
Apr&egrave;s avoir t&eacute;l&eacute;charg&eacute; et compil&eacute; l'une des branches CVS
ci-dessus, vous voulez la garder &agrave; jour pour vous procurer tous les correctifs.
Pour &eacute;viter d'avoir &agrave; taper toutes les commandes qui fixent les variables d'environnement
n&eacute;cessaires chaque fois que vous faites une mise &agrave; jour, vous pouvez les inclure dans votre fichier
.cshrc ou .bashrc.<br>

Si vous utilisez le shell bash, veuillez ajouter les lignes suivantes&nbsp;:<br>

<pre>
export KDEDIR=/o&ugrave;/est/votre/kde3
export QTDIR=/o&ugrave;/est/votre/qt3
export LD_LIBRARY_PATH=$QTDIR/lib:$KDEDIR/lib:$LD_LIBRARY_PATH
export LIBRARY_PATH=$QTDIR/lib:$KDEDIR/lib:$LIBRARY_PATH
export PATH=$QTDIR/bin:$KDEDIR/bin:$PATH
</pre>

Si vous utilisez tcsh, veuillez ajouter les lignes suivantes&nbsp;:<br>

<pre>
setenv KDEDIR /o&ugrave;/est/votre/kde3
setenv QTDIR /o&ugrave;/est/votre/qt3
setenv LD_LIBRARY_PATH $QTDIR/lib:$KDEDIR/lib:$LD_LIBRARY_PATH
setenv LIBRARY_PATH $QTDIR/lib:$KDEDIR/lib:$LIBRARY_PATH
setenv PATH $QTDIR/bin:$KDEDIR/bin:$PATH
</pre>

<P>
<b>Note&nbsp;:</b> Pour des raisons &eacute;videntes, vous devez &eacute;diter les deux premi&egrave;res lignes pour qu'elles correspondent &agrave; votre configuration&nbsp; :)<br>
</p>

<br>
Allez ensuite dans le r&eacute;pertoire o&ugrave; vous avez mis les sources de <i>kdevelop de CVS</i> et entrez la commande de mise &agrave; jour&nbsp;:<br>

<pre>
 $ cd o&ugrave;_kde3src_est/kdevelop
 $ cvs update -dP
</pre>
<br>
L'&eacute;tape suivante d&eacute;pend du r&eacute;sultat de la commande pr&eacute;c&eacute;dente&nbsp;:<br>


Si vous obtenez quelque chose comme&nbsp;:<br>
&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;U /chemin_vers_un_r&eacute;pertoire/Makefile.am<br>
Vous devrez faire :<br>

<pre>
 $ make -f Makefile.cvs
</pre>

puis _TOUTES_ les &eacute;tapes suivantes.<br>

<br>
Si vous obtenez quelque chose comme&nbsp;:<br>
&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;P /chemin_vers_un_r&eacute;pertoire/Makefile.am<br>
Vous devrez faire&nbsp;:<br>

<pre>
 $ ./configure --enable-debug=full --prefix=$KDEDIR --with-kdelibsdoxy-dir=$KDEDIR/share/doc/HTML/en/kdelibs-apidocs
</pre>
puis _TOUTES_ les &eacute;tapes suivantes.<br>

<pre>
  $ make
  $ make install (as root)
</pre>
Si pour une raison quelconque, la commande make &eacute;choue, vous pouvez la forcer
&agrave; ignorer les erreurs avec l'option -k. Selon la gravit&eacute; de l'erreur, vous
allez vous retrouver avec une version fonctionnant ou non de kdevelop. Aussi faites le "make
-k install" &agrave; vos propres risques&nbsp;!!!. De toute fa&ccedil;on, ces erreurs sont corrig&eacute;es apr&egrave;s environ deux heures donc vous devriez essayer de faire une
mise &agrave; jour avant la dangeureuse commande :) make install.<br>

<pre>
 $ make -k
 $ make -k install (en tant que root)
</pre>

Voil&agrave;&nbsp;! Vous avez maintenant la version la plus &agrave; jour de KDevelop. Pour la lancer, veuillez entrer&nbsp;:<br>

<pre>
 $ kdevelop
</pre>

Tout ce que vous devez faire pour la garder &agrave; jour est de r&eacute;p&eacute;ter ces &eacute;tapes chaque fois que quelqu'un dans la liste de diffusion de <a href="index.html?filename=mailinglist.html">kdevelop-devel</a>
corrige une bogue. <br>
Donc vous &ecirc;tes fortement encourag&eacute; &agrave; <a href="index.html?filename=mailinglist.html">joindre
cette liste de diffusion</a>.<br><br><br>

Vous devez rapporter les bogues que vous trouvez gr&acirc;ce &agrave; la <a
href="http://bugs.kde.org/wizard.cgi">forme de soumission des bogues</a>.<br>
Vous ne devez <b>pas</b> rapporter des erreurs de compilation
dans la base de donn&eacute;es des bogues. Pour les erreurs de compilation, veuillez plut&ocirc;t utiliser la
<a href="index.html?filename=mailinglist.html">liste de diffusion</a>.<br>
<br>

Vous pouvez regarder les bogues dans <a
href="http://bugs.kde.org/buglist.cgi?product=kdevelop&amp;bug_status=UNCONFIRMED&amp;bug_status=NEW&amp;bug_status=ASSIGNED&amp;bug_status=REOPENED&amp;order=map_components.name,bugs.bug_id">la base de donn&eacute;e des bogues</a>.<br>

<?php module_tail();
module_head("Comment compiler pour FreeBSD"); ?><br>

Veuillez suivre les instructions normales mais utiliser gmake au lieu de make et apr&egrave;s
<pre>
       $ gmake -f Makefile.cvs
</pre>
faites :
<pre>
       $ export CXXFLAGS="-L/usr/X11R6/lib -I/usr/local/include/db41 -I/usr/local/include -L/usr/local/lib -I/usr/X11R6/include"
</pre>
Veuillez noter que vous avez besoin de la base de donn&eacute;es berkeley db 4.1 install&eacute;e, si vous avez une autre version, vous devez juste ajuster le chemin.<br>
Changez la ligne "ac_cv_bdb=no" pour "ac_cv_bdb=yes" dans le fichier de configuration car sinon configure n'arrive pas &agrave; trouver les biblioth&egrave;ques de la base de donn&eacute;es.<br>
Pour savoir quelle version est install&eacute;e sur votre syst&egrave;me&nbsp;:
<pre>
       $ pkg_info | grep db41
       db41-4.1.25_1       The Berkeley DB package, revision 4.1
</pre>
Les gens de FreeBSD l'ont appel&eacute;e non plus libdb.so mais libdbxx.so. Donc remplacez "-ldb" par "-ldb41" dans lib/catalog/Makefile.am<br>
Vous pouvez ensuite continuer le processus normal&nbsp;:
<pre>
       $ ./configure --prefix=/blah --enable-debug=full
</pre>

<?php module_tail(); ?>
