<?php module_head("KDE_3_2_BRANCH (actuellement)");?>
C'est la branche <b>stable</b>. Cela deviendra la version future KDevelop 3.0.5 (pas encore sortie).<br>
Elle supporte <b>KDE 3.x</b>.
<ul>
</ul>
<?php module_tail();?>

<?php module_head("3.0.4 (09-06-2004)");?>
Elle supporte <b>KDE 3.x</b>. Le tag a &eacute;t&eacute; pos&eacute; le 30-05-2004 et cette version est sortie le 2004-06-09.
<ul>
  <li>AM&Eacute;LIOR&Eacute; - Plaire aux nouveaux compilateurs haskel et ne pas retourner des donn&eacute;es au hasard.</li>
  <li>AM&Eacute;LIOR&Eacute; - Traductions d'interface&nbsp;: Hindi et Slov&egrave;ne.</li>
  <li>CORRIG&Eacute;    - <a href="http://bugs.kde.org/show_bug.cgi?id=81579">81579 : Ne pas crasher lorsque l'utilisateur essaie d' « ajouter une m&eacute;thode » sans s&eacute;lectionner une classe</a>.</li>
  <li>CORRIG&Eacute;    - <a href="http://bugs.kde.org/show_bug.cgi?id=71099">71099 : Faire que l'importateur reconnaisse plus d'en-t&ecirc;tes que les fichiers .h</a></li>
  <li>CORRIG&Eacute;    - <a href="http://bugs.kde.org/show_bug.cgi?id=79794">79794 : Ne pas crasher lorsqu'il n'y a pas de type mime pour application/x-designer</a>.</li>
</ul>
<?php module_tail();?>

<?php module_head("3.0.3 (19-04-2004)");?>
Elle supporte <b>KDE 3.x</b>. Le tag a &eacute;t&eacute; pos&eacute; le 11-04-2004 et cette version est sortie le 19-04-2004.
<ul>
  <li>AM&Eacute;LIOR&Eacute; - Signets de documentation.
  <li>CORRIG&Eacute;     - Plusieurs &eacute;l&eacute;ments s&eacute;lectionn&eacute;s ont disparu &agrave; cause des &eacute;v&egrave;nements du syst&egrave;me de fichiers qui peuvent crasher l'arborescence de fichiers.</li>
  <li>CORRIG&Eacute;     - Plusieurs analyseurs de language ont &eacute;t&eacute; mis &agrave; jour pour utiliser QRegExp au lieu de KRegExp. <a href="http://bugs.kde.org/show_bug.cgi?id=73754">#73754</a>, <a href="http://bugs.kde.org/show_bug.cgi?id=63973">#63973</a> </li>
  <li>CORRIG&Eacute;     - <a href="http://bugs.kde.org/show_bug.cgi?id=74570">74570 : Les Makefiles d'un projet personnalis&eacute; ne supportent pas le nom de projet "GNUmakefile"</a> (Ne pas essayer de devancer make.)</li>
  <li>CORRIG&Eacute;     - <a href="http://bugs.kde.org/show_bug.cgi?id=75172">75172 : Changer de projets alors que des fichiers ne sont pas sauvegard&eacute;s</a> (Ne pas fixer le marqueur de projets r&eacute;cents quand l'utilisateur annule un changement dans un projet.)</li>
  <li>CORRIG&Eacute;     - <a href="http://bugs.kde.org/show_bug.cgi?id=75943">75943 : Crash durant un examen de r&eacute;pertoire</a> (Ne crash pas lorsqu'on n'a pas la permission de lire un r&eacute;pertoire.)</li>
  <li>CORRIG&Eacute;     - <a href="http://bugs.kde.org/show_bug.cgi?id=77278">77278 : Le composant Grep ne recherche pas lorsqu'il y a des espaces dans le chemin</a> </li>
  <li>CORRIG&Eacute;     - <a href="http://bugs.kde.org/show_bug.cgi?id=78776">78776 : Crash dans CustomProjectPart::populateProject populating new project</a> </li>
</ul>
<?php module_tail();?>

<?php module_head("3.0.2 (09-03-2004)");?>
Elle supporte <b>KDE 3.x</b>. Le tag a &eacute;t&eacute; pos&eacute; le 20-02-2004 et cette version est sortie le 09-03-2004.
<ul>
    <LI>AM&Eacute;LIOR&Eacute; - Am&eacute;lioration importante du manuel de l'utilsateur KDevelop.</LI>
    <LI>AM&Eacute;LIOR&Eacute; - L'analyseur C++ est deux fois plus rapide et consomme moins de m&eacute;moire.</LI>
    <LI>AM&Eacute;LIOR&Eacute; - Le script de configuration permet maintenant de ne pas effectuer la compilation de certaines parties de KDevelop.</LI>
    <LI>AM&Eacute;LIOR&Eacute; - Faster/lighter configuration dialogs - the heaviest pages are now demand-loaded.</LI>
    <LI>AM&Eacute;LIOR&Eacute; - FileGroups plugin now smarter at applying regexps - much faster for common group definitions (<a href="http://bugs.kde.org/show_bug.cgi?id=72831">#72831</a>)</LI>
    <LI>AM&Eacute;LIOR&Eacute; - Removed performance bottleneck that made the initial parsing of a project very slow. (refer to <a href="http://bugs.kde.org/show_bug.cgi?id=73671">#73671</a>)</LI>
    <li>CORRIG&Eacute;     - Grep plugin: Don't sometimes crash when interrupting a find while a build is running.</li>
    <li>CORRIG&Eacute;     - Grep plugin: Don't confuse files with very similar filenames and avoid potentially slow O(n) lookup.</li>
    <li>CORRIG&Eacute;     - Grep plugin: Don't show garbage hits - clean up after a previous interrupted run.</li>
    <LI>ADDEITION    - Un nouveau squelette "Simple application KDE bas&eacute;e sur Designer" est ajout&eacute;.</LI>
    <LI>CORRIG&Eacute;     - Le fameux  "crash-Gentoo" est finalement trouv&eacute; et corrig&Eacute; . (<a href="http://bugs.kde.org/show_bug.cgi?id=73346">#73346</a>)</LI>
    <li>CORRIG&Eacute;     - A case where a running program that produced a lot of debug output could crash KDevelop (<a href="http://bugs.kde.org/show_bug.cgi?id=67217">#67217</a>, <a href="http://bugs.kde.org/show_bug.cgi?id=71858">#71858</a>) </li>
    <li>CORRIG&Eacute;     - <a href="http://bugs.kde.org/show_bug.cgi?id=73045">#73045</a> : switching docks when no file is loaded crash kdevelop.</li>
    <li>CORRIG&Eacute;     - <a href="http://bugs.kde.org/show_bug.cgi?id=73672">#73672</a> : kdevelop looks weird after previewing forms in KUIViewer.</li>
    <li>CORRIG&Eacute;     - <a href="http://bugs.kde.org/show_bug.cgi?id=73716">#73716</a> : close all in context menu with two changed documents doesn't respond to cancel properly.</li>
    <li>CORRIG&Eacute;     - <a href="http://bugs.kde.org/show_bug.cgi?id=74585">#74585</a> : Impossible de d&eacute;boguer le programme Hello World C++.</li>
    <li>CORRIG&Eacute;     - <a href="http://bugs.kde.org/show_bug.cgi?id=74650">#74650</a> : La liste des vues des barres d'outils n'a pas les effects GUI.</li>
    <li>CORRIG&Eacute;     - <a href="http://bugs.kde.org/show_bug.cgi?id=74712">#74712</a> : Automake 1.8.x n'est pas support&eacute;.</li>
    <li>CORRIG&Eacute;     - <a href="http://bugs.kde.org/show_bug.cgi?id=74955">#74955</a> : Crash lorsqu'on travaille avec des projets Java ant.</li>
    <LI>CORRIG&Eacute;     - Beaucoup de petites choses que nous avons oubli&eacute;es...</LI>
</ul>
<?php module_tail();?>

<?php module_head("3.0.1 (16-02-2004)");?>
Elle supporte <b>KDE 3.x</b>.
<ul>
  <li>AM&Eacute;LIOR&Eacute; - Manuel de l'utilisateur
  <li>AM&Eacute;LIOR&Eacute; - Correction de beaucoup d'erreurs typographiques.
  <li>AM&Eacute;LIOR&Eacute; - Restructuration et mise &agrave; jour du fichier &Agrave; Faire.
  <li>AM&Eacute;LIOR&Eacute; -Squelette KCModule qui utilise l'API KDE 3.0 et KGenericFactory.
  <li>AM&Eacute;LIOR&Eacute; - Mise &agrave; jour vers la derni&egrave;re version de Doxygen.
  <li>AM&Eacute;LIOR&Eacute; - Make source files generated with appwizard honor the selected file templates.
  <li>AM&Eacute;LIOR&Eacute; - Documentation Clanlib 
  <li>AM&Eacute;LIOR&Eacute; - Ask if user tries to reload the already opened project.
  <li>AM&Eacute;LIOR&Eacute; - Project templates by ignoring irrelevant documentation and other small fixes.
  <li>ADDITION    - Ajout d'une classe ConfigWidgetProxy pour le support de charge de configuration (r&eacute;duit la m&eacute;moire).
  <li>ADDITION    - Rechercher dans QEditor
  <li>ADDITION    - Possibilit&eacute; de changer lea taialle de la police dans le navigateur de documentation.
  <li>CORRIG&Eacute;    - Le support pour le language Haskell fonctionnne &agrave; nouveau.
  <li>CORRIG&Eacute;    - Supprime tous les points d'arr&ecirc;t
  <li>CORRIG&Eacute;    - Les fichiers non sauvegard&eacute;s ne le sont pas lorsque KDevelop est ferm&eacute;.
  <li>CORRIG&Eacute;    - <a href="http://bugs.kde.org/show_bug.cgi?id=58999">Bogue58999</a> : Le d&eacute;bogueur ne d&eacute;marre pas (probl&egrave;me libtool)
  <li>CORRIG&Eacute;    - <a href="http://bugs.kde.org/show_bug.cgi?id=62888">Bogue 62888</a> : Boutons Avant Retour disponibles dans le menu contextuel.
  <li>CORRIG&Eacute;    - <a href="http://bugs.kde.org/show_bug.cgi?id=69035">Bogue 69035</a> : Les options de Run ne sont pas prises en compte (makefiles personnalis&eacute;es)
  <li>CORRIG&Eacute;    - <a href="http://bugs.kde.org/show_bug.cgi?id=70175">Bogue 70175</a> : Probl&egrave;mes avec la version test minimale de wxWindows.
  <li>CORRIG&Eacute;    - <a href="http://bugs.kde.org/show_bug.cgi?id=70176">Bogue 70176</a> : Le squelette wxWindows apptemplate fait &eacute;chouer la compilation lorsque wxWindows &eacute;tait compil&eacute; avec Unicode. 
  <li>CORRIG&Eacute;    - <a href="http://bugs.kde.org/show_bug.cgi?id=71003">Bogue 71003</a> : Le projet ne peut pas &ecirc;tre traduit si srcdir != builddir.
  <li>CORRIG&Eacute;    - <a href="http://bugs.kde.org/show_bug.cgi?id=72502">Bogue 72502</a> : Kdevelop crash lorsqu'on ferme plusieurs fichiers avec le clavier.
  <li>CORRIG&Eacute;    - <a href="http://bugs.kde.org/show_bug.cgi?id=72523">Bogue 72523</a> : Le dialogue Grep ne se remplissait pas avec le texte s&eacute;lectionn&eacute;.
  <li>CORRIG&Eacute;    - <a href="http://bugs.kde.org/show_bug.cgi?id=72552">Bogue 72552</a> : L'ic&ocirc;ne de changements non sauvegard&eacute;s dispara&icirc;t m&ecirc;me si la sauvegarde ne peut pas &ecirc;tre faite.
  <li>CORRIG&Eacute;    - <a href="http://bugs.kde.org/show_bug.cgi?id=72582">Bogue 72582</a> : Crash lors du chargement des modules externes apr&egrave;s les avoir d&eacute;charg&eacute;s.
  <li>CORRIG&Eacute;    - <a href="http://bugs.kde.org/show_bug.cgi?id=73025">Bogue 73025</a> : La commande de raccourci ctrl+J fait crasher kdevelop.
  <li>CORRIG&Eacute;    - <a href="http://bugs.kde.org/show_bug.cgi?id=73039">Bogue 73039</a> : Les outils cvs peuvent faire crasher KDevelop.
  <li>CORRIG&Eacute;    - <a href="http://bugs.kde.org/show_bug.cgi?id=73116">Bogue 73116</a> : Kdevelop crash lorsqu'on tape un point &agrave; la fin d'un commentaire.
  <li>CORRIG&Eacute;    - <a href="http://bugs.kde.org/show_bug.cgi?id=73467">Bogue 73467</a> : Le make clean &eacute;tait incomplet dans parts/appwizard/common.
  <li>CORRIG&Eacute;    - <a href="http://bugs.kde.org/show_bug.cgi?id=73567">Bogue 73567</a> : Utilise -u au lieu -u3 puisqu'il est obsol&egrave;te.
  <li>CORRIG&Eacute;    - <a href="http://bugs.kde.org/show_bug.cgi?id=74955">Bogue 74955</a> : Crash lorsque l'on travaille avec des projets  Java ant.
</ul>
<?php module_tail();?>

<?php module_head("3.0.0 (03-02-2004)");?>
Release Candidate 1 (tagged on 2004-01-19)  a &eacute;t&eacute; publi&eacute;e comme 3.0.0 sans changements.
<ul>
  <li>NOUVEAU      - Devrait compiler correctement sous Mac OS X.
  <li>NOUVEAU      - Devrait compiler correctement sous cygwin.
  <li>AM&Eacute;LIOR&Eacute; - Image de d&eacute;marrage.
  <li>AM&Eacute;LIOR&Eacute; - Support Doxygen.
  <li>ADDITION    - Liens dans le navigateur de documentation pour les bases de donn&eacute;es de rapports de bogues de chaque language de programmation support&eacute; (sauf SQL).
  <li>ADDITION    - Liens dans le navigateur de documentation pour les bases de donn&eacute;es de rapports de bogues pour les outils Gtk et wxWindows.
  <li>CORRIG&Eacute;    - compile &agrave; nouveau pour KDE 3.0.x.
  <li>CORRIG&Eacute;    - bogues dans l'interface.
  <li>CORRIG&Eacute;    - 3  bogues sp&eacute;cifiques &agrave; KDevelop2.x et pr&eacute;c&eacute;dent.
  <li>CORRIG&Eacute;    - 49 bogues sp&eacute;cifiques &agrave; KDevelop3.0.
</ul>
Voici une <a href="http://bugs.kde.org/buglist.cgi?product=kdevelop&amp;resolution=CORRIG&Eacute; &amp;resolution=WORKSFORME&amp;bugidtype=include&amp;chfield=resolution&amp;chfieldfrom=2003-12-02&amp;chfieldto=2004-01-19&amp;order=Bug+Number&amp;cmdtype=doit">version interactive</a> des bogues corrig&eacute;es.<br>
Pour une liste plus d&eacute;taill&eacute;e des changements, veuillez consulter le <a href="http://webcvs.kde.org/cgi-bin/cvsweb.cgi/kdevelop/ChangeLog?r1=1.1101&amp;r2=1.1099">journal des changements CVS</a>.
<?php module_tail();?>

<?php module_head("3.0.0 beta 2 (01-12-2003)");?>
<ul>
  <li>NOUVEAU      - KDE-accels Ctrl+Shift+Alt+L/R/B/Tpour IDEAl-docks et Ctrl+Alt+fl&egrave;che gauche/fl&egrave;che droite pour naviguer dans les vues IDEAl.
  <li>NOUVEAU      - r&eacute;ponse en couleur pour le contr&ocirc;le de version pour la vue de fichiers (actuellement seulement implant&eacute;par le module externe vcs/cvsservice).
  <li>AM&Eacute;LIOR&Eacute; - analyseur pascal, il n'est plus seulement restreint &agrave; pascal-78.
  <li>AM&Eacute;LIOR&Eacute; - la plupart des extensions objets pascal/delphi sont support&eacute;es.
  <li>AM&Eacute;LIOR&Eacute; - peut naviguer dans tous les modes UI de KDevelop &agrave; la vol&eacute;e.
  <li>AM&Eacute;LIOR&Eacute; - sauvegarde l'&eacute;tat d'amarrage dans une autre section de kdeveloprc (pour permettre aux personnes (qui ont essay&eacute; les versions alpha de KMdi) d'&eacute;chapper &agrave; un cercle vicieux).
  <li>ADDITION    - un fichier kdevelop.kdevelop encore plus simple.
  <li>CORRIG&Eacute;    - 7 bogues sp&eacute;cifiques &agrave; KDevelop2.x et pr&eacute;c&eacute;dent.
  <li>CORRIG&Eacute;    - 88 bogues sp&eacute;cifiques &agrave; KDevelop3.0.
</ul>
Voici une <a href="http://bugs.kde.org/buglist.cgi?product=kdevelop&amp;resolution=CORRIG&Eacute; &amp;resolution=WORKSFORME&amp;bugidtype=include&amp;chfield=resolution&amp;chfieldfrom=2003-10-26&amp;chfieldto=2003-12-02&amp;order=Bug+Number&amp;cmdtype=doit">version interactive</a> des bogues corrig&eacute;es.<br>
Pour une liste plus d&eacute;taill&eacute;e des changements, veuillez consulter le <a href="http://webcvs.kde.org/cgi-bin/cvsweb.cgi/kdevelop/ChangeLog?r1=1.1099&amp;r2=1.1092">journal des changements CVS</a>.
<?php module_tail();?>

<?php module_head("3.0.0 beta 1 (26-10-2003)");?>
<ul>
  <li>NOUVEAU      - nouveaux squelettes d'application en C++&nbsp;: kateplugin2, noatunvisual, noatunui, kbearimportfilter, kbearplugin, kfileplugin.
  <li>NOUVEAU      - En ligne, automatiquement mise &agrave; jour toutes les 24 heures, la documentation de l'API KDevelop peut &ecirc;tre vue dans la visualisation des documents.
  <li>AM&Eacute;LIOR&Eacute; - la documentation sp&eacute;cifique &agrave; chanque language est d&eacute;plac&eacute;e vers les r&eacutes;pertoires languages/xxx/doc.
  <li>AM&Eacute;LIOR&Eacute; - nouvelle partie ajout&eacute;e pour remplacer l'ancienne svn.
  <li>AM&Eacute;LIOR&Eacute; - interfaces utilisateur MDI.
  <li>AM&Eacute;LIOR&Eacute; - support pour le language Ada (a &eacute;t&eacute; port&eacute; au mod&egrave;le de code et l'analyseur de code fonctionne).
  <li>AM&Eacute;LIOR&Eacute; - l'ex&eacute;cutable de KDevelop est chang&eacute; de gideon &agrave; kdevelop. Ceci fait que KDevelop3 s'E&acute;CRIT SUR les installations de KDevelop 2.x.
  <li>AM&Eacute;LIOR&Eacute; - restructuration des r&eacute;pertoires en fonction de la documentation de l'API.
  <li>ADDITION    - dans le gestionnaire automake, les arguments de run se font par cibles.
  <li>CORRIG&Eacute;    - 4  bogues de KDevelop2.x et des s&eacute;ries des versions pr&eacute;c&eacute;dentes.
  <li>CORRIG&Eacute;    - 23 bogues sp&eacute;cifiques &agrave; KDevelop3.0.
</ul>
Voici une <a href="http://bugs.kde.org/buglist.cgi?product=kdevelop&resolution=CORRIG&Eacute; &resolution=WORKSFORME&bugidtype=include&chfield=resolution&chfieldfrom=2003-09-24&chfieldto=2003-10-26&order=Bug+Number&cmdtype=doit">version interactive</a> des bogues corrig&eacute;es jusqu'&agrave; pr&eacute;sent.<br>
Pour une liste plus d&eacute;taill&eacute;e des changements, veuillez visiter le <a href="http://webcvs.kde.org/cgi-bin/cvsweb.cgi/kdevelop/ChangeLog?r1=1.1092&r2=1.1082">journal des changements CVS</a>.
<?php module_tail();?>

<?php module_head("3.0.0 alpha 7 (24-09-2003)");?>
<ul>
  <li>NOUVEAU      - r&eacute;pertoire des types mime dans l'arborescence de source de KDevelop 
  <li>AM&Eacute;LIOR&Eacute; - interfcae graphique pour voir/supprimer les sujets de la documentation dans le dialogue de configuration du projet 
  <li>AM&Eacute;LIOR&Eacute; - bulle d'aide sur l'interface, correction des raccourcis claviers et des onglets
  <li>AM&Eacute;LIOR&Eacute; - Manuel de l'utilisateur
  <li>AM&Eacute;LIOR&Eacute; - documentation de l'API 
  <li>ADDITION    - menu contextuel pour la vue de documentation 
  <li>ADDITION    - types mime x-fortran, x-pascal et chm (aide HTML) 
  <li>CORRIG&Eacute;    - beaucoup d'erreur de vocabulaire et grammaire ont &eacute;t&eacute; corrig&eacute;es&nbsp;! :)
  <li>CORRIG&Eacute;    - compilation avec enable-final
  <li>CORRIG&Eacute;    - 4  bogues de KDevelop2.x et des s&eacute;ries des versions pr&eacute;c&eacute;dentes.
  <li>CORRIG&Eacute;    - 13 bogues sp&eacute;cifiques &agrave; KDevelop3.0.
</ul>
Voici une <a href="http://bugs.kde.org/buglist.cgi?product=kdevelop&resolution=CORRIG&Eacute; &resolution=WORKSFORME&bugidtype=include&chfield=resolution&chfieldfrom=2003-09-11&chfieldto=2003-09-24&order=Bug+Number&cmdtype=doit">version interactive</a> des bogues corrig&eacute;es jusqu'&agrave; pr&eacute;sent.<br>
Pour une liste plus d&eacute;taill&eacute;e des changements, veuillez visiter le <a href="http://webcvs.kde.org/cgi-bin/cvsweb.cgi/kdevelop/ChangeLog?r1=1.1082&r2=1.1080">journal des changements CVS</a>.
<?php module_tail();?>

<?php module_head("3.0.0 alpha 6 (08-09-2003)");?>
<ul>
  <li>NOUVEAU      - Persistence de classe
  <li>NOUVEAU      - Module externe de compilation pour Delphi
  <li>NOUVEAU      - Information sur la version des modules externes pour &eacute;viter des incompatibilit&eacute;s avec d'anciennes versions.
   <li>NOUVEAU     - Le language de programmation actif peut &ecirc;tre chang&eacute; &agrave; la vol&eacute;e
  <li>NOUVEAU      - Gestionnaire g&eacute;n&eacute;rique de projets
    <li>NOUVEAU      - Import de la biblioth&egrave;que de l'&eacute;diteur de propri&eacute;t&eacute;s de Kugar 
  <li>AM&Eacute;LIOR&Eacute; - Reconna&icirc;t les messages d'avertissement de libtools
  <li>AM&Eacute;LIOR&Eacute; - Squelette GBA
  <li>AM&Eacute;LIOR&Eacute; - Options pour Run
  <li>AM&Eacute;LIOR&Eacute; - Visualiseur de classe
  <li>AM&Eacute;LIOR&Eacute; - D&eacute;bogueur
  <li>AM&Eacute;LIOR&Eacute; - Barres d'outils
  <li>AM&Eacute;LIOR&Eacute; - L'analyseur C++ parser esr plus rapide
  <li>AM&Eacute;LIOR&Eacute; - La compl&eacute;tion de code peut fonctionnner avec les SIGNAL et SLOT de Qt
  <li>AM&Eacute;LIOR&Eacute; - Interface utilisateur (nouveau mode IDEAl bas&eacute; sur QextMDI)
  <li>AM&Eacute;LIOR&Eacute; - Manuel de l'utilisateur
  <li>ADDITION    - Les squelettes de projet bas&eacute;s sur C et C++ ont tous des configurations avec d&eacute;bogage et optimisation
  <li>ADDITION    - Int&eacute;gration avec cervisia pour le cvs
  <li>ADDITION    - Les actions "Force Reedit", "Install" et "Install (comme utilisateur root)" sont dans le gestionnaire de projet automake
  <li>ADDITION    - Possibilit&eacute; de d&eacute;bogage &agrave; distance
  <li>ADDITION     - Support de la visualisation de classes pour SQL 
  <li>ADDITION     - Interface graphique pour cr&eacute;er des bases de donn&eacute;es de compl&eacute;tion de code (PCS) pour les biblioth&egrave;ques Qt et KDE 
  <li>ADDITION     - Des menus contextuels comme dans emacs "aller &agrave; la d&eacute;claration/d&eacute;finition" dans les fichiers c++ 
  <li>CORRIG&Eacute;    - 9  bogues de KDevelop2.x et des s&eacute;ries des versions pr&eacute;c&eacute;dentes.
  <li>CORRIG&Eacute;     - 81 bogues sp&eacute;cifiques &agrave; KDevelop3.0 ou non sp&eacute;cifi&eacute;es.
  </ul>
Voici une <a href="http://bugs.kde.org/buglist.cgi?product=kdevelop&resolution=CORRIG&Eacute; &resolution=WORKSFORME&bugidtype=include&chfield=resolution&chfieldfrom=2003-07-01&chfieldto=2003-09-08&order=Bug+Number&cmdtype=doit">version interactive</a> des bogues corrig&eacute;es.<br>
Pour une liste plus d&eacute;taill&eacute;e des changements, veuillez visiter  <a href="http://webcvs.kde.org/cgi-bin/cvsweb.cgi/kdevelop/ChangeLog?r1=1.1078&r2=1.1054">le journal des changements CVS</a>.
<?php module_tail();?>

<?php module_head("3.0.0 alpha 5 (01-07-2003)");?>
<ul>
  <li>NOUVEAU       - Support pour le language Pascal
  <li>NOUVEAU       - Support pour gestion de projet ClearCase
  <li>NOUVEAU       - Connexion au module SQL Module et test des &eacute;nonc&eacute;s SQL
  <li>NOUVEAU       - Support pour le language Ada
  <li>AM&Eacute;LIOR&Eacute; - Sauvegarde compl&egrave;te des classes (utilise maintenant la base de donn&eacute;es berkeley)
  <li>AM&Eacute;LIOR&Eacute; - Le bouton Stop arr&ecirc;te maintenant toutes les diff&eacute;rentes parties
  <li>AM&Eacute;LIOR&Eacute; - Les pr&eacute;f&eacute;rences pour l'&eacute;diteur persistent pour tous les fichiers ouverts
  <li>AM&Eacute;LIOR&Eacute; - Le r&eacute;pertoire de travail de l'&eacute;x&eacute;cutable d&eacute;bogu&eacute; est configurable
  <li>AM&Eacute;LIOR&Eacute; - Ajouter et supprimer des sous projets de l'autoprojet
  <li>AM&Eacute;LIOR&Eacute; - Int&eacute;gration CVS
  <li>AM&Eacute;LIOR&Eacute; - Support pour Java
  <li>AM&Eacute;LIOR&Eacute; - Gestionnaire de projets bas&eacute;s sur QMake
  <li>ADDITION    - Squelettes pour le language Pascal
  <li>ADDITION    - Ajout de signets persistents
  <li>ADDITION    - Syst&egrave;me d'indexation dans la vue de documentation
  <li>ADDITION   - Mode plein &eacute;cran
  <li>CORRIG&Eacute;    - 22 bogues de KDevelop2.x et des s&eacute;ries des versions pr&eacute;c&eacute;dentes.
  <li>CORRIG&Eacute;     - 86 bogues sp&eacute;cifiques &agrave; KDevelop3.0 ou non sp&eacute;cifi&eacute;es.
  </ul>
Voici une <a href="http://bugs.kde.org/buglist.cgi?product=kdevelop&resolution=CORRIG&Eacute; &resolution=WORKSFORME&bugidtype=include&chfield=resolution&chfieldfrom=2003-04-18&chfieldto=2003-07-02&order=Bug+Number&cmdtype=doit">version interactive</a> des bogues corrig&eacute;es.<br>
Pour une liste plus d&eacute;taill&eacute;e des changements, veuillez visiter  <a href="http://webcvs.kde.org/cgi-bin/cvsweb.cgi/kdevelop/ChangeLog?r1=1.1053&r2=1.1006">le journal des changements CVS</a>.
<?php module_tail();?>

<?php module_head("3.0.0 alpha 4 (18-04-2003)");?>
<ul>
  <li>NOUVEAU   - Nouvelle interface de cr&eacute;ation de fichiers
  <li>NOUVEAU   - Partie Cherche/Remplace pour des fichiers multiples
  <li>NOUVEAU   - Squelettes d'applications : kdehello, javahello, qtopia, fortran
  <li>NOUVEAU   - Configuration de la vue de sortie de Make
  <li>NOUVEAU   - Support pour Fortran, Ruby et projets tmake
  <li>ADDITION - Caract&eacute;ristiques additionnelles pour le gestionnaire de cr&eacute;ation de nouvelle classe (incluant un support de Make Member)
  <li>ADDITION - Meilleure navigation dans la documentation, support pour xml
  <li>ADDITION - Le code du parseur de classes est r&eacute;&eacute;crit
  <li>ADDITION - Interface DCOP pour FilterParts et CppParts
  <li>AM&Eacute;LIOR&Eacute; - Analyseur de classe r&eacute;&eacute;crit
  <li>AM&Eacute;LIOR&Eacute; - Support pour les projets Perl
  <li>AM&Eacute;LIOR&Eacute; - Support int&eacute;gr&eacute; pour Doxygen
  <li>CORRIG&Eacute;    - 51 bogues de KDevelop2.x et des s&eacute;ries des versions pr&eacute;c&eacute;dentes.
  <li>CORRIG&Eacute;     - 124 bogues sp&eacute;cifiques &agrave; KDevelop3.0 ou non sp&eacute;cifi&eacute;es
 </ul>
Voici une <a href="http://bugs.kde.org/buglist.cgi?product=kdevelop&resolution=CORRIG&Eacute; &resolution=WORKSFORME&bugidtype=include&chfield=resolution&chfieldfrom=2002-11-12&chfieldto=2003-04-18&order=Bug+Number&cmdtype=doit">version interactive</a> des bogues corrig&eacute;es.<br>
Pour une liste plus d&eacute;taill&eacute;e des changements, veuillez visiter <a href="http://webcvs.kde.org/cgi-bin/cvsweb.cgi/kdevelop/ChangeLog?r1=1.1005&r2=1.905">le journal des changements CVS</a>.
<?php module_tail();?>

<?php module_head("3.0.0 alpha 3 (08-01-2003)");?>
<ul>
  <li>Le code de base est compl&egrave;tement re-&eacute;crit en utilisant des composants plugins
  <li>Support ajout&eacute; pour des projets non C++ (Java, C, etc)
  <li>Nouveau mode interface utilisateur - IDEAl
  <li>Support de projet Automake/Makefile.am re-&eacute;crit et meilleur
  <li>Nouveau support de projet qmake
  <li>Auto-compl&eacute;tion C++
  <li>Int&eacute;gration du contr&ocirc;le de source (CVS, Perforce, Subversion)
  <li>Beaucoup d'autres am&eacute;liorations additionnelles
</ul>
<?php module_tail();?>
