<?php module_head("KDevelop 3.0 freigegeben"); ?>

<P>3. FEBRUAR 2004</P>
<P>ZUR SOFORTIGEN VER&Ouml;FFENTLICHUNG</P>
<H3 ALIGN="center">KDevelop 3.0 freigegeben</H3>
<P><STRONG>Das KDevelop Team ver&ouml;ffentlicht eine neue Version der preisgekr&ouml;hnten IDE mit vielen neuen Features</STRONG></P>
<P>3. Februar 2004 (The INTERNET).
Das KDevelop Team freut sich, KDevelop 3.0, das erste gr&ouml;&szlig;ere Release der komplett neugeschriebenen, preisgekr&ouml;hnten Integrierten Entwicklungsumgebung (IDE) freigeben zu k&ouml;nnen.
</P>
<P>
"KDevelop ist der Schl&uuml;ssel zu neuen Leveln der Produktivit&auml;t. Ob Systemprogrammierung oder GUI RAD Entwicklung, die IDE passt sich jedem Zweck an. Durch die Integration aller unter UNIX &uuml;blichen Entwicklungswerkzeuge, die direkte Anbindung an verschiedene Versionskontrollsysteme, die die Arbeit im Team merklich erleichtern, und die gro&szlig;e Anzahl von unterst&uuml;tzten Sprachen ist KDevelop eine exzellente Wahl f&uuml;r alle UNIX Entwickler. Durch die Verf&uuml;gbarkeit auf unterschiedlichsten Systemplattformen wie Mac OS X und Windows/Cgywin stellt KDevelop 3.0 ein ideales Werkzeug f&uuml;r alle Multiplattform-Entwickler dar. Die Unterst&uuml;tzung bekannter Entwicklungswerkzeuge erm&ouml;glicht die Entwicklung auf einer Vielzahl von Plattformen, inklusive eingebetteten Systemen." hebt Alexander Dymo, Mitverantwortlicher im Projekt, hervor.
</P>
<P>
"Mit seinem neuen sprach-unabh&auml;ngigen, Plugin basierendem Kern und weitgestreuten Unterst&uuml;tzung f&uuml;r bekannte Entwicklungswerkzeuge ist KDevelop bereits der de-facto Standard im Bereich IDEs unter Linux/Unix" f&uuml;gt Harald Fernengel, ein langj&auml;hriges Projektmitglied, hinzu.
</P>
<P>
"Mit dieser Ver&ouml;ffentlichung legt das KDevelop Team eine bewundernswerte Leistung an den Tag. &Uuml;ber 40 Entwickler trugen &uuml;ber einen Entwicklungszeitraum von 14 Monaten zum Gelingen des Projekts bei. Besondere Sorgfalt wurde der Dokumentation und der grafischen Oberfl&auml;che gewidmet. Diese Version ist m&auml;chtig, und dennoch einfach zu benutzen." bemerkt Amilcar do Carmo Lucas, Ver&ouml;ffentlichungs-Mitkoordinator.
</P>

<H4>Gr&ouml;&szlig;ere Erweiterungen</H4>
<P>
KDevelop unterst&uuml;tzt jetzt 15 Programmiersprachen und eine Vielzahl an Versionskontrollsystemen, Debuggern, Dokumentationsformaten und Compilern. Jeder Editor der die KTextEditor Schnittstelle unterst&uuml;tzt kann als Editor f&uuml;r KDevelop verwendet werden, inklusive kate, QEditor und kvim. Hilfsprogramme wie automake, qmake, und weitere werden direkt unterst&uuml;tzt. Das bedeutet, dass &Auml;nderungen an den nativen Projektdateien automatisch in KDevelop &uuml;bernommen werden und anders herum.
</P><P>
Die C++ Unterst&uuml;tzung bietet eine Klassenansicht die alle Symbole entweder flach oder hierarchisch nach Namensr&auml;nen anordnet und eine einfache Navigation im Code erm&ouml;glicht. Ein Parser im Hintergrund aktualisiert die Symbole stetig und zeigt Syntaxfehler im Quellcode an. Die Codevervollst&auml;ndigung funktioniert sogar mit Qt Signalen und Slots.
</P><P>
Durch die neue, offene Architektur kann KDevelop in jeder Hinsicht an die individuellen Bed&uuml;rfnisse angepasst werden. Die Benutzeroberfl&auml;che kann per Mausklick von der klassischen MDI-Ansicht in die moderne IDEA1 Ansicht, die den Code in den Mittelpunkt stellt und Werkzeuge bei Bedarf darstellt,  umgeschaltet werden.
</P><P>
KDevelop bietet weitreichende Unterst&uuml;tzung f&uuml;r die Navigation im Code an. Der Zugriff auf Symbole und Dateinamen ist durch das Eintippen eines Teils des Namens m&ouml;glich, vor kurzem ge&auml;nderte Dateien k&ouml;nnen mit einem einfachen Tastendruck erreicht werden.
</P><P>
KDevelop bietet Dokumentationsgeneratoren, Code Debugger, Speicher-Checker, Lesezeichenmanagement, und dutzende weitere Werkzeuge die die Entwicklung einfach und komfortabel machen. Es wurde in mehr als 16 Sprachen von Englisch bis Tamil &uuml;bersetzt.
</P>

<H4>Installation der KDevelop 3.0 Bin&auml;rpakete</H4>
<P>
Unter <a href="http://www.kdevelop.org/index.html?filename=3.0/download.html">http://www.kdevelop.org/index.html?filename=3.0/download.html</a> gibt es Bin&auml;rpakete f&uuml;r alle gr&ouml;&szlig;eren Distributionen.
</P><P>
Eine Alpha-Version eines Bin&auml;rpakets f&uuml;r Mac OS X befindet sich unter <a href="http://kde.opendarwin.org">http://kde.opendarwin.org</a>.
</P><P>
Das kde-cygwin Projekt bietet KDevelop unter <a href="http://kde-cygwin.sourceforge.net/kde3/installation.php">http://kde-cygwin.sourceforge.net/kde3/installation.php</a> an.
</P><P>
Bitte beachten Sie, dass diese Bin&auml;rpakete nicht vom KDevelop Team, sondern von Dritten, bereitgestellt werden.
</P>

<H4>KDevelop 3.0 compilieren</H4>
<P>
Der komplette Quellcode von KDevelop 3.0 kann unter <a href="http://www.kdevelop.org/">http://www.kdevelop.org</a> kostenlos heruntergeladen werden. Ausf&uuml;hrliche Informationen zum &Uuml;bersetzen der Quelltexte befinden sich unter <a href="http://www.kdevelop.org/index.html?filename=3.0/branches_compiling.html">http://www.kdevelop.org/index.html?filename=3.0/branches_compiling.html</a>.
</P>


<H4>&Uuml;ber KDevelop</H4>
<P>
KDevelop ist ein unabh&auml;ngiges Projekt mit dem Ziel eine m&auml;chtige und einfach zu benutzende integrierte Entwicklungsumgebung (IDE) zu entwickeln. Als Teil des KDE Projekts benutzt KDevelop die gleiche offene Entwicklungsmodell und das gleiche modulare Framework. Das Ergebnis ist eine h&ouml;chst anpassbare, sprachunabh&auml;ngige IDE unter der GPL Lizenz, vorangetrieben bei vielen Entwicklern weltweit. Mehr Informationen &uuml;ber KDevelop befinden sich auf der Homepage unter <a href="http://www.kdevelop.org">http://www.kdevelop.org</a>.
</P>


<H4>&Uuml;ber KDE</H4>

<P>
KDE ist ein unabh&auml;ngiges Projekt von Entwicklern, &Uuml;bersetzern, Designern und anderen Experten, die &uuml;ber das Internet zusammenarbeiten um eine anspruchsvolle, anpassbare und stabile Desktop- und B&uuml;roumgebung durch eine flexible, modular aufgebaute und netzwerktransparente Architektur zu schaffen. KDE bietet eine stabile, ausgereifte Arbeitsoberfl&auml;che, eine vollst&auml;ndige und modular aufgebaute B&uuml;ro-Suite (KOffice), eine gro&szlig;e Anzahl von Netzwerk- und Entwicklungswerkzeugen und Hilfsprogrammen sowie mit KDevelop eine effiziente, intuitive Entwicklungsumgebung. KDE ist der lebende Beweis, dass basar&auml;hnliche Open Source Entwicklung hochqualitative Anwendungen produzieren kann, die den Vergleich mit komplexen kommerziellen Programmen nicht scheuen braucht.
<BR><BR>
<HR NOSHADE SIZE=1 WIDTH="90%" ALIGN="center">
<FONT SIZE=2>
<EM>Pressemeldung:</EM> Geschrieben von Harald Fernengel mit der unbezahlbaren Unterst&uuml;tzung unz&auml;hliger Freiwilliger des KDE Projekts.<BR>
<EM>Release Koordinatoren:</EM> Danke an Alexander Dymo und Amilcar do Carmo Lucas f&uuml;r ihre Dienste als Release Koordinatoren.<BR>
<EM>Markenzeichen:</EM>
KDE und K Desktop Environment sind Markenzeichen von KDE e.V. Linux ist ein eingetragenes Markenzeichen von Linus Torvalds. UNIX ist ein eingetragenes Warenzeichen der "The Open Group" in den Vereinigten Staaten und anderen L&auml;ndern. Alle anderen in diesem Dokument verwendeten Warenzeichen und Urheberrechte sind Eigentum des jeweiligen Besitzers.
<BR>
</FONT>
<HR NOSHADE SIZE=1 WIDTH="90%" ALIGN="center">
</P>

<H4>Pressekontakte:</H4>

Weltweit (deutsch und englisch): Harald Fernengel, <a href="mailto:harry at kdevelop.org">harry at kdevelop.org</a>, (47) 92043220<BR>
Weltweit (ukrainisch, russisch und englisch): Alexander Dymo, <a href="mailto:cloudtemple at mksat.net">cloudtemple at mksat.net</a>, (38) 0675122801<BR>
Weltweit (schwedisch und englisch): Jens Dagerbo, <a href="mailto:jens.dagerbo at swipnet.se">jens.dagerbo at swipnet.se</a><BR>
Weltweit (portugiesisch): Amilcar do Carmo Lucas, <a href="mailto:amilcar at ida.ing.tu-bs.de">amilcar at ida.ing.tu-bs.de</a><BR>
Weltweit (italienisch): Roberto Raggi, <a href="mailto:roberto at kdevelop.org">roberto at kdevelop.org</a><BR>

<?php module_tail(); ?>
