<?php module_head("KDevelop 3.0.x Funktionen");?>


<ul>

<li><b>Pluginbasierende Architektur</b>
<ul>
<li>Neue Funktionen k&ouml;nnen hinzugef&uuml;gt, ersetzt und entfernt werden ohne am Grundquelltext etwas zu &auml;ndern.</li>
<li>Die Lizenz f&uuml;r Programmbibliotheken (LGPL) erlaubt die Erstellung von kommerziellen und freien IDE Plugins.</li>
<li>Unterst&uuml;tzung f&uuml;r Profile, die bestimmen welche Plugins geladen werden. Dies kann besonders in eingeschr&auml;nkten Umgebungen oder benutzerdefinierten Installationen von Bedeutung sein.</li>
</ul>
</li>

<li><b>Projektverwaltung</b>
<ul>
<li>Nahtlos integrierte <b>automake</b> und <b>qmake</b> Unterst&uuml;tzung. Eigene &Auml;nderungen sind erlaubt und werden von der IDE erkannt, genauso wie bereits existierende Projekte und Unterprojekte importiert werden k&ouml;nnen.</li>
<li>M&ouml;glichkeit eigene Makefiles f&uuml;r die Erzeugung des Projekts zu benutzen.</li>
<li>Unterst&uuml;tzung f&uuml;r <b>ant</b> - das Werkzeug f&uuml;r die Erzeugung von Java Projekten</li>
<li>Unterst&uuml;tzung f&uuml;r zus&auml;tzliche Projekttypen wie pascal, haskell, ada und anderen Scriptsprachen</li>
<li>Ein Framework mit dem sich die Unterst&uuml;tzung f&uuml;r andere Build Systeme durch das Hinzuf&uuml;gen von 
Plugins f&uuml;r den allgemeinen Projektmanager erzeugen lassen.</li>
<li>Ein "Neue Datei" Assistent f&uuml;r die Verwaltung von Dateivorlagen und die erzeugung neuer Dateien im Projekt von diesen Vorlagen.</li>
<li>Compiler Plugins um Compiler Optionen bequem in Dialogen einstellen zu k&ouml;nnen.</li>
<li>Konfigurationsprofile mit der M&ouml;glichkeit verschiedene Compiler, Compiler Flags, Erzeugungsordner, Zielarchitekturen, etc. einzustellen</li>
<li>Projekt Dokumentationswerkzeuge wie <b>doxygen</b>, um eine automatische Schnittstellendokumentation 
(in HTML, text und man Formaten) f&uuml;r die Projekte mit Querverweisen zu den verwendeten Programmbibliotheken, 
zu erstellen.</li>
<li>Unterst&uuml;tzung f&uuml;r Internationalisierungen, die &Uuml;bersetzern erlaubt ohne Probleme 
Ihre Sprache zum Projekt hinzuzuf&uuml;gen, einschlie&szlig;lich Unterst&uuml;tzung f&uuml;r 
<a href="http://l10n.kde.org/tools/kbabel/" target="main">KBabel</a>.</li>
<li>Unterst&uuml;tzung f&uumlr;r Qt/Embedded Projekte (f&uuml;r <a href="http://developer.sharpsec.com/" target="_top">Zaurus</a> und <a href="http://www.compaq.com/products/iPAQ/" target="_top">iPAQ</a> Plattformen).</li>
</ul>
</li>

<li><b>Sprachunterst&uuml;tzung</b>
<ul>
<li>15 unterst&uuml;tzte Sprachen, einschl&szlig;lich Ada, C, C++, Objective-C (mittels C Unterst&uuml;tzung), SQL, Fortran, Haskell,
Java, PHP, Pascal, Perl, Python, Ruby, Bash, XUL (inoffiziell).</li>
<li>Problemreporter der verschiedene "Probleme" mit dem Quelltext meldet w&auml;hrend Sie tippen. "Probleme" 
schlie&szlig;t Syntaxfehler, TODOs und FIXMEs ein.</li>
<li>Klassenbrowser um die Hierarchie von Klassen und anderen Symbolen im Projekt anzuzeigen.</li>
<li>Sprachparser die den Klassenbrowser und den Problemreporter bedienen.</li>
<li>Klassen-, Methoden- und Attributassistenten f&uuml;r objektorientierte Sprachen.</li>
<li>Automatische Quelltextvervollst&auml;ndigung und Codehinweise f&uuml;r Klassenvariablen, Methoden, 
Funktionsargumente und mehr.</li>
<li>Quelltextformatierung, Syntaxhervorherbung und Quelltextfaltung.</li>
<li>C++ spezifische Funktionen, wie 
<ul>
<li>"make member" - erzeugt Methodendefinitionen in der Quellcodedatei aus Methodendeklarationen in der Header Datei;</li>
<li>"extract interface" - Interface (Methodendeklarationen) auslesen und eine abstrakte Basisklasse mit diesem Interface erstellen;</li>
<li>"subclassing" - automatische Erzeugung von Unterklassen.</li>
</ul>
</li>
</ul>
</li>

<li><b>Integrierter Debugger</b>
<ul>
<li>GDB und Java Debugger Oberfl&auml;che.</li>
<li>Integrierte GDB Konsole.</li>
<li>Zeilen-, Adresse- und Methodenhaltepunkte und -beobachtungspunkte.</li>
<li>Bedingte Haltepunkte.</li>
<li>Disassembler und frame stack Betrachter.</li>
<li>Beobachtungsbaum f&uuml;r Variablen.</li>
<li>Speicher-, Register- und Bibliothekbetrachter.</li>
<li>Debugger Shell (libtool) Unterst&uuml;tzung.</li>
<li>Remote Debugging.</li>
</ul>
</li>

<li><b>Quelltextbearbeitung</b>
<ul>
<li>Es kann jeder Editor der das KDE KTextEditor Interface implementiert mit KDevelop verwendet werden.</li>
<li>Zur Zeit verf&uuml;gbare Editoren sind <a href="http://kate.kde.org/" target="main">Kate</a>, QEditor (basierend auf dem Qt Designer Editor) und KVim.</li>
<li>Projektweite Lesezeichen werden in der Projektdatei gespeichert.</li>
<li>Betrachter f&uuml;r die Unterschiede zwischen dem aktuell bearbeitetem Text und dem gespeicherten Text.</li>
<li>Betrachter der Unterschiede f&uuml;r Patchdateien.</li>
<li>Einbindung von Grep - Suche mit regul&auml;ren Ausdr&uuml;cken im Projekt.</li>
<li>Projektweites Suchen und Ersetzen.</li>
</ul>
</li>

<li><b>Versionskontrollsysteme (Version Control Systems = VCS)</b>
<ul>
<li>Eine gemeinsame Programmierschnittstelle um VCS Unterst&uuml;tzung zu KDevelop hinzuzuf&uuml;gen.</li>
<li>Unterst&uuml;tzte Versionskontrollsysteme: CVS, Perforce, Subversion und Clearcase.</li>
</ul>
</li>

<li><b>Anwendungsassistent</b>
<ul>
<li>Der Anwendungsassistent erzeugt komplette, testfertige Beispielanwendungen.</li>
<li>Vorlagen f&uuml;r jede unterst&uuml;tzte Sprache und Build System existieren.</li>
<li>M&ouml;glichkeit der Erzeugung eigener Templates.</li>
<li>Viele KDE-bezogene Projektvorlagen (KPart Anwendungen, einfache KDE Anwendungen, KControl Module, Kicker (Panel) Applets, KOffice Teile, KIOSlaves, <a href="http://www.konqueror.org/" target="main">Konqueror</a>, Noatun und Kate Plugins und Desktopstile).</li>
</ul>
</li>

<li><b>Dokumentationsbetrachter</b>
<ul>
<li>Eine vereinheitlichte Schnittstelle zum Browsen in der Dokumentation.</li>
<li>Inhaltsverzeichnis, Index und Volltextsuche (mit htdic).</li>
<li>Automatische Erkennung und Einbindung von Dokumentation f&uuml;r Qt, KDE Libs und DevHelp.</li>
<li>Unterst&uuml;tzung f&uuml;r eigene Dokumentationssammlungen (KDevelopTOC Format).</li>
<li>M&ouml;glichkeit lokale, entfernte und sogar komprimierte Dokumentationen zu &ouml;ffnen (unter Verwendung 
jedes Protokolls von Konqueror unterst&uuml;tzten Programms - http, ftp, sftp, tar, zip, usw.).</li>
<li>F&auml;higkeit verschiedene Dokumentationsformate zu &ouml;ffnen (html, text, ps, pdf, chm, usw.).</li>
</ul>
</li>

<li><b>Andere F&auml;higkeiten</b>
<ul>
<li>Die Benutzeroberfl&auml;che ist komplett anpassbar, sie erlaubt den Wechsel zwischen der klassischen 
MDI Ansicht und dem neuen IDEAl Modus ohne einen Neustart.</li>
<li>Eingebettete Konsole.</li>
<li>Dateiauswahlliste, Dateibaumbetrachter und Dateigruppen machen es m&ouml;glich auf einen externen 
Dateimanager zu verzichten.</li>
<li>Sie k&ouml;nnen jedes andere Programm das Sie zur Entwicklung ben&ouml;tigen im "Werkzeuge"-Men&uuml; 
hinzuf&uuml;gen.</li>
<li>Tester f&uuml;r regul&auml;re Ausdr&uuml;cke.</li>
<li>Valgrind Integration um Speicherl&uuml;cken in Programmen zu finden.</li>
<li>Projektver&ouml;ffentlichungs- und Komprimierungswerkzeug f&uuml;r eine automatisierte Erzeugung von 
Quelltext- und Bin&auml;rpaketen.</li>
<li>CTags Integration.</li>
<li>Teileexplorer um verf&uuml;gbare KDE Dienste abzufragen.</li>
</ul>
</li>
</ul>

<?php module_tail();?>
