<?php module_head("KDevelop <?php echo $k_base_version; ?> Ver&ouml;ffentlichungsmitteilung"); ?>

<p>29. November 2005</p>
<p>F&uuml;r sofortige Ver&ouml;ffentlichung</p>
<h3 ALIGN="center">KDevelop <?php echo $k_base_version; ?> Ver&ouml;ffentlichungsmitteilung</h3>
<p><strong>Das KDevelop-Team stellt Major Feature Release der preisgekr&ouml;nten IDE vor</strong></p>
<p>29. November 2005 (The INTERNET).
Das KDevelop Team ist stolz KDevelop <?php echo $k_base_version; ?>, die vierte Hauptver&ouml;ffentlichung der preisgekr&ouml;nten Integrierten Entwicklungsumgebung (IDE - Integrated Development Environment) vorstellen zu k&ouml;nnen.
</p>
<p>
"&Uuml;ber 30 Entwickler haben &uuml;ber einen Zeitraum von mehr als sieben Monaten an dem Projekt gearbeitet. Durchschnittliche 20 Downloads pro Stunde sind der Beweis, dass die Benutzerbasis stetig w&auml;chst. Wir haben au&szlig;erdem neue Entwickler dazu bekommen, die neue und frische Ideen mitbrachten." bemerkte Amilcar do Carmo Lucas, Release Co-Koordinator.
</p>

<h4>Wichtigste Verbesserungen</h4>
<p>
Das Hauptaugenmerk wurde bei dieser Ver&ouml;ffentlichung auf die Verbesserung des integrierten Debuggers und den neuen Qt4-Support gelegt.
</p>
<p>
KDevelop unterst&uuml;tzt nun &uuml;ber 15 Programmiersprachen und zahlreiche Versionskontrollsysteme, Debugger, Dokumentationsformate und Erstellungswerkzeuge. Jeder Editor, der das KTextEditor-Interface unterst&uuml;tzt, einschlie&szlig;lich <em>Kate</em>, <em>QEditor</em> und <em>Yzis</em>, kann als integrierter KDevelop-Editor benutzt werden. Erstellungswerkzeuge wie <em>automake</em>, <em>qmake</em> oder <em>ant</em> werden nativ unterst&uuml;tzt. Das bedeutet, dass KDevelop keine eigenen Objektverzeichnisse bereith&auml;lt. &Auml;nderungen in den nativen Projektdateien spiegeln sich direkt in KDevelop wieder und umgekehrt.
</p>
<p>
Die Klassenansicht kann alle Symbole entweder flach oder hierarchisch nach Namensr&auml;umen sortiert, anzeigen und erlaubt damit eine einfache Navigation im Quelltext. Ein Hintergrund-Parser aktualisiert die Symbole st&auml;ndig und zeigt au&szlig;erdem syntaktische Fehler im Quelltext an. Die Codevervollst&auml;ndigung kann sogar mit externen Bibliotheken und Qt-Signalen und -Slots umgehen.
</p>
<p>
Durch die offene Architektur kann KDevelop in jeder Hinsicht angepasst und erweitert werden. Die Kernfunktionalit&auml;t der IDE wurde in einen Satz Bibiotheken mit dem Namen "Kdevelop Platform" verschoben und k&ouml;nnen als Grundlage f&uuml;r neue IDEs benutzt werden. Die Benutzerschnittstelle kann vom klassichen MDI-Modus zum modernen IDEAl-Modus mit seinem Quelltextzentrierten Ansatz und "on-demand" Werkzeugansichten umgeschaltet werden.
</p>
<p>
KDevelop bietet umfangreiche Unterst&uuml;tzung um im Quelltext zu navigieren. Auf Symbole und Dateinamen kann zugegriffen werden, indem man nur einen Teil des Namens eingibt. K&uuml;rzlich ver&auml;nderte Dateien k&ouml;nnen mit nur einem einzigen Tastendruck erreicht werden.
</p>
<p>
KDevelop bietet Werkzeuge zum Erstellen der Dokumentation, Debuggen des Codes, Speicherpr&uuml;fung, Quelltext&uuml;berarbeitung (refactoring), Lesezeichenverwaltung und dutzende weitere Tools um die Entwicklung leicht und bequem zu machen. Es ist in mehr als 17 Sprachen &uuml;bersetzt.
</p>

<h4>Installieren der KDevelop <?php echo $k_base_version; ?> Bin&auml;rpakete</h4>
<p>
Bin&auml;rpakete f&uuml;r alle gro&szlig;en Linux-Distributionem k&ouml;nnen von der
<a href="http://www.kdevelop.org/index.html?filename=<?php echo $k_base_version; ?>/download.html">Downloadseite zur Version <?php echo $k_base_version; ?></a>
heruntergeladen werden.
</p>
<p>
Eine Alpha-Version des nativen Bin&auml;rpaketes f&uuml;r Mac OS X finden Sie auf
<a href="http://kde.opendarwin.org">http://kde.opendarwin.org</a>.
</p>
<p>
Eine Version f&uuml;r Windows stellt das Projekt
<a href="http://kde-cygwin.sourceforge.net/kde3/installation.php">KDE-Cygwin</a>zur Verf&uuml;gung.
</p>
<p>
Bitte beachten Sie, dass das KDevelop Team keine bin&auml;ren Versionen ver&ouml;ffentlicht. Alle Pakete werden von Drittanbietern zur Verf&uuml;gung gestellt.
</p>

<h4>KDevelop <?php echo $k_base_version; ?> kompilieren</h4>
<p>
Der komplette Quellcode von KDevelop <?php echo $k_base_version; ?> kann von
<a href="http://www.kdevelop.org/">http://www.kdevelop.org</a>
heruntergeladen werden. Detaillierte Informationen &uuml;ber das Kompilieren entnehmen Sie bitte der "Anleitung f&uuml;r eine selbst kompilierte Version" auf
<a href="http://www.kdevelop.org/index.html?filename=<?php echo $k_base_version; ?>/branches_compiling.html">dieser Seite</a>.
</p>


<h4>&Uuml;ber KDevelop</h4>
<p>
KDevelop ist ein unabh&auml;ngiges Projekt um eine m&auml;chtige und einfach zu benutzende integrierte Entwicklungsumgebung (IDE - Integrated Development Environment) zu schaffen. Als Teil des KDE-Projekts bedient sich KDevelop des gleichen offenen Entwicklungsmodells und modularen Rahmens. Das Ergebnis ist eine hochgradig anpassbare, sprachunabh&auml;ngige Entwicklungsumgebung, die unter der GPL lizensiert ist und von dutzenden Entwicklern und Experten weltweit vorangebracht wird. Mehr &uuml;ber KDevelop erfahren Sie auf
<a href="http://www.kdevelop.org/">http://www.kdevelop.org</a>.
</p>

<h4>&Uuml;ber KDE</h4>
<!--
Dieser Absatz ist sehr eigenartig geschrieben. Die gleiche information wird 2-3x
wiederholt und die Saetze sind zu lang. Da ich mir aber nicht sicher bin, ob er
nicht vielleicht von irgenwo zitiert wurde, aendere ich ihn nicht ab.
Vorschlag: Vielleicht den Vorstellungstext von kde.de kopieren.
Frederik Schwarzer, 22.02.2006
-->
<p>
KDE ist ein unabh&auml;ngiges Projekt von hunderten Entwicklern, &Uuml;bersetzern, Designern und anderen Experten weltweit, die &uuml;ber das Internet zusammenarbeiten um eine frei verf&uuml;gbare, hochentwickelte und stabile Arbeitsoberfl&auml;che und Office Umgebung zu erschaffen, die flexibel, komponentenbasiert, mit einer transparenten Netzwerkarchitektur ausgestattet und eine herausragende Entwicklungsplattform ist. KDE bietet eine stabile, ausgereifte Arbeitsoberfl&auml;che, ein komponentenbasiertes Office Paket (KOffice), eine gro&szlig;e Anzahl an Netzwerk- und Systemverwaltungswerkzeugen und Hilfsprogrammen, sowie mit KDevelop eine effiziente Entwicklungsumgebung. KDE ist der lebende Beweis, dass basar&auml;hnliche Open Source Entwicklung hochqualitative Anwendungen produzieren kann, die den Vergleich mit komplexen kommerziellen Programmen nicht scheuen brauchen.
</p>
<br>
<em>Pressemeldung:</em>
Geschrieben von Harald Fernengel mit der unbezahlbaren Unterst&uuml;tzung unz&auml;hliger Freiwilliger des KDE Projekts.
<br>
<em>Release Koordinatoren:</em>
Danke an Alexander Dymo und Amilcar do Carmo Lucas f&uuml;r ihre Dienste als Release-Koordinatoren.
<br>
<em>Markenzeichen:</em>
KDE und K Desktop Environment sind Markenzeichen von KDE e.V.
<br>
Linux ist ein eingetragenes Markenzeichen von Linus Torvalds.
<br>
UNIX ist ein eingetragenes Warenzeichen von "The Open Group" in den Vereinigten Staaten und anderen L&auml;ndern.
<br>
Alle anderen in diesem Dokument verwendeten Warenzeichen und Urheberrechte sind Eigentum des jeweiligen Besitzers.
<hr noshade size="1" width="90%" align="center">
<br>
<h4>Pressekontakte:</h4>

Weltweit (deutsch und englisch):
Harald Fernengel, <a href="mailto:harry at kdevelop.org">harry at kdevelop.org</a>, (47) 92043220<br>
Weltweit (ukrainisch, russisch und englisch):
Alexander Dymo, <a href="mailto:cloudtemple at mksat.net">cloudtemple at mksat.net</a>, (38) 0675122801<br>
Weltweit (schwedisch und englisch):
Jens Dagerbo, <a href="mailto:jens.dagerbo at swipnet.se">jens.dagerbo at swipnet.se</a><br>
Weltweit (portugiesisch):
Amilcar do Carmo Lucas, <a href="mailto:amilcar at kdevelop.org">amilcar at kdevelop.org</a><br>

<?php module_tail(); ?>
