<?php module_head("KDevelop Community at LinuxTag 2000");?>

<h4>
Gente &amp; KDevelop - Impresiones del LinuxTag 2000 en Stuttgart/Germany</h4>

<table WIDTH="100%" >
<tr>
<td><a href="graphics/fotos/linuxtag2000/sitting.jpg"><img SRC="graphics/fotos/linuxtag2000/sitting.jpg" BORDER=0 height=200 width=260></a></td>

<td>He aqu&iacute; algunas fotos de la reuni&oacute;n KDevelop en el LinuxTag
Stuttgart (29.6.-2.7.) En la foto a la izquierda pueden ver, en la &uacute;ltima
fila de izquierda a derecha, a Walter Tasin, del equipo de desarrollo "core"de
KDevelop, Stephan Uhlmann, quien es un <a href="http://www.kmud.de">Kmud</a>
y est&aacute; a s&oacute;lo una traducci&oacute;n de homepage detr&aacute;s
de KDevelop :-), una fila antes est&aacute; Mario Keller, quien viaj&oacute;
con nosotros a Stuttgart y es ajeno al proyecto KDevelop, aunque es un
"K-user".&nbsp; Al final est&aacute; Sandy Meier, nuestro mantenedor.&nbsp;
Quienes entienden alem&aacute;n, pueden encontrar un <a href="http://www.php-center.de/artikel/linuxtag.php3">informe</a>
que he preparado (soy Thomas Fromm) de nuestro viaje a Stuttgart.
<br>En nuestro <a href="ftp://fara.cs.uni-potsdam.de/pub/linuxtag/2000/">FTP</a>
tambi&eacute;n pueden encontrar algunas fotos del quiosco <a href="http://www.php.net">PHP</a>.&nbsp;
Se habla de cooperaci&oacute;n entre PGP y KDevelop en el LinuxTag2001.
(Espero que KDevelop 2 tenga apoyo para PGP en pronto :-) ).</td>
</tr>

<tr>
<td>Aqu&iacute; puede pueden verse, de izquierda a derecha, a Ralf Nolden,
conocido del Mailinglist, e es un pionero en recitaciones y es &eacute;l
quien que tiene la belleza de m&aacute;quina PIII/600 de SCO :-).&nbsp;</td>

<td><a href="graphics/fotos/linuxtag2000/group.jpg"><img SRC="graphics/fotos/linuxtag2000/group.jpg" BORDER=0 height=200 width=260></a></td>
</tr>

<tr>
<td><a href="graphics/fotos/linuxtag2000/wtasin.jpg"><img SRC="graphics/fotos/linuxtag2000/wtasin.jpg" BORDER=0 height=200 width=260></a></td>

<td>Walter Tasin. Todos le conocen como el hombre que cambia "bugs" por
"features"&nbsp; :-).&nbsp; Se rumora que es &eacute;l quien escribe el
"parser" de PGP. En la secci&oacute;n Who's Who ("Qui&eacute;n es qui&eacute;n")
que estoy haciendo, &eacute;l les puede decir qu&eacute; est&aacute; haciendo.</td>
</tr>

<tr>
<td>Stephan Uhlmann.&nbsp; Programador famoso.&nbsp; Mantenedor de <a href="http://www.kmud.de">Kmud</a>
.&nbsp; Trabaja actualmente en otros proyectos interesantes. Vea su <a href="http://www.cs.uni-potsdam.de/~uhlmann/">homepage</a>.
Stephan fue el &uacute;nico en irse con <a href="http://www.guug.de:8080/fotos/linuxtag/images/lk2k025-pUILMLDgy.jpg">ning&uacute;n
ping&uuml;inito chill&oacute;n de HP</a>, en todo el&nbsp; LinuxTag (Si
alguien de HP&nbsp;lee esto, pues que le mande uno...&nbsp; :-)).</td>

<td><a href="graphics/fotos/linuxtag2000/uhlmann.jpg"><img SRC="graphics/fotos/linuxtag2000/uhlmann.jpg" BORDER=0 height=200 width=260></a></td>
</tr>

<tr>
<td><a href="graphics/fotos/linuxtag2000/smeier.jpg"><img SRC="graphics/fotos/linuxtag2000/smeier.jpg" BORDER=0 height=200 width=260></a></td>

<td>Sandy Meier. L&iacute;der de un proyecto&nbsp; llamado KDevelop.
Espero que sepan lo que es...&nbsp; Adem&aacute;s de KDevelop, Sandy gusta
codificar PHP, es por esto que KDevelop tiene PGP :-). Stephan, Sandy y
yo trabajamos en Berl&iacute;n para la compa&ntilde;&iacute;a "startup"
de internet <a href="http://www.inubit.com">InUBIT</a>. InUBIT ha indicado
que desea ser auspiciadora del LinuxTag 2001.</td>
</tr>

<tr>
<td>Ralf dando apoyo de primer tipo.</td>

<td><a href="graphics/fotos/linuxtag2000/rnolden.jpg"><img SRC="graphics/fotos/linuxtag2000/rnolden.jpg" BORDER=0 height=200 width=260></a></td>
</tr>

<tr>
<td COLSPAN="2">Bueno, eso era todo por ahora.&nbsp; Para m&aacute;s informaci&oacute;n
sobre el LinuxTag Stuttgart, vean <a href="http://www.linuxtag.de/">esto</a>.
Para m&aacute;s impresiones y fotos vean <a href="http://www.guug.de:8080/fotos/linuxtag/story/">esto
otro</a>.
<p>Nos vemos en el Linuxday 2001,
<br>saludos cordiales,
<br><a href="http://tfromm.com/">Thomas</a></td>
</tr>
</table>
<?php module_tail();?>
