<?php module_head("Stiri 2004");?>
<b>23 December 2004</b> - Fourth issue of KDevelop TechNotes is ready.
<br><a href="doc/technotes/navigation.html">Issue 4: Effective code navigation</a><br>
<br>
<b>08. Decembrie 2004</b> - Versiunea 3.1.2 a KDevelop (corecturi de defec&#x163;iuni) a fost lansat&#259;.
Schimb&#259;rile pot fi v&#259;zute la <a href="index.html?filename=3.1/changes.html">Lista schimb&#259;rilor</a>.
Pute&#x163;i s&#259; transfera&#x163;i aceast&#259; versiune prin <a href="index.html?filename=3.1/download.html">pagina de transfer</a>.
Utilizatorii sunt <b>sf&#259;tui&#x163;i s&#259; instaleze noua versiune</b> deoarece corecteaz&#259; multe defec&#x163;iuni prezente &icirc;n versiunile anterioare.<br>
De asemenea, am fixat <b>toate</b> link-urile invalide din cele 18000 pagini ale acestui website :) Enjoy<br>
<br>
<b>05. Decembrie 2004</b> - &Icirc;nca un num&#259;r al Notelor Tehnice KDevelop este gata.
<br><a href="doc/technotes/rubyrad.html">Num&#259;rul 3: RAD (Dezvoltare Rapid&#259; de Aplica&#x163;ii) cu KDevelop folosind Ruby/Qt/KDE</a><br>
<br>
<b>30. Noiembrie 2004</b> - Primele dou&#259; numere ale Notelor Tehnice KDevelop sunt publicate &icirc;n site-ul nostru.
<br><a href="doc/technotes/kdevassistant.html">Num&#259;rul 1: Navig&acirc;nd documenta&#x163;ia cu KDevAssistant</a>
<br><a href="doc/technotes/cpprad.html">Num&#259;rul 2: RAD (Dezvoltare Rapid&#259; de Aplica&#x163;ii) cu KDevelop folosind C++/Qt/KDE</a><br>
<br>
<b>04. Noiembrie 2004</b> - Wiki este din nou activ &#x15F;i con&#x163;ine documente privint regulile de dezvoltare &#x15F;i informa&#x163;ii despre viitoarea versiune a Platformei KDevelop.<br>
<br>
<b>18. Octombrie 2004</b> - Serverul nostru apache PHP5 este din nou disponibil, deci chat-ul on-line &#x15F;i forumul sunt <a href="phorum5/read.php?2,26159">functionale din nou</a>.
Wiki va fi reparat saptamana viitoare.<br>
<br>
<b>12. Octombrie 2004</b> - Versiunea bugfix KDevelop 3.1.1 a fost lansata. Modificarile sunt in <a href="index.html?filename=3.1/changes.html">Changelog</a>. Se poate face download la <a href="index.html?filename=3.1/download.html">download page</a>.<br>
<br>
<b>27. September 2004</b> - Suntem din nou on-line dupa trei zile, problema a fost cauzata de un hard-disk defect.
 Am pierdut datele de pe forum pentru o perioada de trei saptamani si baza de date wiki database si cateva parti ale site-ului web nu sunt functionale. Va rugam asteptati, vom publica un mesaj atunci cand toate inconvenientele vor fi rezolvate.<br>
<br>
<b>14. Septembrie 2004</b> - Cateva fotografii ale echipei KDevelop (facute cu ocazia aKademy KDE World Summit) sund disponibile la <a href="index.html?filename=events/akademy2004.html">pagina evenimentului akademy2004</a>.<br>
Se poate face download la <a href="3.1/doc/promo/presentation.kpr">prezentarea</a> tinuta <em>KDE Users and Administrators conference</em>.<br>
<br>
<b>19. August 2004</b> - KDevelop 3.1 lansat impreuna cu KDE 3.3.
Verifica <a href="3.1/announce-kdevelop-3.1.html">lansarea oficiala in presa</a>,
schimbarile sunt in <a href="index.html?filename=3.1/changes.html">Changelog</a>
si ia <a href="index.html?filename=3.1/download.html">pachetele</a>!<br>
<br>
<b>22. Iulie 2004</b> - KDevelop 3.1 beta 2 dat in folosinta impreuna cu KDE 3.3 beta 2.
Se poate face download la <a href="index.html?filename=3.1/download.html">download page</a>.<br>
<br>
<b>16. Iulie 2004</b> - Va fi un <a href="http://conference2004.kde.org/tut-kdevelop.php">KDevelop workshop</a>
pe 26 August in timpul <a href="http://conference2004.kde.org">2004 KDE Community World Summit</a> in Ludwigsburg/Germany.<br>
traducerea chineza a site-ului a fost terminata multumita lui Kun Xi.<br>
<br>
<b>07. Iulie 2004</b> - KDevelop 3.1 beta 1 dat &icirc;n folosin&#x163;&#259; impreun&#259; cu KDE 3.3 beta 1.
Se poate face download la <a href="index.html?filename=3.1/download.html">pagina de transfer</a>.<br>
<br>
<b>17. Iunie 2004</b> - Site-ul web este tradus complet &icirc;n
german&#259;, spaniol&#259;, francez&#259;, polonez&#259;, portughez&#259; &#x15F;i portughez&#259; brazilian&#259;. Mul&#x163;umirile noastre traduc&#259;torilor:
Christian Weickhmann, Philipp Wagner, Miguel &Aacute;ngel De Blas B&uacute;rdalo, Alejandro Exojo, Anne-Marie Mahfouf, Marcin Mikolajczyk,
Jo&atilde;o Luis Silva Assun&ccedil;&atilde;o, Amilcar do Carmo Lucas, Eric Jardim and Helio Roberto Santana.<br>
<br>
<b>09. Iunie 2004</b> - KDevelop 3.0.4 dat in folosinta impreuna cu KDE 3.2.3.
Schimb&#259;rile sunt &icirc;n <a href="index.html?filename=3.0/changes.html">Changelog</a>.
Se poate face download la <a href="index.html?filename=3.0/download.html">download page</a>.
Sunt &#259;daugate traducerile &icirc;n hindus&#259; &#x15F;i slovac&#259; pentru GUI.<br>
<br>
<b>02. Mai 2004</b> - Website-ul este din nou in functiune.
Un atac la serverul nostru apache a cauzat o absenta de 8 zile.
Dar acum avem aparatura noua, de 3 ori mai rapida decat cea veche, runland SuSE 9.0.
Avem de asemenea noi fisiere binare in pagina de download si informatii mai bune pentru translatori.<br>
<br>
<b>19. Aprilie 2004</b> - KDevelop 3.0.3 a fost lansat impreuna cu KDE 3.2.2.
Schimbarile sunt in <a href="index.html?filename=3.0/changes.html">Changelog</a>.
Il puteti downloada in pagina de <a href="index.html?filename=3.0/download.html">download</a>.
Aceasta versiune este tradusa complet in limbile: Daneza, Germana, Engleza Britanica, Spaniola, Estoniana,
Franceza, Ungara, Italiana, Poloneza, Portugheza, Portugheza Braziliana, Sarba si Suedeza.
Si mai mult de 87 la suta in: Catalana, Japoneza, Daneza, Rusa, Tamila si Chineza Simplificata.<br>
<br>
<b>22. Martie 2004</b> - Avem un nou translator in spaniola, Miguel &Aacute;ngel De Blas B&uacute;rdalo, bine ai venit in echipa.<br>
<br>
<b>13. Martie 2004</b> - Avem un nou translator in germana, Philipp Wagner, bine ai venit in echipa.
Am resurectat o traducere veche in braziliana pe care o aveam, dar tot ne lipsesc toate fisierele din directorul
3.0. Deci inca mai cautam un translator in braziliana.<br>
<br>
<b>10. Martie 2004</b> - Acum ca refacerea website-ului este completa, cautam translatori voluntari pentru
portugheza braziliana, spaniola si germana. Daca esti dornic sa o faci, contacteaza webmaster-ul. Adresa este la sfarsitul paginii.<br>
<br>
<b>09. Martie 2004</b> - KDevelop 3.0.2 a fost lansat impreuna cu KDE 3.2.1.
Schimbarile sunt in <a href="index.html?filename=3.0/changes.html">Changelog</a>.
Il puteti downloada in pagina de <a href="index.html?filename=3.0/download.html">download</a>.<br>
<br>
<b>06. Martie 2004</b> - Refacere completa a website-ului.
Website-ul joaca un rol important in <a href="HEAD/doc/api/html/architecture.html#devteammodel">infrastructura dezvoltarii KDevelop</a>.
Obiectivul principal este sa avem pagini dependente de versiuni.
Aceasta face posibila prezentarea de informatii despre <a href="index.html?filename=3.0/kdevelop.html">versiunea stabila</a>
(3.0.x) si in lucru (HEAD) a KDevelop.<br>
Aceasta a avut multe <i>efecte secundare</i>:
informatii resurectatea despre vechiul <a href="index.html?filename=1.3/kdevelop.html">KDevelop-1.x</a>,
<a href="http://www.w3.org/">W3C</a> Supunere HTML, link-uri rupte reparate, folosirea mai intensa a CSS,
utilizatorii pot alege una din cele 4 CSS, cautare pe google si ultima, dar nu cea din urma, un nou look.
Sper ca va place - Amilcar Lucas.<br>
<br>
<b>16. Februarie 2004</b> - KDevelop 3.0.1 lansat.
Schimbarile sunt in <a href="index.html?filename=3.0/changes.html">Changelog</a>.
Il puteti downloada in <a href="index.html?filename=3.0/download.html">pagina de download</a>.<br>
<br>
<b>03. Februarie 2004</b> - KDevelop 3.0 lansat impreuna cu KDE 3.2.
Verifica <a href="3.0/announce-kdevelop-3.0.html">lansarea oficiala in presa</a>
si ia <a href="index.html?filename=3.0/download.html">pachetele</a>!<br>
<br>
<b>28. Ianuarie 2004</b> - <a href="index.html?filename=3.0/changes.html">Lucrul continua</a>!
Si avem un nou nout <a href="3.0/doc/promo/kdevelop.pdf">fluturas KDevelop 3.0</a> multumita <a href="http://www.sourcextreme.com/">SourceXtreme</a>.<br>
<br>
<b>21. Ianuarie 2004</b> - KDevelop a castigat <a href="http://www.linuxworldexpo.com/linuxworldny/V40/index.cvn?ID=10240">Best Development Tool</a>
<i>Product Excellence Award</i> la <a href="http://www.linuxworldexpo.com">Conferinta &amp; Expozitia Linuxworld din New York 2004</a>.<br>
<br>
<b>19. Ianuarie 2004</b> - Candidatul de Lansare 1 pentru KDevelop-3.0.0.
Schimbarile sunt in <a href="index.html?filename=3.0/changes.html">Changelog</a>.
Il puteti downloada in <a href="index.html?filename=3.0/download.html">pagina de download</a>.<br>
<br>
<b>14. Ianuarie 2004</b> - KDevelop a fost anuntat ca <a href="http://www.linuxworldexpo.com/linuxworldny/V40/">finalist pentru Best Development Tools</a>
la Conferinta si Expozitia LinuxWorld's Product Excellence Awards.<br>
<br>
<b>13. Ianuarie 2004</b> - <a href="http://docs.kde.org/kde3/en/kdevelop/kde_app_devel/">Mai multa</a> <a href="http://docs.kde.org/kde3/en/kdevelop/kdearch/">documentatie</a>
este acum facuta automat bazata pe KDevelop cvs. Multumiri lui Lauri Watts de la echipa de internationalizare.<br>
<br>
<b>09. Ianuarie 2004</b> - Problema documentatiei On-line API este acum reparata.<br>
<br>
<b>07. Ianuarie 2004</b> - Documentatia On-line API este momentan stricata. Speram sa o reparam in urmatoarele cateva zile.<br>
<br>
<b>03. Ianuarie 2004</b> - Continutul website-ului a fost complet reactualizat. Cu binevointa lui Alexander Dymo.<br>
<br>
<?php module_tail();?>
