<?php module_head("Recursos do KDevelop 1.x");?>

<h4>Gerenciamento de Projetos:</h4>
O arquivo de projeto mantem toda informa&ccedil;&atilde;o para os arquivos do projeto como 
propriedades de arquivo (inclui ou exclui da distribui&ccedil;&atilde;o), permitindo a cria&ccedil;&atilde;o
e altera&ccedil;&atilde;o de projetos individualmente.
Os projetos gerados s&atilde;o compat&iacute;veis com autoconf/automake.

<h4>Editor de Di&aacute;logos :</h4>
O KDevelop oferece um meio f&aacute;cil de criar GUI (Graphical User Interface - Interface Gr&aacute;fica 
para Usu&aacute;rio) com o Editor de Di&aacute;logos interno.
Voc&ecirc; pode deixar que o KDevelop gere o c&oacute;digo-fonte do di&aacute;logo e ter controle
total de suas funcionalidades.

<h4>Classparser / Classtools:</h4>
O visualizador de classes atualmente analisa gramaticalmente quase toda instru&ccedil;&atilde;o C++ e C,
classes aninhadas, estruturas dentro de classes e operadores, assim como namespaces.  Tamb&eacute;m &eacute;
poss&iacute;vel adicionar m&eacute;todos e atributos usando os di&aacute;logos das ferramentas de classes. 
As ferramentas de classe (classtool) s&atilde;o novos recursos do KDevelop.  A id&eacute;ia e que voc&ecirc;
geralmente deseja uma ferramenta que mostre a heran&ccedil;a e os m&eacute;todos que s&atilde;o utiliz&aacute;veis 
atrav&eacute;s desta heran&ccedil;a.
Esta necessidade &eacute; preenchida com a ferramenta de classes (classtool).  Trata-se de um meio
intuitivo para navegar classes no sistema e ver seus relacionamentos.

<h4>Debugador Integrado</h4>
O debugador interno que acompanha o KDevelop 1.1, permite que a utiliza&ccedil;&atilde;o mais eficiente do
visualizador de classes durante uma sess&atilde;o de debuger, facilitando o acesso ao c&oacute;digo-fonte 
para colocar pontos-de-parada e visualizar o conte&uacute;do das vari&aacute;veis da sua aplica&ccedil;&atilde;o.
 
<h4>Visualizador de Classes Gr&aacute;fico:</h4>
O Visualizador de Classes Gr&aacute;ficos oferece a possibilidade de ter uma vis&atilde;o geral do
projeto e de todas as suas classes.

<h4>Assistente de Aplica&ccedil;&otilde;es:</h4>
O KAppWizard permite a gera&ccedil;&atilde;o de diferentes frameworks de aplica&ccedil;&otilde;es para
servirem de ponto-de-partida para novos programas.
Ele pode gerar :<p>

<li>Uma aplica&ccedil;&atilde;o KDE padr&atilde;o com barra de menus, barra de ferramentas e 
barra de status;
<li>Uma mini aplica&ccedil;&atilde;o KDE com uma janela principal vazia;
<li>Uma aplica&ccedil;&atilde;o GNOME completa;
<li>Uma aplica&ccedil;&atilde;o baseada exclusivamente em QT, tambem com barra de menus, 
barra de ferramentas e barra de status;
<li>Aplica&ccedil;&otilde;es tipo terminal C/C++.

O KDevelop 1.1 inclui frameworks KDE 2/QT 2 para aqueles desenvolvedores que querem permanecer no topo 
do desenvolvimento KDE.  Tudo isto &eacute; gerado e adaptado &agrave;s necessidades da sua nova 
aplica&ccedil;&atilde;o e estar&aacute; pronto para "rodar" em segundos.



<h4>Documenta&ccedil;&atilde;o:</h4>
O KDevelop vem com um conjunto completo de documenta&ccedil;&atilde;o que consiste de cinco manuais:<p>

<li>O manual do usu&aacute;rio;
<li>O manual de programa&ccedil;&atilde;o;
<li>O tutorial;
<li>Guia de refer&ecirc;ncia da biblioteca KDE.<p>

Esta documenta&ccedil;&atilde;o mais a refer&ecirc;cia do C/C++ e a documenta&ccedil;&atilde;o do QT e do KDE
podem ser facilmente acessadas pelo browser de documenta&ccedil;&atilde;o integrado.


<h4>Quatro Treeviews:</h4>
As treeviews permitem a f&aacute;cil troca entre arquivos fonte/header, classes e documenta&ccedil;&atilde;o 
que o habilita a gerenciar seus arquivos do projeto sem usar um gerenciador de arquivos externo.

<h4>Editor Integrado:</h4>
Editor completo, incluindo realce de sintaxe. (KWrite) 

<h4>Ferramentas de Desenvolvimento Unix integradas:</h4>
N&oacute;s integramos um punhado de recursos que podem ser muito &uacute;teis.  Tamb&eacute;m 
durante os testes do KDevelop, tivemos novas id&eacute;ias para facilitar a rotina de trabalho 
e tentamos tamb&eacute;m implement&aacute;-las.  Estamos falando de : kdoc, kiconedit, kdbg, automake & friends etc.

<h4>Browser de Documenta&ccedil;&atilde;o Integrado:</h4>
O Browser de documenta&ccedil;&atilde;o oferece acesso direto &agrave; documenta&ccedil;&atilde;o atual 
das bibliotecas do QT e do KDE; aos manuais e tutoriais do KDevelop.  Com a ajuda da &aacute;rvore de 
documenta&ccedil;&atilde;o voc&ecirc; pode navegar diretamente para o t&oacute;pico de qualquer classe ou
m&eacute;todo KDE/Qt.
 
<h4>Poderos sistema de Ajuda:</h4>
O sistema de ajuda on-line (helpsystem) possui mensagens 'QuickHelp', tipo "What's this - O que &eacute; isto" - e mensagens de 
barra de status em qualquer lugar.  Desta forma, voc&ecirc; sempre tem ajuda sobre onde voc&ecirc; est&aacute; 
e o que pode fazer.
 
<h4>Gerador de Classes:</h4>
Crie suas classes interativamente.

<?php module_tail();?>
